garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f55q24.h
extern volatile CLCDATAbits_t CLCDATAbits __at(0x0D4);
// bitfield macros
#define _CLCDATA_CLC1OUT_POSN                               0x0
#define _CLCDATA_CLC1OUT_POSITION                           0x0
#define _CLCDATA_CLC1OUT_SIZE                               0x1
#define _CLCDATA_CLC1OUT_LENGTH                             0x1
#define _CLCDATA_CLC1OUT_MASK                               0x1
#define _CLCDATA_CLC2OUT_POSN                               0x1
#define _CLCDATA_CLC2OUT_POSITION                           0x1
#define _CLCDATA_CLC2OUT_SIZE                               0x1
#define _CLCDATA_CLC2OUT_LENGTH                             0x1
#define _CLCDATA_CLC2OUT_MASK                               0x2
#define _CLCDATA_CLC3OUT_POSN                               0x2
#define _CLCDATA_CLC3OUT_POSITION                           0x2
#define _CLCDATA_CLC3OUT_SIZE                               0x1
#define _CLCDATA_CLC3OUT_LENGTH                             0x1
#define _CLCDATA_CLC3OUT_MASK                               0x4
#define _CLCDATA_CLC4OUT_POSN                               0x3
#define _CLCDATA_CLC4OUT_POSITION                           0x3
#define _CLCDATA_CLC4OUT_SIZE                               0x1
#define _CLCDATA_CLC4OUT_LENGTH                             0x1
#define _CLCDATA_CLC4OUT_MASK                               0x8
#define _CLCDATA_CLC5OUT_POSN                               0x4
#define _CLCDATA_CLC5OUT_POSITION                           0x4
#define _CLCDATA_CLC5OUT_SIZE                               0x1
#define _CLCDATA_CLC5OUT_LENGTH                             0x1
#define _CLCDATA_CLC5OUT_MASK                               0x10
#define _CLCDATA_CLC6OUT_POSN                               0x5
#define _CLCDATA_CLC6OUT_POSITION                           0x5
#define _CLCDATA_CLC6OUT_SIZE                               0x1
#define _CLCDATA_CLC6OUT_LENGTH                             0x1
#define _CLCDATA_CLC6OUT_MASK                               0x20
#define _CLCDATA_CLC7OUT_POSN                               0x6
#define _CLCDATA_CLC7OUT_POSITION                           0x6
#define _CLCDATA_CLC7OUT_SIZE                               0x1
#define _CLCDATA_CLC7OUT_LENGTH                             0x1
#define _CLCDATA_CLC7OUT_MASK                               0x40
#define _CLCDATA_CLC8OUT_POSN                               0x7
#define _CLCDATA_CLC8OUT_POSITION                           0x7
#define _CLCDATA_CLC8OUT_SIZE                               0x1
#define _CLCDATA_CLC8OUT_LENGTH                             0x1
#define _CLCDATA_CLC8OUT_MASK                               0x80

// Register: CLCSELECT
#define CLCSELECT CLCSELECT
extern volatile unsigned char           CLCSELECT           __at(0x0D5);
#ifndef _LIB_BUILD
asm("CLCSELECT equ 0D5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLCT                   :8;
    };
    struct {
        unsigned SLCT0                  :1;
        unsigned SLCT1                  :1;
        unsigned SLCT2                  :1;
    };
} CLCSELECTbits_t;
extern volatile CLCSELECTbits_t CLCSELECTbits __at(0x0D5);
// bitfield macros
#define _CLCSELECT_SLCT_POSN                                0x0
#define _CLCSELECT_SLCT_POSITION                            0x0
#define _CLCSELECT_SLCT_SIZE                                0x8
#define _CLCSELECT_SLCT_LENGTH                              0x8
#define _CLCSELECT_SLCT_MASK                                0xFF
#define _CLCSELECT_SLCT0_POSN                               0x0
#define _CLCSELECT_SLCT0_POSITION                           0x0
#define _CLCSELECT_SLCT0_SIZE                               0x1
#define _CLCSELECT_SLCT0_LENGTH                             0x1
#define _CLCSELECT_SLCT0_MASK                               0x1
#define _CLCSELECT_SLCT1_POSN                               0x1
#define _CLCSELECT_SLCT1_POSITION                           0x1
#define _CLCSELECT_SLCT1_SIZE                               0x1
#define _CLCSELECT_SLCT1_LENGTH                             0x1
#define _CLCSELECT_SLCT1_MASK                               0x2
#define _CLCSELECT_SLCT2_POSN                               0x2
#define _CLCSELECT_SLCT2_POSITION                           0x2
#define _CLCSELECT_SLCT2_SIZE                               0x1
#define _CLCSELECT_SLCT2_LENGTH                             0x1
#define _CLCSELECT_SLCT2_MASK                               0x4

// Register: CLCnCON
#define CLCnCON CLCnCON
extern volatile unsigned char           CLCnCON             __at(0x0D6);
#ifndef _LIB_BUILD
asm("CLCnCON equ 0D6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned INTN                   :1;
        unsigned INTP                   :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
} CLCnCONbits_t;
extern volatile CLCnCONbits_t CLCnCONbits __at(0x0D6);
// bitfield macros
#define _CLCnCON_MODE_POSN                                  0x0
#define _CLCnCON_MODE_POSITION                              0x0
#define _CLCnCON_MODE_SIZE                                  0x3
#define _CLCnCON_MODE_LENGTH                                0x3
#define _CLCnCON_MODE_MASK                                  0x7
#define _CLCnCON_INTN_POSN                                  0x3
#define _CLCnCON_INTN_POSITION                              0x3
#define _CLCnCON_INTN_SIZE                                  0x1
#define _CLCnCON_INTN_LENGTH                                0x1
#define _CLCnCON_INTN_MASK                                  0x8
#define _CLCnCON_INTP_POSN                                  0x4
#define _CLCnCON_INTP_POSITION                              0x4
#define _CLCnCON_INTP_SIZE                                  0x1
#define _CLCnCON_INTP_LENGTH                                0x1
#define _CLCnCON_INTP_MASK                                  0x10
#define _CLCnCON_OUT_POSN                                   0x5
#define _CLCnCON_OUT_POSITION                               0x5
#define _CLCnCON_OUT_SIZE                                   0x1
#define _CLCnCON_OUT_LENGTH                                 0x1
#define _CLCnCON_OUT_MASK                                   0x20
#define _CLCnCON_EN_POSN                                    0x7
#define _CLCnCON_EN_POSITION                                0x7
#define _CLCnCON_EN_SIZE                                    0x1
#define _CLCnCON_EN_LENGTH                                  0x1
#define _CLCnCON_EN_MASK                                    0x80
#define _CLCnCON_MODE0_POSN                                 0x0
#define _CLCnCON_MODE0_POSITION                             0x0
#define _CLCnCON_MODE0_SIZE                                 0x1
#define _CLCnCON_MODE0_LENGTH                               0x1
#define _CLCnCON_MODE0_MASK                                 0x1
#define _CLCnCON_MODE1_POSN                                 0x1
#define _CLCnCON_MODE1_POSITION                             0x1
#define _CLCnCON_MODE1_SIZE                                 0x1
#define _CLCnCON_MODE1_LENGTH                               0x1
#define _CLCnCON_MODE1_MASK                                 0x2
#define _CLCnCON_MODE2_POSN                                 0x2
#define _CLCnCON_MODE2_POSITION                             0x2
#define _CLCnCON_MODE2_SIZE                                 0x1
#define _CLCnCON_MODE2_LENGTH                               0x1
#define _CLCnCON_MODE2_MASK                                 0x4

// Register: CLCnPOL
#define CLCnPOL CLCnPOL
extern volatile unsigned char           CLCnPOL             __at(0x0D7);
#ifndef _LIB_BUILD
asm("CLCnPOL equ 0D7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1POL                  :1;
        unsigned G2POL                  :1;
        unsigned G3POL                  :1;
        unsigned G4POL                  :1;
        unsigned                        :3;
        unsigned POL                    :1;
    };
} CLCnPOLbits_t;
extern volatile CLCnPOLbits_t CLCnPOLbits __at(0x0D7);
// bitfield macros
#define _CLCnPOL_G1POL_POSN                                 0x0
#define _CLCnPOL_G1POL_POSITION                             0x0
#define _CLCnPOL_G1POL_SIZE                                 0x1
#define _CLCnPOL_G1POL_LENGTH                               0x1
#define _CLCnPOL_G1POL_MASK                                 0x1
#define _CLCnPOL_G2POL_POSN                                 0x1
#define _CLCnPOL_G2POL_POSITION                             0x1
#define _CLCnPOL_G2POL_SIZE                                 0x1
#define _CLCnPOL_G2POL_LENGTH                               0x1
#define _CLCnPOL_G2POL_MASK                                 0x2
#define _CLCnPOL_G3POL_POSN                                 0x2
#define _CLCnPOL_G3POL_POSITION                             0x2
#define _CLCnPOL_G3POL_SIZE                                 0x1
#define _CLCnPOL_G3POL_LENGTH                               0x1
#define _CLCnPOL_G3POL_MASK                                 0x4
#define _CLCnPOL_G4POL_POSN                                 0x3
#define _CLCnPOL_G4POL_POSITION                             0x3
#define _CLCnPOL_G4POL_SIZE                                 0x1
#define _CLCnPOL_G4POL_LENGTH                               0x1
#define _CLCnPOL_G4POL_MASK                                 0x8
#define _CLCnPOL_POL_POSN                                   0x7
#define _CLCnPOL_POL_POSITION                               0x7
#define _CLCnPOL_POL_SIZE                                   0x1
#define _CLCnPOL_POL_LENGTH                                 0x1
#define _CLCnPOL_POL_MASK                                   0x80

// Register: CLCnSEL0
#define CLCnSEL0 CLCnSEL0
extern volatile unsigned char           CLCnSEL0            __at(0x0D8);
#ifndef _LIB_BUILD
asm("CLCnSEL0 equ 0D8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D1S                    :8;
    };
    struct {
        unsigned D1S0                   :1;
        unsigned D1S1                   :1;
        unsigned D1S2                   :1;
        unsigned D1S3                   :1;
        unsigned D1S4                   :1;
        unsigned D1S5                   :1;
    };
} CLCnSEL0bits_t;
extern volatile CLCnSEL0bits_t CLCnSEL0bits __at(0x0D8);
// bitfield macros
#define _CLCnSEL0_D1S_POSN                                  0x0
#define _CLCnSEL0_D1S_POSITION                              0x0
#define _CLCnSEL0_D1S_SIZE                                  0x8
#define _CLCnSEL0_D1S_LENGTH                                0x8
#define _CLCnSEL0_D1S_MASK                                  0xFF
#define _CLCnSEL0_D1S0_POSN                                 0x0
#define _CLCnSEL0_D1S0_POSITION                             0x0
#define _CLCnSEL0_D1S0_SIZE                                 0x1
#define _CLCnSEL0_D1S0_LENGTH                               0x1
#define _CLCnSEL0_D1S0_MASK                                 0x1
#define _CLCnSEL0_D1S1_POSN                                 0x1
#define _CLCnSEL0_D1S1_POSITION                             0x1
#define _CLCnSEL0_D1S1_SIZE                                 0x1
#define _CLCnSEL0_D1S1_LENGTH                               0x1
#define _CLCnSEL0_D1S1_MASK                                 0x2
#define _CLCnSEL0_D1S2_POSN                                 0x2
#define _CLCnSEL0_D1S2_POSITION                             0x2
#define _CLCnSEL0_D1S2_SIZE                                 0x1
#define _CLCnSEL0_D1S2_LENGTH                               0x1
#define _CLCnSEL0_D1S2_MASK                                 0x4
#define _CLCnSEL0_D1S3_POSN                                 0x3
#define _CLCnSEL0_D1S3_POSITION                             0x3
#define _CLCnSEL0_D1S3_SIZE                                 0x1
#define _CLCnSEL0_D1S3_LENGTH                               0x1
#define _CLCnSEL0_D1S3_MASK                                 0x8
#define _CLCnSEL0_D1S4_POSN                                 0x4
#define _CLCnSEL0_D1S4_POSITION                             0x4
#define _CLCnSEL0_D1S4_SIZE                                 0x1
#define _CLCnSEL0_D1S4_LENGTH                               0x1
#define _CLCnSEL0_D1S4_MASK                                 0x10
#define _CLCnSEL0_D1S5_POSN                                 0x5
#define _CLCnSEL0_D1S5_POSITION                             0x5
#define _CLCnSEL0_D1S5_SIZE                                 0x1
#define _CLCnSEL0_D1S5_LENGTH                               0x1
#define _CLCnSEL0_D1S5_MASK                                 0x20

// Register: CLCnSEL1
#define CLCnSEL1 CLCnSEL1
extern volatile unsigned char           CLCnSEL1            __at(0x0D9);
#ifndef _LIB_BUILD
asm("CLCnSEL1 equ 0D9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D2S                    :8;
    };
    struct {
        unsigned D2S0                   :1;
        unsigned D2S1                   :1;
        unsigned D2S2                   :1;
        unsigned D2S3                   :1;
        unsigned D2S4                   :1;
        unsigned D2S5                   :1;
    };
} CLCnSEL1bits_t;
extern volatile CLCnSEL1bits_t CLCnSEL1bits __at(0x0D9);
// bitfield macros
#define _CLCnSEL1_D2S_POSN                                  0x0
#define _CLCnSEL1_D2S_POSITION                              0x0
#define _CLCnSEL1_D2S_SIZE                                  0x8
#define _CLCnSEL1_D2S_LENGTH                                0x8
#define _CLCnSEL1_D2S_MASK                                  0xFF
#define _CLCnSEL1_D2S0_POSN                                 0x0
#define _CLCnSEL1_D2S0_POSITION                             0x0
#define _CLCnSEL1_D2S0_SIZE                                 0x1
#define _CLCnSEL1_D2S0_LENGTH                               0x1
#define _CLCnSEL1_D2S0_MASK                                 0x1
#define _CLCnSEL1_D2S1_POSN                                 0x1
#define _CLCnSEL1_D2S1_POSITION                             0x1
#define _CLCnSEL1_D2S1_SIZE                                 0x1
#define _CLCnSEL1_D2S1_LENGTH                               0x1
#define _CLCnSEL1_D2S1_MASK                                 0x2
#define _CLCnSEL1_D2S2_POSN                                 0x2
#define _CLCnSEL1_D2S2_POSITION                             0x2
#define _CLCnSEL1_D2S2_SIZE                                 0x1
#define _CLCnSEL1_D2S2_LENGTH                               0x1
#define _CLCnSEL1_D2S2_MASK                                 0x4
#define _CLCnSEL1_D2S3_POSN                                 0x3
#define _CLCnSEL1_D2S3_POSITION                             0x3
#define _CLCnSEL1_D2S3_SIZE                                 0x1
#define _CLCnSEL1_D2S3_LENGTH                               0x1
#define _CLCnSEL1_D2S3_MASK                                 0x8
#define _CLCnSEL1_D2S4_POSN                                 0x4
#define _CLCnSEL1_D2S4_POSITION                             0x4
#define _CLCnSEL1_D2S4_SIZE                                 0x1
#define _CLCnSEL1_D2S4_LENGTH                               0x1
#define _CLCnSEL1_D2S4_MASK                                 0x10
#define _CLCnSEL1_D2S5_POSN                                 0x5
#define _CLCnSEL1_D2S5_POSITION                             0x5
#define _CLCnSEL1_D2S5_SIZE                                 0x1
#define _CLCnSEL1_D2S5_LENGTH                               0x1
#define _CLCnSEL1_D2S5_MASK                                 0x20

// Register: CLCnSEL2
#define CLCnSEL2 CLCnSEL2
extern volatile unsigned char           CLCnSEL2            __at(0x0DA);
#ifndef _LIB_BUILD
asm("CLCnSEL2 equ 0DAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D3S                    :8;
    };
    struct {
        unsigned D3S0                   :1;
        unsigned D3S1                   :1;
        unsigned D3S2                   :1;
        unsigned D3S3                   :1;
        unsigned D3S4                   :1;
        unsigned D3S5                   :1;
    };
} CLCnSEL2bits_t;
