garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f55q24.h
// Register: VDDIO2CON
#define VDDIO2CON VDDIO2CON
extern volatile unsigned char           VDDIO2CON           __at(0x10D);
#ifndef _LIB_BUILD
asm("VDDIO2CON equ 010Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEL                    :4;
        unsigned NOT_HYS                :1;
        unsigned RDY                    :1;
        unsigned LVDSTAT                :1;
        unsigned NOT_IOMON              :1;
    };
    struct {
        unsigned SEL0                   :1;
        unsigned SEL1                   :1;
        unsigned SEL2                   :1;
        unsigned SEL3                   :1;
        unsigned nHYS                   :1;
        unsigned                        :2;
        unsigned nIOMON                 :1;
    };
} VDDIO2CONbits_t;
extern volatile VDDIO2CONbits_t VDDIO2CONbits __at(0x10D);
// bitfield macros
#define _VDDIO2CON_SEL_POSN                                 0x0
#define _VDDIO2CON_SEL_POSITION                             0x0
#define _VDDIO2CON_SEL_SIZE                                 0x4
#define _VDDIO2CON_SEL_LENGTH                               0x4
#define _VDDIO2CON_SEL_MASK                                 0xF
#define _VDDIO2CON_NOT_HYS_POSN                             0x4
#define _VDDIO2CON_NOT_HYS_POSITION                         0x4
#define _VDDIO2CON_NOT_HYS_SIZE                             0x1
#define _VDDIO2CON_NOT_HYS_LENGTH                           0x1
#define _VDDIO2CON_NOT_HYS_MASK                             0x10
#define _VDDIO2CON_RDY_POSN                                 0x5
#define _VDDIO2CON_RDY_POSITION                             0x5
#define _VDDIO2CON_RDY_SIZE                                 0x1
#define _VDDIO2CON_RDY_LENGTH                               0x1
#define _VDDIO2CON_RDY_MASK                                 0x20
#define _VDDIO2CON_LVDSTAT_POSN                             0x6
#define _VDDIO2CON_LVDSTAT_POSITION                         0x6
#define _VDDIO2CON_LVDSTAT_SIZE                             0x1
#define _VDDIO2CON_LVDSTAT_LENGTH                           0x1
#define _VDDIO2CON_LVDSTAT_MASK                             0x40
#define _VDDIO2CON_NOT_IOMON_POSN                           0x7
#define _VDDIO2CON_NOT_IOMON_POSITION                       0x7
#define _VDDIO2CON_NOT_IOMON_SIZE                           0x1
#define _VDDIO2CON_NOT_IOMON_LENGTH                         0x1
#define _VDDIO2CON_NOT_IOMON_MASK                           0x80
#define _VDDIO2CON_SEL0_POSN                                0x0
#define _VDDIO2CON_SEL0_POSITION                            0x0
#define _VDDIO2CON_SEL0_SIZE                                0x1
#define _VDDIO2CON_SEL0_LENGTH                              0x1
#define _VDDIO2CON_SEL0_MASK                                0x1
#define _VDDIO2CON_SEL1_POSN                                0x1
#define _VDDIO2CON_SEL1_POSITION                            0x1
#define _VDDIO2CON_SEL1_SIZE                                0x1
#define _VDDIO2CON_SEL1_LENGTH                              0x1
#define _VDDIO2CON_SEL1_MASK                                0x2
#define _VDDIO2CON_SEL2_POSN                                0x2
#define _VDDIO2CON_SEL2_POSITION                            0x2
#define _VDDIO2CON_SEL2_SIZE                                0x1
#define _VDDIO2CON_SEL2_LENGTH                              0x1
#define _VDDIO2CON_SEL2_MASK                                0x4
#define _VDDIO2CON_SEL3_POSN                                0x3
#define _VDDIO2CON_SEL3_POSITION                            0x3
#define _VDDIO2CON_SEL3_SIZE                                0x1
#define _VDDIO2CON_SEL3_LENGTH                              0x1
#define _VDDIO2CON_SEL3_MASK                                0x8
#define _VDDIO2CON_nHYS_POSN                                0x4
#define _VDDIO2CON_nHYS_POSITION                            0x4
#define _VDDIO2CON_nHYS_SIZE                                0x1
#define _VDDIO2CON_nHYS_LENGTH                              0x1
#define _VDDIO2CON_nHYS_MASK                                0x10
#define _VDDIO2CON_nIOMON_POSN                              0x7
#define _VDDIO2CON_nIOMON_POSITION                          0x7
#define _VDDIO2CON_nIOMON_SIZE                              0x1
#define _VDDIO2CON_nIOMON_LENGTH                            0x1
#define _VDDIO2CON_nIOMON_MASK                              0x80

// Register: ADCG1A
#define ADCG1A ADCG1A
extern volatile unsigned char           ADCG1A              __at(0x110);
#ifndef _LIB_BUILD
asm("ADCG1A equ 0110h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGA0                   :1;
        unsigned CGA1                   :1;
        unsigned CGA2                   :1;
        unsigned CGA3                   :1;
        unsigned CGA4                   :1;
        unsigned CGA5                   :1;
        unsigned CGA6                   :1;
        unsigned CGA7                   :1;
    };
} ADCG1Abits_t;
extern volatile ADCG1Abits_t ADCG1Abits __at(0x110);
// bitfield macros
#define _ADCG1A_CGA0_POSN                                   0x0
#define _ADCG1A_CGA0_POSITION                               0x0
#define _ADCG1A_CGA0_SIZE                                   0x1
#define _ADCG1A_CGA0_LENGTH                                 0x1
#define _ADCG1A_CGA0_MASK                                   0x1
#define _ADCG1A_CGA1_POSN                                   0x1
#define _ADCG1A_CGA1_POSITION                               0x1
#define _ADCG1A_CGA1_SIZE                                   0x1
#define _ADCG1A_CGA1_LENGTH                                 0x1
#define _ADCG1A_CGA1_MASK                                   0x2
#define _ADCG1A_CGA2_POSN                                   0x2
#define _ADCG1A_CGA2_POSITION                               0x2
#define _ADCG1A_CGA2_SIZE                                   0x1
#define _ADCG1A_CGA2_LENGTH                                 0x1
#define _ADCG1A_CGA2_MASK                                   0x4
#define _ADCG1A_CGA3_POSN                                   0x3
#define _ADCG1A_CGA3_POSITION                               0x3
#define _ADCG1A_CGA3_SIZE                                   0x1
#define _ADCG1A_CGA3_LENGTH                                 0x1
#define _ADCG1A_CGA3_MASK                                   0x8
#define _ADCG1A_CGA4_POSN                                   0x4
#define _ADCG1A_CGA4_POSITION                               0x4
#define _ADCG1A_CGA4_SIZE                                   0x1
#define _ADCG1A_CGA4_LENGTH                                 0x1
#define _ADCG1A_CGA4_MASK                                   0x10
#define _ADCG1A_CGA5_POSN                                   0x5
#define _ADCG1A_CGA5_POSITION                               0x5
#define _ADCG1A_CGA5_SIZE                                   0x1
#define _ADCG1A_CGA5_LENGTH                                 0x1
#define _ADCG1A_CGA5_MASK                                   0x20
#define _ADCG1A_CGA6_POSN                                   0x6
#define _ADCG1A_CGA6_POSITION                               0x6
#define _ADCG1A_CGA6_SIZE                                   0x1
#define _ADCG1A_CGA6_LENGTH                                 0x1
#define _ADCG1A_CGA6_MASK                                   0x40
#define _ADCG1A_CGA7_POSN                                   0x7
#define _ADCG1A_CGA7_POSITION                               0x7
#define _ADCG1A_CGA7_SIZE                                   0x1
#define _ADCG1A_CGA7_LENGTH                                 0x1
#define _ADCG1A_CGA7_MASK                                   0x80

