garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f55q24.h
extern volatile PORTWIN0PPSbits_t PORTWIN0PPSbits __at(0x27D);
// bitfield macros
#define _PORTWIN0PPS_PIN_POSN                               0x0
#define _PORTWIN0PPS_PIN_POSITION                           0x0
#define _PORTWIN0PPS_PIN_SIZE                               0x3
#define _PORTWIN0PPS_PIN_LENGTH                             0x3
#define _PORTWIN0PPS_PIN_MASK                               0x7
#define _PORTWIN0PPS_PORT_POSN                              0x3
#define _PORTWIN0PPS_PORT_POSITION                          0x3
#define _PORTWIN0PPS_PORT_SIZE                              0x3
#define _PORTWIN0PPS_PORT_LENGTH                            0x3
#define _PORTWIN0PPS_PORT_MASK                              0x38
#define _PORTWIN0PPS_PORTWIN0PPS_POSN                       0x0
#define _PORTWIN0PPS_PORTWIN0PPS_POSITION                   0x0
#define _PORTWIN0PPS_PORTWIN0PPS_SIZE                       0x6
#define _PORTWIN0PPS_PORTWIN0PPS_LENGTH                     0x6
#define _PORTWIN0PPS_PORTWIN0PPS_MASK                       0x3F
#define _PORTWIN0PPS_PORTWIN0PPS0_POSN                      0x0
#define _PORTWIN0PPS_PORTWIN0PPS0_POSITION                  0x0
#define _PORTWIN0PPS_PORTWIN0PPS0_SIZE                      0x1
#define _PORTWIN0PPS_PORTWIN0PPS0_LENGTH                    0x1
#define _PORTWIN0PPS_PORTWIN0PPS0_MASK                      0x1
#define _PORTWIN0PPS_PORTWIN0PPS1_POSN                      0x1
#define _PORTWIN0PPS_PORTWIN0PPS1_POSITION                  0x1
#define _PORTWIN0PPS_PORTWIN0PPS1_SIZE                      0x1
#define _PORTWIN0PPS_PORTWIN0PPS1_LENGTH                    0x1
#define _PORTWIN0PPS_PORTWIN0PPS1_MASK                      0x2
#define _PORTWIN0PPS_PORTWIN0PPS2_POSN                      0x2
#define _PORTWIN0PPS_PORTWIN0PPS2_POSITION                  0x2
#define _PORTWIN0PPS_PORTWIN0PPS2_SIZE                      0x1
#define _PORTWIN0PPS_PORTWIN0PPS2_LENGTH                    0x1
#define _PORTWIN0PPS_PORTWIN0PPS2_MASK                      0x4
#define _PORTWIN0PPS_PORTWIN0PPS3_POSN                      0x3
#define _PORTWIN0PPS_PORTWIN0PPS3_POSITION                  0x3
#define _PORTWIN0PPS_PORTWIN0PPS3_SIZE                      0x1
#define _PORTWIN0PPS_PORTWIN0PPS3_LENGTH                    0x1
#define _PORTWIN0PPS_PORTWIN0PPS3_MASK                      0x8
#define _PORTWIN0PPS_PORTWIN0PPS4_POSN                      0x4
#define _PORTWIN0PPS_PORTWIN0PPS4_POSITION                  0x4
#define _PORTWIN0PPS_PORTWIN0PPS4_SIZE                      0x1
#define _PORTWIN0PPS_PORTWIN0PPS4_LENGTH                    0x1
#define _PORTWIN0PPS_PORTWIN0PPS4_MASK                      0x10
#define _PORTWIN0PPS_PORTWIN0PPS5_POSN                      0x5
#define _PORTWIN0PPS_PORTWIN0PPS5_POSITION                  0x5
#define _PORTWIN0PPS_PORTWIN0PPS5_SIZE                      0x1
#define _PORTWIN0PPS_PORTWIN0PPS5_LENGTH                    0x1
#define _PORTWIN0PPS_PORTWIN0PPS5_MASK                      0x20

// Register: PORTWIN1PPS
#define PORTWIN1PPS PORTWIN1PPS
extern volatile unsigned char           PORTWIN1PPS         __at(0x27E);
#ifndef _LIB_BUILD
asm("PORTWIN1PPS equ 027Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned PORTWIN1PPS            :6;
    };
    struct {
        unsigned PORTWIN1PPS0           :1;
        unsigned PORTWIN1PPS1           :1;
        unsigned PORTWIN1PPS2           :1;
        unsigned PORTWIN1PPS3           :1;
        unsigned PORTWIN1PPS4           :1;
        unsigned PORTWIN1PPS5           :1;
    };
} PORTWIN1PPSbits_t;
extern volatile PORTWIN1PPSbits_t PORTWIN1PPSbits __at(0x27E);
// bitfield macros
#define _PORTWIN1PPS_PIN_POSN                               0x0
#define _PORTWIN1PPS_PIN_POSITION                           0x0
#define _PORTWIN1PPS_PIN_SIZE                               0x3
#define _PORTWIN1PPS_PIN_LENGTH                             0x3
#define _PORTWIN1PPS_PIN_MASK                               0x7
#define _PORTWIN1PPS_PORT_POSN                              0x3
#define _PORTWIN1PPS_PORT_POSITION                          0x3
#define _PORTWIN1PPS_PORT_SIZE                              0x3
#define _PORTWIN1PPS_PORT_LENGTH                            0x3
#define _PORTWIN1PPS_PORT_MASK                              0x38
#define _PORTWIN1PPS_PORTWIN1PPS_POSN                       0x0
#define _PORTWIN1PPS_PORTWIN1PPS_POSITION                   0x0
#define _PORTWIN1PPS_PORTWIN1PPS_SIZE                       0x6
#define _PORTWIN1PPS_PORTWIN1PPS_LENGTH                     0x6
#define _PORTWIN1PPS_PORTWIN1PPS_MASK                       0x3F
#define _PORTWIN1PPS_PORTWIN1PPS0_POSN                      0x0
#define _PORTWIN1PPS_PORTWIN1PPS0_POSITION                  0x0
#define _PORTWIN1PPS_PORTWIN1PPS0_SIZE                      0x1
#define _PORTWIN1PPS_PORTWIN1PPS0_LENGTH                    0x1
#define _PORTWIN1PPS_PORTWIN1PPS0_MASK                      0x1
#define _PORTWIN1PPS_PORTWIN1PPS1_POSN                      0x1
#define _PORTWIN1PPS_PORTWIN1PPS1_POSITION                  0x1
#define _PORTWIN1PPS_PORTWIN1PPS1_SIZE                      0x1
#define _PORTWIN1PPS_PORTWIN1PPS1_LENGTH                    0x1
#define _PORTWIN1PPS_PORTWIN1PPS1_MASK                      0x2
#define _PORTWIN1PPS_PORTWIN1PPS2_POSN                      0x2
#define _PORTWIN1PPS_PORTWIN1PPS2_POSITION                  0x2
#define _PORTWIN1PPS_PORTWIN1PPS2_SIZE                      0x1
#define _PORTWIN1PPS_PORTWIN1PPS2_LENGTH                    0x1
#define _PORTWIN1PPS_PORTWIN1PPS2_MASK                      0x4
#define _PORTWIN1PPS_PORTWIN1PPS3_POSN                      0x3
#define _PORTWIN1PPS_PORTWIN1PPS3_POSITION                  0x3
#define _PORTWIN1PPS_PORTWIN1PPS3_SIZE                      0x1
#define _PORTWIN1PPS_PORTWIN1PPS3_LENGTH                    0x1
#define _PORTWIN1PPS_PORTWIN1PPS3_MASK                      0x8
#define _PORTWIN1PPS_PORTWIN1PPS4_POSN                      0x4
#define _PORTWIN1PPS_PORTWIN1PPS4_POSITION                  0x4
#define _PORTWIN1PPS_PORTWIN1PPS4_SIZE                      0x1
#define _PORTWIN1PPS_PORTWIN1PPS4_LENGTH                    0x1
#define _PORTWIN1PPS_PORTWIN1PPS4_MASK                      0x10
#define _PORTWIN1PPS_PORTWIN1PPS5_POSN                      0x5
#define _PORTWIN1PPS_PORTWIN1PPS5_POSITION                  0x5
#define _PORTWIN1PPS_PORTWIN1PPS5_SIZE                      0x1
#define _PORTWIN1PPS_PORTWIN1PPS5_LENGTH                    0x1
#define _PORTWIN1PPS_PORTWIN1PPS5_MASK                      0x20

