garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f55q24.h
extern volatile TU16APRTbits_t TU16APRTbits __at(0x3A8);
// bitfield macros
#define _TU16APRT_PRT_POSN                                  0x0
#define _TU16APRT_PRT_POSITION                              0x0
#define _TU16APRT_PRT_SIZE                                  0x8
#define _TU16APRT_PRT_LENGTH                                0x8
#define _TU16APRT_PRT_MASK                                  0xFF
#define _TU16APRT_PRT0_POSN                                 0x0
#define _TU16APRT_PRT0_POSITION                             0x0
#define _TU16APRT_PRT0_SIZE                                 0x1
#define _TU16APRT_PRT0_LENGTH                               0x1
#define _TU16APRT_PRT0_MASK                                 0x1
#define _TU16APRT_PRT1_POSN                                 0x1
#define _TU16APRT_PRT1_POSITION                             0x1
#define _TU16APRT_PRT1_SIZE                                 0x1
#define _TU16APRT_PRT1_LENGTH                               0x1
#define _TU16APRT_PRT1_MASK                                 0x2
#define _TU16APRT_PRT2_POSN                                 0x2
#define _TU16APRT_PRT2_POSITION                             0x2
#define _TU16APRT_PRT2_SIZE                                 0x1
#define _TU16APRT_PRT2_LENGTH                               0x1
#define _TU16APRT_PRT2_MASK                                 0x4
#define _TU16APRT_PRT3_POSN                                 0x3
#define _TU16APRT_PRT3_POSITION                             0x3
#define _TU16APRT_PRT3_SIZE                                 0x1
#define _TU16APRT_PRT3_LENGTH                               0x1
#define _TU16APRT_PRT3_MASK                                 0x8
#define _TU16APRT_PRT4_POSN                                 0x4
#define _TU16APRT_PRT4_POSITION                             0x4
#define _TU16APRT_PRT4_SIZE                                 0x1
#define _TU16APRT_PRT4_LENGTH                               0x1
#define _TU16APRT_PRT4_MASK                                 0x10
#define _TU16APRT_PRT5_POSN                                 0x5
#define _TU16APRT_PRT5_POSITION                             0x5
#define _TU16APRT_PRT5_SIZE                                 0x1
#define _TU16APRT_PRT5_LENGTH                               0x1
#define _TU16APRT_PRT5_MASK                                 0x20
#define _TU16APRT_PRT6_POSN                                 0x6
#define _TU16APRT_PRT6_POSITION                             0x6
#define _TU16APRT_PRT6_SIZE                                 0x1
#define _TU16APRT_PRT6_LENGTH                               0x1
#define _TU16APRT_PRT6_MASK                                 0x40
#define _TU16APRT_PRT7_POSN                                 0x7
#define _TU16APRT_PRT7_POSITION                             0x7
#define _TU16APRT_PRT7_SIZE                                 0x1
#define _TU16APRT_PRT7_LENGTH                               0x1
#define _TU16APRT_PRT7_MASK                                 0x80
#define _TU16APRT_TU16APRT0_POSN                            0x0
#define _TU16APRT_TU16APRT0_POSITION                        0x0
#define _TU16APRT_TU16APRT0_SIZE                            0x1
#define _TU16APRT_TU16APRT0_LENGTH                          0x1
#define _TU16APRT_TU16APRT0_MASK                            0x1
#define _TU16APRT_TU16APRT1_POSN                            0x1
#define _TU16APRT_TU16APRT1_POSITION                        0x1
#define _TU16APRT_TU16APRT1_SIZE                            0x1
#define _TU16APRT_TU16APRT1_LENGTH                          0x1
#define _TU16APRT_TU16APRT1_MASK                            0x2
#define _TU16APRT_TU16APRT2_POSN                            0x2
#define _TU16APRT_TU16APRT2_POSITION                        0x2
#define _TU16APRT_TU16APRT2_SIZE                            0x1
#define _TU16APRT_TU16APRT2_LENGTH                          0x1
#define _TU16APRT_TU16APRT2_MASK                            0x4
#define _TU16APRT_TU16APRT3_POSN                            0x3
#define _TU16APRT_TU16APRT3_POSITION                        0x3
#define _TU16APRT_TU16APRT3_SIZE                            0x1
#define _TU16APRT_TU16APRT3_LENGTH                          0x1
#define _TU16APRT_TU16APRT3_MASK                            0x8
#define _TU16APRT_TU16APRT4_POSN                            0x4
#define _TU16APRT_TU16APRT4_POSITION                        0x4
#define _TU16APRT_TU16APRT4_SIZE                            0x1
#define _TU16APRT_TU16APRT4_LENGTH                          0x1
#define _TU16APRT_TU16APRT4_MASK                            0x10
#define _TU16APRT_TU16APRT5_POSN                            0x5
#define _TU16APRT_TU16APRT5_POSITION                        0x5
#define _TU16APRT_TU16APRT5_SIZE                            0x1
#define _TU16APRT_TU16APRT5_LENGTH                          0x1
#define _TU16APRT_TU16APRT5_MASK                            0x20
#define _TU16APRT_TU16APRT6_POSN                            0x6
#define _TU16APRT_TU16APRT6_POSITION                        0x6
#define _TU16APRT_TU16APRT6_SIZE                            0x1
#define _TU16APRT_TU16APRT6_LENGTH                          0x1
#define _TU16APRT_TU16APRT6_MASK                            0x40
#define _TU16APRT_TU16APRT7_POSN                            0x7
#define _TU16APRT_TU16APRT7_POSITION                        0x7
#define _TU16APRT_TU16APRT7_SIZE                            0x1
#define _TU16APRT_TU16APRT7_LENGTH                          0x1
#define _TU16APRT_TU16APRT7_MASK                            0x80
#define _TU16APRT_TU16APR24_POSN                            0x0
#define _TU16APRT_TU16APR24_POSITION                        0x0
#define _TU16APRT_TU16APR24_SIZE                            0x1
#define _TU16APRT_TU16APR24_LENGTH                          0x1
#define _TU16APRT_TU16APR24_MASK                            0x1
#define _TU16APRT_TU16APR25_POSN                            0x1
#define _TU16APRT_TU16APR25_POSITION                        0x1
#define _TU16APRT_TU16APR25_SIZE                            0x1
#define _TU16APRT_TU16APR25_LENGTH                          0x1
#define _TU16APRT_TU16APR25_MASK                            0x2
#define _TU16APRT_TU16APR26_POSN                            0x2
#define _TU16APRT_TU16APR26_POSITION                        0x2
#define _TU16APRT_TU16APR26_SIZE                            0x1
#define _TU16APRT_TU16APR26_LENGTH                          0x1
#define _TU16APRT_TU16APR26_MASK                            0x4
#define _TU16APRT_TU16APR27_POSN                            0x3
#define _TU16APRT_TU16APR27_POSITION                        0x3
#define _TU16APRT_TU16APR27_SIZE                            0x1
#define _TU16APRT_TU16APR27_LENGTH                          0x1
#define _TU16APRT_TU16APR27_MASK                            0x8
#define _TU16APRT_TU16APR28_POSN                            0x4
#define _TU16APRT_TU16APR28_POSITION                        0x4
#define _TU16APRT_TU16APR28_SIZE                            0x1
#define _TU16APRT_TU16APR28_LENGTH                          0x1
#define _TU16APRT_TU16APR28_MASK                            0x10
#define _TU16APRT_TU16APR29_POSN                            0x5
#define _TU16APRT_TU16APR29_POSITION                        0x5
#define _TU16APRT_TU16APR29_SIZE                            0x1
#define _TU16APRT_TU16APR29_LENGTH                          0x1
#define _TU16APRT_TU16APR29_MASK                            0x20
#define _TU16APRT_TU16APR30_POSN                            0x6
#define _TU16APRT_TU16APR30_POSITION                        0x6
#define _TU16APRT_TU16APR30_SIZE                            0x1
#define _TU16APRT_TU16APR30_LENGTH                          0x1
#define _TU16APRT_TU16APR30_MASK                            0x40
#define _TU16APRT_TU16APR31_POSN                            0x7
#define _TU16APRT_TU16APR31_POSITION                        0x7
#define _TU16APRT_TU16APR31_SIZE                            0x1
#define _TU16APRT_TU16APR31_LENGTH                          0x1
#define _TU16APRT_TU16APR31_MASK                            0x80

// Register: TU16ACLK
#define TU16ACLK TU16ACLK
extern volatile unsigned char           TU16ACLK            __at(0x3A9);
#ifndef _LIB_BUILD
asm("TU16ACLK equ 03A9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
        unsigned CLK4                   :1;
    };
    struct {
        unsigned TU16ACLK0              :1;
        unsigned TU16ACLK1              :1;
        unsigned TU16ACLK2              :1;
        unsigned TU16ACLK3              :1;
        unsigned TU16ACLK4              :1;
    };
} TU16ACLKbits_t;
extern volatile TU16ACLKbits_t TU16ACLKbits __at(0x3A9);
// bitfield macros
#define _TU16ACLK_CLK_POSN                                  0x0
#define _TU16ACLK_CLK_POSITION                              0x0
#define _TU16ACLK_CLK_SIZE                                  0x8
#define _TU16ACLK_CLK_LENGTH                                0x8
#define _TU16ACLK_CLK_MASK                                  0xFF
#define _TU16ACLK_CLK0_POSN                                 0x0
#define _TU16ACLK_CLK0_POSITION                             0x0
#define _TU16ACLK_CLK0_SIZE                                 0x1
#define _TU16ACLK_CLK0_LENGTH                               0x1
#define _TU16ACLK_CLK0_MASK                                 0x1
#define _TU16ACLK_CLK1_POSN                                 0x1
#define _TU16ACLK_CLK1_POSITION                             0x1
#define _TU16ACLK_CLK1_SIZE                                 0x1
#define _TU16ACLK_CLK1_LENGTH                               0x1
#define _TU16ACLK_CLK1_MASK                                 0x2
#define _TU16ACLK_CLK2_POSN                                 0x2
#define _TU16ACLK_CLK2_POSITION                             0x2
#define _TU16ACLK_CLK2_SIZE                                 0x1
#define _TU16ACLK_CLK2_LENGTH                               0x1
#define _TU16ACLK_CLK2_MASK                                 0x4
#define _TU16ACLK_CLK3_POSN                                 0x3
#define _TU16ACLK_CLK3_POSITION                             0x3
#define _TU16ACLK_CLK3_SIZE                                 0x1
#define _TU16ACLK_CLK3_LENGTH                               0x1
#define _TU16ACLK_CLK3_MASK                                 0x8
#define _TU16ACLK_CLK4_POSN                                 0x4
#define _TU16ACLK_CLK4_POSITION                             0x4
#define _TU16ACLK_CLK4_SIZE                                 0x1
#define _TU16ACLK_CLK4_LENGTH                               0x1
#define _TU16ACLK_CLK4_MASK                                 0x10
#define _TU16ACLK_TU16ACLK0_POSN                            0x0
#define _TU16ACLK_TU16ACLK0_POSITION                        0x0
#define _TU16ACLK_TU16ACLK0_SIZE                            0x1
#define _TU16ACLK_TU16ACLK0_LENGTH                          0x1
#define _TU16ACLK_TU16ACLK0_MASK                            0x1
#define _TU16ACLK_TU16ACLK1_POSN                            0x1
#define _TU16ACLK_TU16ACLK1_POSITION                        0x1
#define _TU16ACLK_TU16ACLK1_SIZE                            0x1
#define _TU16ACLK_TU16ACLK1_LENGTH                          0x1
#define _TU16ACLK_TU16ACLK1_MASK                            0x2
#define _TU16ACLK_TU16ACLK2_POSN                            0x2
#define _TU16ACLK_TU16ACLK2_POSITION                        0x2
#define _TU16ACLK_TU16ACLK2_SIZE                            0x1
#define _TU16ACLK_TU16ACLK2_LENGTH                          0x1
#define _TU16ACLK_TU16ACLK2_MASK                            0x4
#define _TU16ACLK_TU16ACLK3_POSN                            0x3
#define _TU16ACLK_TU16ACLK3_POSITION                        0x3
#define _TU16ACLK_TU16ACLK3_SIZE                            0x1
#define _TU16ACLK_TU16ACLK3_LENGTH                          0x1
#define _TU16ACLK_TU16ACLK3_MASK                            0x8
#define _TU16ACLK_TU16ACLK4_POSN                            0x4
#define _TU16ACLK_TU16ACLK4_POSITION                        0x4
#define _TU16ACLK_TU16ACLK4_SIZE                            0x1
#define _TU16ACLK_TU16ACLK4_LENGTH                          0x1
#define _TU16ACLK_TU16ACLK4_MASK                            0x10

// Register: TU16AERS
#define TU16AERS TU16AERS
extern volatile unsigned char           TU16AERS            __at(0x3AA);
#ifndef _LIB_BUILD
asm("TU16AERS equ 03AAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ERS                    :8;
    };
    struct {
        unsigned ERS0                   :1;
        unsigned ERS1                   :1;
        unsigned ERS2                   :1;
        unsigned ERS3                   :1;
        unsigned ERS4                   :1;
        unsigned ERS5                   :1;
    };
    struct {
        unsigned TU16AERS0              :1;
        unsigned TU16AERS1              :1;
        unsigned TU16AERS2              :1;
        unsigned TU16AERS3              :1;
        unsigned TU16AERS4              :1;
        unsigned TU16AERS5              :1;
    };
} TU16AERSbits_t;
extern volatile TU16AERSbits_t TU16AERSbits __at(0x3AA);
// bitfield macros
#define _TU16AERS_ERS_POSN                                  0x0
#define _TU16AERS_ERS_POSITION                              0x0
#define _TU16AERS_ERS_SIZE                                  0x8
#define _TU16AERS_ERS_LENGTH                                0x8
#define _TU16AERS_ERS_MASK                                  0xFF
#define _TU16AERS_ERS0_POSN                                 0x0
#define _TU16AERS_ERS0_POSITION                             0x0
#define _TU16AERS_ERS0_SIZE                                 0x1
#define _TU16AERS_ERS0_LENGTH                               0x1
#define _TU16AERS_ERS0_MASK                                 0x1
#define _TU16AERS_ERS1_POSN                                 0x1
#define _TU16AERS_ERS1_POSITION                             0x1
#define _TU16AERS_ERS1_SIZE                                 0x1
#define _TU16AERS_ERS1_LENGTH                               0x1
#define _TU16AERS_ERS1_MASK                                 0x2
#define _TU16AERS_ERS2_POSN                                 0x2
#define _TU16AERS_ERS2_POSITION                             0x2
#define _TU16AERS_ERS2_SIZE                                 0x1
#define _TU16AERS_ERS2_LENGTH                               0x1
#define _TU16AERS_ERS2_MASK                                 0x4
#define _TU16AERS_ERS3_POSN                                 0x3
#define _TU16AERS_ERS3_POSITION                             0x3
#define _TU16AERS_ERS3_SIZE                                 0x1
#define _TU16AERS_ERS3_LENGTH                               0x1
#define _TU16AERS_ERS3_MASK                                 0x8
#define _TU16AERS_ERS4_POSN                                 0x4
#define _TU16AERS_ERS4_POSITION                             0x4
#define _TU16AERS_ERS4_SIZE                                 0x1
#define _TU16AERS_ERS4_LENGTH                               0x1
#define _TU16AERS_ERS4_MASK                                 0x10
#define _TU16AERS_ERS5_POSN                                 0x5
#define _TU16AERS_ERS5_POSITION                             0x5
#define _TU16AERS_ERS5_SIZE                                 0x1
#define _TU16AERS_ERS5_LENGTH                               0x1
#define _TU16AERS_ERS5_MASK                                 0x20
#define _TU16AERS_TU16AERS0_POSN                            0x0
#define _TU16AERS_TU16AERS0_POSITION                        0x0
#define _TU16AERS_TU16AERS0_SIZE                            0x1
#define _TU16AERS_TU16AERS0_LENGTH                          0x1
#define _TU16AERS_TU16AERS0_MASK                            0x1
#define _TU16AERS_TU16AERS1_POSN                            0x1
#define _TU16AERS_TU16AERS1_POSITION                        0x1
#define _TU16AERS_TU16AERS1_SIZE                            0x1
#define _TU16AERS_TU16AERS1_LENGTH                          0x1
#define _TU16AERS_TU16AERS1_MASK                            0x2
#define _TU16AERS_TU16AERS2_POSN                            0x2
#define _TU16AERS_TU16AERS2_POSITION                        0x2
#define _TU16AERS_TU16AERS2_SIZE                            0x1
#define _TU16AERS_TU16AERS2_LENGTH                          0x1
#define _TU16AERS_TU16AERS2_MASK                            0x4
#define _TU16AERS_TU16AERS3_POSN                            0x3
#define _TU16AERS_TU16AERS3_POSITION                        0x3
#define _TU16AERS_TU16AERS3_SIZE                            0x1
#define _TU16AERS_TU16AERS3_LENGTH                          0x1
#define _TU16AERS_TU16AERS3_MASK                            0x8
#define _TU16AERS_TU16AERS4_POSN                            0x4
#define _TU16AERS_TU16AERS4_POSITION                        0x4
#define _TU16AERS_TU16AERS4_SIZE                            0x1
#define _TU16AERS_TU16AERS4_LENGTH                          0x1
#define _TU16AERS_TU16AERS4_MASK                            0x10
#define _TU16AERS_TU16AERS5_POSN                            0x5
#define _TU16AERS_TU16AERS5_POSITION                        0x5
#define _TU16AERS_TU16AERS5_SIZE                            0x1
#define _TU16AERS_TU16AERS5_LENGTH                          0x1
#define _TU16AERS_TU16AERS5_MASK                            0x20

// Register: TU16BCON0
#define TU16BCON0 TU16BCON0
extern volatile unsigned char           TU16BCON0           __at(0x3AB);
#ifndef _LIB_BUILD
asm("TU16BCON0 equ 03ABh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CIE                    :1;
        unsigned ZIE                    :1;
        unsigned PRIE                   :1;
        unsigned RDSEL                  :1;
        unsigned OPOL                   :1;
        unsigned OM                     :1;
        unsigned CPOL                   :1;
        unsigned ON                     :1;
    };
    struct {
        unsigned TU16BCIE               :1;
        unsigned TU16BZIE               :1;
        unsigned TU16BPRIE              :1;
        unsigned TU16BRDSEL             :1;
        unsigned TU16BOPOL              :1;
        unsigned TU16BOM                :1;
        unsigned TU16BCPOL              :1;
        unsigned TU16BON                :1;
    };
} TU16BCON0bits_t;
extern volatile TU16BCON0bits_t TU16BCON0bits __at(0x3AB);
// bitfield macros
#define _TU16BCON0_CIE_POSN                                 0x0
#define _TU16BCON0_CIE_POSITION                             0x0
#define _TU16BCON0_CIE_SIZE                                 0x1
#define _TU16BCON0_CIE_LENGTH                               0x1
#define _TU16BCON0_CIE_MASK                                 0x1
#define _TU16BCON0_ZIE_POSN                                 0x1
#define _TU16BCON0_ZIE_POSITION                             0x1
#define _TU16BCON0_ZIE_SIZE                                 0x1
#define _TU16BCON0_ZIE_LENGTH                               0x1
#define _TU16BCON0_ZIE_MASK                                 0x2
#define _TU16BCON0_PRIE_POSN                                0x2
#define _TU16BCON0_PRIE_POSITION                            0x2
#define _TU16BCON0_PRIE_SIZE                                0x1
#define _TU16BCON0_PRIE_LENGTH                              0x1
#define _TU16BCON0_PRIE_MASK                                0x4
#define _TU16BCON0_RDSEL_POSN                               0x3
#define _TU16BCON0_RDSEL_POSITION                           0x3
#define _TU16BCON0_RDSEL_SIZE                               0x1
#define _TU16BCON0_RDSEL_LENGTH                             0x1
#define _TU16BCON0_RDSEL_MASK                               0x8
#define _TU16BCON0_OPOL_POSN                                0x4
#define _TU16BCON0_OPOL_POSITION                            0x4
#define _TU16BCON0_OPOL_SIZE                                0x1
#define _TU16BCON0_OPOL_LENGTH                              0x1
#define _TU16BCON0_OPOL_MASK                                0x10
#define _TU16BCON0_OM_POSN                                  0x5
#define _TU16BCON0_OM_POSITION                              0x5
#define _TU16BCON0_OM_SIZE                                  0x1
#define _TU16BCON0_OM_LENGTH                                0x1
#define _TU16BCON0_OM_MASK                                  0x20
#define _TU16BCON0_CPOL_POSN                                0x6
#define _TU16BCON0_CPOL_POSITION                            0x6
#define _TU16BCON0_CPOL_SIZE                                0x1
#define _TU16BCON0_CPOL_LENGTH                              0x1
#define _TU16BCON0_CPOL_MASK                                0x40
#define _TU16BCON0_ON_POSN                                  0x7
#define _TU16BCON0_ON_POSITION                              0x7
#define _TU16BCON0_ON_SIZE                                  0x1
#define _TU16BCON0_ON_LENGTH                                0x1
#define _TU16BCON0_ON_MASK                                  0x80
#define _TU16BCON0_TU16BCIE_POSN                            0x0
#define _TU16BCON0_TU16BCIE_POSITION                        0x0
#define _TU16BCON0_TU16BCIE_SIZE                            0x1
#define _TU16BCON0_TU16BCIE_LENGTH                          0x1
#define _TU16BCON0_TU16BCIE_MASK                            0x1
#define _TU16BCON0_TU16BZIE_POSN                            0x1
#define _TU16BCON0_TU16BZIE_POSITION                        0x1
#define _TU16BCON0_TU16BZIE_SIZE                            0x1
#define _TU16BCON0_TU16BZIE_LENGTH                          0x1
#define _TU16BCON0_TU16BZIE_MASK                            0x2
#define _TU16BCON0_TU16BPRIE_POSN                           0x2
#define _TU16BCON0_TU16BPRIE_POSITION                       0x2
#define _TU16BCON0_TU16BPRIE_SIZE                           0x1
#define _TU16BCON0_TU16BPRIE_LENGTH                         0x1
#define _TU16BCON0_TU16BPRIE_MASK                           0x4
#define _TU16BCON0_TU16BRDSEL_POSN                          0x3
#define _TU16BCON0_TU16BRDSEL_POSITION                      0x3
#define _TU16BCON0_TU16BRDSEL_SIZE                          0x1
#define _TU16BCON0_TU16BRDSEL_LENGTH                        0x1
#define _TU16BCON0_TU16BRDSEL_MASK                          0x8
#define _TU16BCON0_TU16BOPOL_POSN                           0x4
#define _TU16BCON0_TU16BOPOL_POSITION                       0x4
#define _TU16BCON0_TU16BOPOL_SIZE                           0x1
#define _TU16BCON0_TU16BOPOL_LENGTH                         0x1
#define _TU16BCON0_TU16BOPOL_MASK                           0x10
#define _TU16BCON0_TU16BOM_POSN                             0x5
#define _TU16BCON0_TU16BOM_POSITION                         0x5
#define _TU16BCON0_TU16BOM_SIZE                             0x1
#define _TU16BCON0_TU16BOM_LENGTH                           0x1
#define _TU16BCON0_TU16BOM_MASK                             0x20
#define _TU16BCON0_TU16BCPOL_POSN                           0x6
#define _TU16BCON0_TU16BCPOL_POSITION                       0x6
#define _TU16BCON0_TU16BCPOL_SIZE                           0x1
#define _TU16BCON0_TU16BCPOL_LENGTH                         0x1
#define _TU16BCON0_TU16BCPOL_MASK                           0x40
#define _TU16BCON0_TU16BON_POSN                             0x7
#define _TU16BCON0_TU16BON_POSITION                         0x7
#define _TU16BCON0_TU16BON_SIZE                             0x1
#define _TU16BCON0_TU16BON_LENGTH                           0x1
#define _TU16BCON0_TU16BON_MASK                             0x80

