garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f55q24.h
// Register: TU16BCON1
#define TU16BCON1 TU16BCON1
extern volatile unsigned char           TU16BCON1           __at(0x3AC);
#ifndef _LIB_BUILD
asm("TU16BCON1 equ 03ACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CIF                    :1;
        unsigned ZIF                    :1;
        unsigned PRIF                   :1;
        unsigned CAPT                   :1;
        unsigned LIMIT                  :1;
        unsigned CLR                    :1;
        unsigned OSEN                   :1;
        unsigned RUN                    :1;
    };
    struct {
        unsigned TU16BCIF               :1;
        unsigned TU16BZIF               :1;
        unsigned TU16BPRIF              :1;
        unsigned TU16BCAPT              :1;
        unsigned TU16BLIMIT             :1;
        unsigned TU16BCLR               :1;
        unsigned TMRBOSEN               :1;
        unsigned TU16BRUN               :1;
    };
} TU16BCON1bits_t;
extern volatile TU16BCON1bits_t TU16BCON1bits __at(0x3AC);
// bitfield macros
#define _TU16BCON1_CIF_POSN                                 0x0
#define _TU16BCON1_CIF_POSITION                             0x0
#define _TU16BCON1_CIF_SIZE                                 0x1
#define _TU16BCON1_CIF_LENGTH                               0x1
#define _TU16BCON1_CIF_MASK                                 0x1
#define _TU16BCON1_ZIF_POSN                                 0x1
#define _TU16BCON1_ZIF_POSITION                             0x1
#define _TU16BCON1_ZIF_SIZE                                 0x1
#define _TU16BCON1_ZIF_LENGTH                               0x1
#define _TU16BCON1_ZIF_MASK                                 0x2
#define _TU16BCON1_PRIF_POSN                                0x2
#define _TU16BCON1_PRIF_POSITION                            0x2
#define _TU16BCON1_PRIF_SIZE                                0x1
#define _TU16BCON1_PRIF_LENGTH                              0x1
#define _TU16BCON1_PRIF_MASK                                0x4
#define _TU16BCON1_CAPT_POSN                                0x3
#define _TU16BCON1_CAPT_POSITION                            0x3
#define _TU16BCON1_CAPT_SIZE                                0x1
#define _TU16BCON1_CAPT_LENGTH                              0x1
#define _TU16BCON1_CAPT_MASK                                0x8
#define _TU16BCON1_LIMIT_POSN                               0x4
#define _TU16BCON1_LIMIT_POSITION                           0x4
#define _TU16BCON1_LIMIT_SIZE                               0x1
#define _TU16BCON1_LIMIT_LENGTH                             0x1
#define _TU16BCON1_LIMIT_MASK                               0x10
#define _TU16BCON1_CLR_POSN                                 0x5
#define _TU16BCON1_CLR_POSITION                             0x5
#define _TU16BCON1_CLR_SIZE                                 0x1
#define _TU16BCON1_CLR_LENGTH                               0x1
#define _TU16BCON1_CLR_MASK                                 0x20
#define _TU16BCON1_OSEN_POSN                                0x6
#define _TU16BCON1_OSEN_POSITION                            0x6
#define _TU16BCON1_OSEN_SIZE                                0x1
#define _TU16BCON1_OSEN_LENGTH                              0x1
#define _TU16BCON1_OSEN_MASK                                0x40
#define _TU16BCON1_RUN_POSN                                 0x7
#define _TU16BCON1_RUN_POSITION                             0x7
#define _TU16BCON1_RUN_SIZE                                 0x1
#define _TU16BCON1_RUN_LENGTH                               0x1
#define _TU16BCON1_RUN_MASK                                 0x80
#define _TU16BCON1_TU16BCIF_POSN                            0x0
#define _TU16BCON1_TU16BCIF_POSITION                        0x0
#define _TU16BCON1_TU16BCIF_SIZE                            0x1
#define _TU16BCON1_TU16BCIF_LENGTH                          0x1
#define _TU16BCON1_TU16BCIF_MASK                            0x1
#define _TU16BCON1_TU16BZIF_POSN                            0x1
#define _TU16BCON1_TU16BZIF_POSITION                        0x1
#define _TU16BCON1_TU16BZIF_SIZE                            0x1
#define _TU16BCON1_TU16BZIF_LENGTH                          0x1
#define _TU16BCON1_TU16BZIF_MASK                            0x2
#define _TU16BCON1_TU16BPRIF_POSN                           0x2
#define _TU16BCON1_TU16BPRIF_POSITION                       0x2
#define _TU16BCON1_TU16BPRIF_SIZE                           0x1
#define _TU16BCON1_TU16BPRIF_LENGTH                         0x1
#define _TU16BCON1_TU16BPRIF_MASK                           0x4
#define _TU16BCON1_TU16BCAPT_POSN                           0x3
#define _TU16BCON1_TU16BCAPT_POSITION                       0x3
#define _TU16BCON1_TU16BCAPT_SIZE                           0x1
#define _TU16BCON1_TU16BCAPT_LENGTH                         0x1
#define _TU16BCON1_TU16BCAPT_MASK                           0x8
#define _TU16BCON1_TU16BLIMIT_POSN                          0x4
#define _TU16BCON1_TU16BLIMIT_POSITION                      0x4
#define _TU16BCON1_TU16BLIMIT_SIZE                          0x1
#define _TU16BCON1_TU16BLIMIT_LENGTH                        0x1
#define _TU16BCON1_TU16BLIMIT_MASK                          0x10
#define _TU16BCON1_TU16BCLR_POSN                            0x5
#define _TU16BCON1_TU16BCLR_POSITION                        0x5
#define _TU16BCON1_TU16BCLR_SIZE                            0x1
#define _TU16BCON1_TU16BCLR_LENGTH                          0x1
#define _TU16BCON1_TU16BCLR_MASK                            0x20
#define _TU16BCON1_TMRBOSEN_POSN                            0x6
#define _TU16BCON1_TMRBOSEN_POSITION                        0x6
#define _TU16BCON1_TMRBOSEN_SIZE                            0x1
#define _TU16BCON1_TMRBOSEN_LENGTH                          0x1
#define _TU16BCON1_TMRBOSEN_MASK                            0x40
#define _TU16BCON1_TU16BRUN_POSN                            0x7
#define _TU16BCON1_TU16BRUN_POSITION                        0x7
#define _TU16BCON1_TU16BRUN_SIZE                            0x1
#define _TU16BCON1_TU16BRUN_LENGTH                          0x1
#define _TU16BCON1_TU16BRUN_MASK                            0x80

