garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f55q24.h
// Register: TU16BPRH
#define TU16BPRH TU16BPRH
extern volatile unsigned char           TU16BPRH            __at(0x3B4);
#ifndef _LIB_BUILD
asm("TU16BPRH equ 03B4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRH                    :8;
    };
    struct {
        unsigned PRH0                   :1;
        unsigned PRH1                   :1;
        unsigned PRH2                   :1;
        unsigned PRH3                   :1;
        unsigned PRH4                   :1;
        unsigned PRH5                   :1;
        unsigned PRH6                   :1;
        unsigned PRH7                   :1;
    };
    struct {
        unsigned TU16BPRH0              :1;
        unsigned TU16BPRH1              :1;
        unsigned TU16BPRH2              :1;
        unsigned TU16BPRH3              :1;
        unsigned TU16BPRH4              :1;
        unsigned TU16BPRH5              :1;
        unsigned TU16BPRH6              :1;
        unsigned TU16BPRH7              :1;
    };
    struct {
        unsigned TU16BPR8               :1;
        unsigned TU16BPR9               :1;
        unsigned TU16BPR10              :1;
        unsigned TU16BPR11              :1;
        unsigned TU16BPR12              :1;
        unsigned TU16BPR13              :1;
        unsigned TU16BPR14              :1;
        unsigned TU16BPR15              :1;
    };
} TU16BPRHbits_t;
extern volatile TU16BPRHbits_t TU16BPRHbits __at(0x3B4);
// bitfield macros
#define _TU16BPRH_PRH_POSN                                  0x0
#define _TU16BPRH_PRH_POSITION                              0x0
#define _TU16BPRH_PRH_SIZE                                  0x8
#define _TU16BPRH_PRH_LENGTH                                0x8
#define _TU16BPRH_PRH_MASK                                  0xFF
#define _TU16BPRH_PRH0_POSN                                 0x0
#define _TU16BPRH_PRH0_POSITION                             0x0
#define _TU16BPRH_PRH0_SIZE                                 0x1
#define _TU16BPRH_PRH0_LENGTH                               0x1
#define _TU16BPRH_PRH0_MASK                                 0x1
#define _TU16BPRH_PRH1_POSN                                 0x1
#define _TU16BPRH_PRH1_POSITION                             0x1
#define _TU16BPRH_PRH1_SIZE                                 0x1
#define _TU16BPRH_PRH1_LENGTH                               0x1
#define _TU16BPRH_PRH1_MASK                                 0x2
#define _TU16BPRH_PRH2_POSN                                 0x2
#define _TU16BPRH_PRH2_POSITION                             0x2
#define _TU16BPRH_PRH2_SIZE                                 0x1
#define _TU16BPRH_PRH2_LENGTH                               0x1
#define _TU16BPRH_PRH2_MASK                                 0x4
#define _TU16BPRH_PRH3_POSN                                 0x3
#define _TU16BPRH_PRH3_POSITION                             0x3
#define _TU16BPRH_PRH3_SIZE                                 0x1
#define _TU16BPRH_PRH3_LENGTH                               0x1
#define _TU16BPRH_PRH3_MASK                                 0x8
#define _TU16BPRH_PRH4_POSN                                 0x4
#define _TU16BPRH_PRH4_POSITION                             0x4
#define _TU16BPRH_PRH4_SIZE                                 0x1
#define _TU16BPRH_PRH4_LENGTH                               0x1
#define _TU16BPRH_PRH4_MASK                                 0x10
#define _TU16BPRH_PRH5_POSN                                 0x5
#define _TU16BPRH_PRH5_POSITION                             0x5
#define _TU16BPRH_PRH5_SIZE                                 0x1
#define _TU16BPRH_PRH5_LENGTH                               0x1
#define _TU16BPRH_PRH5_MASK                                 0x20
#define _TU16BPRH_PRH6_POSN                                 0x6
#define _TU16BPRH_PRH6_POSITION                             0x6
#define _TU16BPRH_PRH6_SIZE                                 0x1
#define _TU16BPRH_PRH6_LENGTH                               0x1
#define _TU16BPRH_PRH6_MASK                                 0x40
#define _TU16BPRH_PRH7_POSN                                 0x7
#define _TU16BPRH_PRH7_POSITION                             0x7
#define _TU16BPRH_PRH7_SIZE                                 0x1
#define _TU16BPRH_PRH7_LENGTH                               0x1
#define _TU16BPRH_PRH7_MASK                                 0x80
#define _TU16BPRH_TU16BPRH0_POSN                            0x0
#define _TU16BPRH_TU16BPRH0_POSITION                        0x0
#define _TU16BPRH_TU16BPRH0_SIZE                            0x1
#define _TU16BPRH_TU16BPRH0_LENGTH                          0x1
#define _TU16BPRH_TU16BPRH0_MASK                            0x1
#define _TU16BPRH_TU16BPRH1_POSN                            0x1
#define _TU16BPRH_TU16BPRH1_POSITION                        0x1
#define _TU16BPRH_TU16BPRH1_SIZE                            0x1
#define _TU16BPRH_TU16BPRH1_LENGTH                          0x1
#define _TU16BPRH_TU16BPRH1_MASK                            0x2
#define _TU16BPRH_TU16BPRH2_POSN                            0x2
#define _TU16BPRH_TU16BPRH2_POSITION                        0x2
#define _TU16BPRH_TU16BPRH2_SIZE                            0x1
#define _TU16BPRH_TU16BPRH2_LENGTH                          0x1
#define _TU16BPRH_TU16BPRH2_MASK                            0x4
#define _TU16BPRH_TU16BPRH3_POSN                            0x3
#define _TU16BPRH_TU16BPRH3_POSITION                        0x3
#define _TU16BPRH_TU16BPRH3_SIZE                            0x1
#define _TU16BPRH_TU16BPRH3_LENGTH                          0x1
#define _TU16BPRH_TU16BPRH3_MASK                            0x8
#define _TU16BPRH_TU16BPRH4_POSN                            0x4
#define _TU16BPRH_TU16BPRH4_POSITION                        0x4
#define _TU16BPRH_TU16BPRH4_SIZE                            0x1
#define _TU16BPRH_TU16BPRH4_LENGTH                          0x1
#define _TU16BPRH_TU16BPRH4_MASK                            0x10
#define _TU16BPRH_TU16BPRH5_POSN                            0x5
#define _TU16BPRH_TU16BPRH5_POSITION                        0x5
#define _TU16BPRH_TU16BPRH5_SIZE                            0x1
#define _TU16BPRH_TU16BPRH5_LENGTH                          0x1
#define _TU16BPRH_TU16BPRH5_MASK                            0x20
#define _TU16BPRH_TU16BPRH6_POSN                            0x6
#define _TU16BPRH_TU16BPRH6_POSITION                        0x6
#define _TU16BPRH_TU16BPRH6_SIZE                            0x1
#define _TU16BPRH_TU16BPRH6_LENGTH                          0x1
#define _TU16BPRH_TU16BPRH6_MASK                            0x40
#define _TU16BPRH_TU16BPRH7_POSN                            0x7
#define _TU16BPRH_TU16BPRH7_POSITION                        0x7
#define _TU16BPRH_TU16BPRH7_SIZE                            0x1
#define _TU16BPRH_TU16BPRH7_LENGTH                          0x1
#define _TU16BPRH_TU16BPRH7_MASK                            0x80
#define _TU16BPRH_TU16BPR8_POSN                             0x0
#define _TU16BPRH_TU16BPR8_POSITION                         0x0
#define _TU16BPRH_TU16BPR8_SIZE                             0x1
#define _TU16BPRH_TU16BPR8_LENGTH                           0x1
#define _TU16BPRH_TU16BPR8_MASK                             0x1
#define _TU16BPRH_TU16BPR9_POSN                             0x1
#define _TU16BPRH_TU16BPR9_POSITION                         0x1
#define _TU16BPRH_TU16BPR9_SIZE                             0x1
#define _TU16BPRH_TU16BPR9_LENGTH                           0x1
#define _TU16BPRH_TU16BPR9_MASK                             0x2
#define _TU16BPRH_TU16BPR10_POSN                            0x2
#define _TU16BPRH_TU16BPR10_POSITION                        0x2
#define _TU16BPRH_TU16BPR10_SIZE                            0x1
#define _TU16BPRH_TU16BPR10_LENGTH                          0x1
#define _TU16BPRH_TU16BPR10_MASK                            0x4
#define _TU16BPRH_TU16BPR11_POSN                            0x3
#define _TU16BPRH_TU16BPR11_POSITION                        0x3
#define _TU16BPRH_TU16BPR11_SIZE                            0x1
#define _TU16BPRH_TU16BPR11_LENGTH                          0x1
#define _TU16BPRH_TU16BPR11_MASK                            0x8
#define _TU16BPRH_TU16BPR12_POSN                            0x4
#define _TU16BPRH_TU16BPR12_POSITION                        0x4
#define _TU16BPRH_TU16BPR12_SIZE                            0x1
#define _TU16BPRH_TU16BPR12_LENGTH                          0x1
#define _TU16BPRH_TU16BPR12_MASK                            0x10
#define _TU16BPRH_TU16BPR13_POSN                            0x5
#define _TU16BPRH_TU16BPR13_POSITION                        0x5
#define _TU16BPRH_TU16BPR13_SIZE                            0x1
#define _TU16BPRH_TU16BPR13_LENGTH                          0x1
#define _TU16BPRH_TU16BPR13_MASK                            0x20
#define _TU16BPRH_TU16BPR14_POSN                            0x6
#define _TU16BPRH_TU16BPR14_POSITION                        0x6
#define _TU16BPRH_TU16BPR14_SIZE                            0x1
#define _TU16BPRH_TU16BPR14_LENGTH                          0x1
#define _TU16BPRH_TU16BPR14_MASK                            0x40
#define _TU16BPRH_TU16BPR15_POSN                            0x7
#define _TU16BPRH_TU16BPR15_POSITION                        0x7
#define _TU16BPRH_TU16BPR15_SIZE                            0x1
#define _TU16BPRH_TU16BPR15_LENGTH                          0x1
#define _TU16BPRH_TU16BPR15_MASK                            0x80

// Register: TU16BPRT
#define TU16BPRT TU16BPRT
extern volatile unsigned char           TU16BPRT            __at(0x3B6);
#ifndef _LIB_BUILD
asm("TU16BPRT equ 03B6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRT                    :8;
    };
    struct {
        unsigned PRT0                   :1;
        unsigned PRT1                   :1;
        unsigned PRT2                   :1;
        unsigned PRT3                   :1;
        unsigned PRT4                   :1;
        unsigned PRT5                   :1;
        unsigned PRT6                   :1;
        unsigned PRT7                   :1;
    };
    struct {
        unsigned TU16BPRT0              :1;
        unsigned TU16BPRT1              :1;
        unsigned TU16BPRT2              :1;
        unsigned TU16BPRT3              :1;
        unsigned TU16BPRT4              :1;
        unsigned TU16BPRT5              :1;
        unsigned TU16BPRT6              :1;
        unsigned TU16BPRT7              :1;
    };
    struct {
        unsigned TU16BPR24              :1;
        unsigned TU16BPR25              :1;
        unsigned TU16BPR26              :1;
        unsigned TU16BPR27              :1;
        unsigned TU16BPR28              :1;
        unsigned TU16BPR29              :1;
        unsigned TU16BPR30              :1;
        unsigned TU16BPR31              :1;
    };
} TU16BPRTbits_t;
extern volatile TU16BPRTbits_t TU16BPRTbits __at(0x3B6);
// bitfield macros
#define _TU16BPRT_PRT_POSN                                  0x0
#define _TU16BPRT_PRT_POSITION                              0x0
#define _TU16BPRT_PRT_SIZE                                  0x8
#define _TU16BPRT_PRT_LENGTH                                0x8
#define _TU16BPRT_PRT_MASK                                  0xFF
#define _TU16BPRT_PRT0_POSN                                 0x0
#define _TU16BPRT_PRT0_POSITION                             0x0
#define _TU16BPRT_PRT0_SIZE                                 0x1
#define _TU16BPRT_PRT0_LENGTH                               0x1
#define _TU16BPRT_PRT0_MASK                                 0x1
#define _TU16BPRT_PRT1_POSN                                 0x1
#define _TU16BPRT_PRT1_POSITION                             0x1
#define _TU16BPRT_PRT1_SIZE                                 0x1
#define _TU16BPRT_PRT1_LENGTH                               0x1
#define _TU16BPRT_PRT1_MASK                                 0x2
#define _TU16BPRT_PRT2_POSN                                 0x2
#define _TU16BPRT_PRT2_POSITION                             0x2
#define _TU16BPRT_PRT2_SIZE                                 0x1
#define _TU16BPRT_PRT2_LENGTH                               0x1
#define _TU16BPRT_PRT2_MASK                                 0x4
#define _TU16BPRT_PRT3_POSN                                 0x3
#define _TU16BPRT_PRT3_POSITION                             0x3
#define _TU16BPRT_PRT3_SIZE                                 0x1
#define _TU16BPRT_PRT3_LENGTH                               0x1
#define _TU16BPRT_PRT3_MASK                                 0x8
#define _TU16BPRT_PRT4_POSN                                 0x4
#define _TU16BPRT_PRT4_POSITION                             0x4
#define _TU16BPRT_PRT4_SIZE                                 0x1
#define _TU16BPRT_PRT4_LENGTH                               0x1
#define _TU16BPRT_PRT4_MASK                                 0x10
#define _TU16BPRT_PRT5_POSN                                 0x5
#define _TU16BPRT_PRT5_POSITION                             0x5
#define _TU16BPRT_PRT5_SIZE                                 0x1
#define _TU16BPRT_PRT5_LENGTH                               0x1
#define _TU16BPRT_PRT5_MASK                                 0x20
#define _TU16BPRT_PRT6_POSN                                 0x6
#define _TU16BPRT_PRT6_POSITION                             0x6
#define _TU16BPRT_PRT6_SIZE                                 0x1
#define _TU16BPRT_PRT6_LENGTH                               0x1
#define _TU16BPRT_PRT6_MASK                                 0x40
#define _TU16BPRT_PRT7_POSN                                 0x7
#define _TU16BPRT_PRT7_POSITION                             0x7
#define _TU16BPRT_PRT7_SIZE                                 0x1
#define _TU16BPRT_PRT7_LENGTH                               0x1
#define _TU16BPRT_PRT7_MASK                                 0x80
#define _TU16BPRT_TU16BPRT0_POSN                            0x0
#define _TU16BPRT_TU16BPRT0_POSITION                        0x0
#define _TU16BPRT_TU16BPRT0_SIZE                            0x1
#define _TU16BPRT_TU16BPRT0_LENGTH                          0x1
#define _TU16BPRT_TU16BPRT0_MASK                            0x1
#define _TU16BPRT_TU16BPRT1_POSN                            0x1
#define _TU16BPRT_TU16BPRT1_POSITION                        0x1
#define _TU16BPRT_TU16BPRT1_SIZE                            0x1
#define _TU16BPRT_TU16BPRT1_LENGTH                          0x1
#define _TU16BPRT_TU16BPRT1_MASK                            0x2
#define _TU16BPRT_TU16BPRT2_POSN                            0x2
#define _TU16BPRT_TU16BPRT2_POSITION                        0x2
#define _TU16BPRT_TU16BPRT2_SIZE                            0x1
#define _TU16BPRT_TU16BPRT2_LENGTH                          0x1
#define _TU16BPRT_TU16BPRT2_MASK                            0x4
#define _TU16BPRT_TU16BPRT3_POSN                            0x3
#define _TU16BPRT_TU16BPRT3_POSITION                        0x3
#define _TU16BPRT_TU16BPRT3_SIZE                            0x1
#define _TU16BPRT_TU16BPRT3_LENGTH                          0x1
#define _TU16BPRT_TU16BPRT3_MASK                            0x8
#define _TU16BPRT_TU16BPRT4_POSN                            0x4
#define _TU16BPRT_TU16BPRT4_POSITION                        0x4
#define _TU16BPRT_TU16BPRT4_SIZE                            0x1
#define _TU16BPRT_TU16BPRT4_LENGTH                          0x1
#define _TU16BPRT_TU16BPRT4_MASK                            0x10
#define _TU16BPRT_TU16BPRT5_POSN                            0x5
#define _TU16BPRT_TU16BPRT5_POSITION                        0x5
#define _TU16BPRT_TU16BPRT5_SIZE                            0x1
#define _TU16BPRT_TU16BPRT5_LENGTH                          0x1
#define _TU16BPRT_TU16BPRT5_MASK                            0x20
#define _TU16BPRT_TU16BPRT6_POSN                            0x6
#define _TU16BPRT_TU16BPRT6_POSITION                        0x6
#define _TU16BPRT_TU16BPRT6_SIZE                            0x1
#define _TU16BPRT_TU16BPRT6_LENGTH                          0x1
#define _TU16BPRT_TU16BPRT6_MASK                            0x40
#define _TU16BPRT_TU16BPRT7_POSN                            0x7
#define _TU16BPRT_TU16BPRT7_POSITION                        0x7
#define _TU16BPRT_TU16BPRT7_SIZE                            0x1
#define _TU16BPRT_TU16BPRT7_LENGTH                          0x1
#define _TU16BPRT_TU16BPRT7_MASK                            0x80
#define _TU16BPRT_TU16BPR24_POSN                            0x0
#define _TU16BPRT_TU16BPR24_POSITION                        0x0
#define _TU16BPRT_TU16BPR24_SIZE                            0x1
#define _TU16BPRT_TU16BPR24_LENGTH                          0x1
#define _TU16BPRT_TU16BPR24_MASK                            0x1
#define _TU16BPRT_TU16BPR25_POSN                            0x1
#define _TU16BPRT_TU16BPR25_POSITION                        0x1
#define _TU16BPRT_TU16BPR25_SIZE                            0x1
#define _TU16BPRT_TU16BPR25_LENGTH                          0x1
#define _TU16BPRT_TU16BPR25_MASK                            0x2
#define _TU16BPRT_TU16BPR26_POSN                            0x2
#define _TU16BPRT_TU16BPR26_POSITION                        0x2
#define _TU16BPRT_TU16BPR26_SIZE                            0x1
#define _TU16BPRT_TU16BPR26_LENGTH                          0x1
#define _TU16BPRT_TU16BPR26_MASK                            0x4
#define _TU16BPRT_TU16BPR27_POSN                            0x3
#define _TU16BPRT_TU16BPR27_POSITION                        0x3
#define _TU16BPRT_TU16BPR27_SIZE                            0x1
#define _TU16BPRT_TU16BPR27_LENGTH                          0x1
#define _TU16BPRT_TU16BPR27_MASK                            0x8
#define _TU16BPRT_TU16BPR28_POSN                            0x4
#define _TU16BPRT_TU16BPR28_POSITION                        0x4
#define _TU16BPRT_TU16BPR28_SIZE                            0x1
#define _TU16BPRT_TU16BPR28_LENGTH                          0x1
#define _TU16BPRT_TU16BPR28_MASK                            0x10
#define _TU16BPRT_TU16BPR29_POSN                            0x5
#define _TU16BPRT_TU16BPR29_POSITION                        0x5
#define _TU16BPRT_TU16BPR29_SIZE                            0x1
#define _TU16BPRT_TU16BPR29_LENGTH                          0x1
#define _TU16BPRT_TU16BPR29_MASK                            0x20
#define _TU16BPRT_TU16BPR30_POSN                            0x6
#define _TU16BPRT_TU16BPR30_POSITION                        0x6
#define _TU16BPRT_TU16BPR30_SIZE                            0x1
#define _TU16BPRT_TU16BPR30_LENGTH                          0x1
#define _TU16BPRT_TU16BPR30_MASK                            0x40
#define _TU16BPRT_TU16BPR31_POSN                            0x7
#define _TU16BPRT_TU16BPR31_POSITION                        0x7
#define _TU16BPRT_TU16BPR31_SIZE                            0x1
#define _TU16BPRT_TU16BPR31_LENGTH                          0x1
#define _TU16BPRT_TU16BPR31_MASK                            0x80

