garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f55q24.h
// Register: ODCONF
#define ODCONF ODCONF
extern volatile unsigned char           ODCONF              __at(0x42A);
#ifndef _LIB_BUILD
asm("ODCONF equ 042Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCF0                  :1;
        unsigned ODCF1                  :1;
        unsigned ODCF2                  :1;
        unsigned ODCF3                  :1;
        unsigned ODCF4                  :1;
        unsigned ODCF5                  :1;
        unsigned ODCF6                  :1;
        unsigned ODCF7                  :1;
    };
} ODCONFbits_t;
extern volatile ODCONFbits_t ODCONFbits __at(0x42A);
// bitfield macros
#define _ODCONF_ODCF0_POSN                                  0x0
#define _ODCONF_ODCF0_POSITION                              0x0
#define _ODCONF_ODCF0_SIZE                                  0x1
#define _ODCONF_ODCF0_LENGTH                                0x1
#define _ODCONF_ODCF0_MASK                                  0x1
#define _ODCONF_ODCF1_POSN                                  0x1
#define _ODCONF_ODCF1_POSITION                              0x1
#define _ODCONF_ODCF1_SIZE                                  0x1
#define _ODCONF_ODCF1_LENGTH                                0x1
#define _ODCONF_ODCF1_MASK                                  0x2
#define _ODCONF_ODCF2_POSN                                  0x2
#define _ODCONF_ODCF2_POSITION                              0x2
#define _ODCONF_ODCF2_SIZE                                  0x1
#define _ODCONF_ODCF2_LENGTH                                0x1
#define _ODCONF_ODCF2_MASK                                  0x4
#define _ODCONF_ODCF3_POSN                                  0x3
#define _ODCONF_ODCF3_POSITION                              0x3
#define _ODCONF_ODCF3_SIZE                                  0x1
#define _ODCONF_ODCF3_LENGTH                                0x1
#define _ODCONF_ODCF3_MASK                                  0x8
#define _ODCONF_ODCF4_POSN                                  0x4
#define _ODCONF_ODCF4_POSITION                              0x4
#define _ODCONF_ODCF4_SIZE                                  0x1
#define _ODCONF_ODCF4_LENGTH                                0x1
#define _ODCONF_ODCF4_MASK                                  0x10
#define _ODCONF_ODCF5_POSN                                  0x5
#define _ODCONF_ODCF5_POSITION                              0x5
#define _ODCONF_ODCF5_SIZE                                  0x1
#define _ODCONF_ODCF5_LENGTH                                0x1
#define _ODCONF_ODCF5_MASK                                  0x20
#define _ODCONF_ODCF6_POSN                                  0x6
#define _ODCONF_ODCF6_POSITION                              0x6
#define _ODCONF_ODCF6_SIZE                                  0x1
#define _ODCONF_ODCF6_LENGTH                                0x1
#define _ODCONF_ODCF6_MASK                                  0x40
#define _ODCONF_ODCF7_POSN                                  0x7
#define _ODCONF_ODCF7_POSITION                              0x7
#define _ODCONF_ODCF7_SIZE                                  0x1
#define _ODCONF_ODCF7_LENGTH                                0x1
#define _ODCONF_ODCF7_MASK                                  0x80

// Register: SLRCONF
#define SLRCONF SLRCONF
extern volatile unsigned char           SLRCONF             __at(0x42B);
#ifndef _LIB_BUILD
asm("SLRCONF equ 042Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRF0                  :1;
        unsigned SLRF1                  :1;
        unsigned SLRF2                  :1;
        unsigned SLRF3                  :1;
        unsigned SLRF4                  :1;
        unsigned SLRF5                  :1;
        unsigned SLRF6                  :1;
        unsigned SLRF7                  :1;
    };
} SLRCONFbits_t;
extern volatile SLRCONFbits_t SLRCONFbits __at(0x42B);
// bitfield macros
#define _SLRCONF_SLRF0_POSN                                 0x0
#define _SLRCONF_SLRF0_POSITION                             0x0
#define _SLRCONF_SLRF0_SIZE                                 0x1
#define _SLRCONF_SLRF0_LENGTH                               0x1
#define _SLRCONF_SLRF0_MASK                                 0x1
#define _SLRCONF_SLRF1_POSN                                 0x1
#define _SLRCONF_SLRF1_POSITION                             0x1
#define _SLRCONF_SLRF1_SIZE                                 0x1
#define _SLRCONF_SLRF1_LENGTH                               0x1
#define _SLRCONF_SLRF1_MASK                                 0x2
#define _SLRCONF_SLRF2_POSN                                 0x2
#define _SLRCONF_SLRF2_POSITION                             0x2
#define _SLRCONF_SLRF2_SIZE                                 0x1
#define _SLRCONF_SLRF2_LENGTH                               0x1
#define _SLRCONF_SLRF2_MASK                                 0x4
#define _SLRCONF_SLRF3_POSN                                 0x3
#define _SLRCONF_SLRF3_POSITION                             0x3
#define _SLRCONF_SLRF3_SIZE                                 0x1
#define _SLRCONF_SLRF3_LENGTH                               0x1
#define _SLRCONF_SLRF3_MASK                                 0x8
#define _SLRCONF_SLRF4_POSN                                 0x4
#define _SLRCONF_SLRF4_POSITION                             0x4
#define _SLRCONF_SLRF4_SIZE                                 0x1
#define _SLRCONF_SLRF4_LENGTH                               0x1
#define _SLRCONF_SLRF4_MASK                                 0x10
#define _SLRCONF_SLRF5_POSN                                 0x5
#define _SLRCONF_SLRF5_POSITION                             0x5
#define _SLRCONF_SLRF5_SIZE                                 0x1
#define _SLRCONF_SLRF5_LENGTH                               0x1
#define _SLRCONF_SLRF5_MASK                                 0x20
#define _SLRCONF_SLRF6_POSN                                 0x6
#define _SLRCONF_SLRF6_POSITION                             0x6
#define _SLRCONF_SLRF6_SIZE                                 0x1
#define _SLRCONF_SLRF6_LENGTH                               0x1
#define _SLRCONF_SLRF6_MASK                                 0x40
#define _SLRCONF_SLRF7_POSN                                 0x7
#define _SLRCONF_SLRF7_POSITION                             0x7
#define _SLRCONF_SLRF7_SIZE                                 0x1
#define _SLRCONF_SLRF7_LENGTH                               0x1
#define _SLRCONF_SLRF7_MASK                                 0x80

// Register: INLVLF
#define INLVLF INLVLF
extern volatile unsigned char           INLVLF              __at(0x42C);
#ifndef _LIB_BUILD
asm("INLVLF equ 042Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLF0                :1;
        unsigned INLVLF1                :1;
        unsigned INLVLF2                :1;
        unsigned INLVLF3                :1;
        unsigned INLVLF4                :1;
        unsigned INLVLF5                :1;
        unsigned INLVLF6                :1;
        unsigned INLVLF7                :1;
    };
} INLVLFbits_t;
extern volatile INLVLFbits_t INLVLFbits __at(0x42C);
// bitfield macros
#define _INLVLF_INLVLF0_POSN                                0x0
#define _INLVLF_INLVLF0_POSITION                            0x0
#define _INLVLF_INLVLF0_SIZE                                0x1
#define _INLVLF_INLVLF0_LENGTH                              0x1
#define _INLVLF_INLVLF0_MASK                                0x1
#define _INLVLF_INLVLF1_POSN                                0x1
#define _INLVLF_INLVLF1_POSITION                            0x1
#define _INLVLF_INLVLF1_SIZE                                0x1
#define _INLVLF_INLVLF1_LENGTH                              0x1
#define _INLVLF_INLVLF1_MASK                                0x2
#define _INLVLF_INLVLF2_POSN                                0x2
#define _INLVLF_INLVLF2_POSITION                            0x2
#define _INLVLF_INLVLF2_SIZE                                0x1
#define _INLVLF_INLVLF2_LENGTH                              0x1
#define _INLVLF_INLVLF2_MASK                                0x4
#define _INLVLF_INLVLF3_POSN                                0x3
#define _INLVLF_INLVLF3_POSITION                            0x3
#define _INLVLF_INLVLF3_SIZE                                0x1
#define _INLVLF_INLVLF3_LENGTH                              0x1
#define _INLVLF_INLVLF3_MASK                                0x8
#define _INLVLF_INLVLF4_POSN                                0x4
#define _INLVLF_INLVLF4_POSITION                            0x4
#define _INLVLF_INLVLF4_SIZE                                0x1
#define _INLVLF_INLVLF4_LENGTH                              0x1
#define _INLVLF_INLVLF4_MASK                                0x10
#define _INLVLF_INLVLF5_POSN                                0x5
#define _INLVLF_INLVLF5_POSITION                            0x5
#define _INLVLF_INLVLF5_SIZE                                0x1
#define _INLVLF_INLVLF5_LENGTH                              0x1
#define _INLVLF_INLVLF5_MASK                                0x20
#define _INLVLF_INLVLF6_POSN                                0x6
#define _INLVLF_INLVLF6_POSITION                            0x6
#define _INLVLF_INLVLF6_SIZE                                0x1
#define _INLVLF_INLVLF6_LENGTH                              0x1
#define _INLVLF_INLVLF6_MASK                                0x40
#define _INLVLF_INLVLF7_POSN                                0x7
#define _INLVLF_INLVLF7_POSITION                            0x7
#define _INLVLF_INLVLF7_SIZE                                0x1
#define _INLVLF_INLVLF7_LENGTH                              0x1
#define _INLVLF_INLVLF7_MASK                                0x80

// Register: IOCFP
#define IOCFP IOCFP
extern volatile unsigned char           IOCFP               __at(0x42D);
#ifndef _LIB_BUILD
asm("IOCFP equ 042Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCFP0                 :1;
        unsigned IOCFP1                 :1;
        unsigned IOCFP2                 :1;
        unsigned IOCFP3                 :1;
        unsigned IOCFP4                 :1;
        unsigned IOCFP5                 :1;
        unsigned IOCFP6                 :1;
        unsigned IOCFP7                 :1;
    };
} IOCFPbits_t;
extern volatile IOCFPbits_t IOCFPbits __at(0x42D);
// bitfield macros
#define _IOCFP_IOCFP0_POSN                                  0x0
#define _IOCFP_IOCFP0_POSITION                              0x0
#define _IOCFP_IOCFP0_SIZE                                  0x1
#define _IOCFP_IOCFP0_LENGTH                                0x1
#define _IOCFP_IOCFP0_MASK                                  0x1
#define _IOCFP_IOCFP1_POSN                                  0x1
#define _IOCFP_IOCFP1_POSITION                              0x1
#define _IOCFP_IOCFP1_SIZE                                  0x1
#define _IOCFP_IOCFP1_LENGTH                                0x1
#define _IOCFP_IOCFP1_MASK                                  0x2
#define _IOCFP_IOCFP2_POSN                                  0x2
#define _IOCFP_IOCFP2_POSITION                              0x2
#define _IOCFP_IOCFP2_SIZE                                  0x1
#define _IOCFP_IOCFP2_LENGTH                                0x1
#define _IOCFP_IOCFP2_MASK                                  0x4
#define _IOCFP_IOCFP3_POSN                                  0x3
#define _IOCFP_IOCFP3_POSITION                              0x3
#define _IOCFP_IOCFP3_SIZE                                  0x1
#define _IOCFP_IOCFP3_LENGTH                                0x1
#define _IOCFP_IOCFP3_MASK                                  0x8
#define _IOCFP_IOCFP4_POSN                                  0x4
#define _IOCFP_IOCFP4_POSITION                              0x4
#define _IOCFP_IOCFP4_SIZE                                  0x1
#define _IOCFP_IOCFP4_LENGTH                                0x1
#define _IOCFP_IOCFP4_MASK                                  0x10
#define _IOCFP_IOCFP5_POSN                                  0x5
#define _IOCFP_IOCFP5_POSITION                              0x5
#define _IOCFP_IOCFP5_SIZE                                  0x1
#define _IOCFP_IOCFP5_LENGTH                                0x1
#define _IOCFP_IOCFP5_MASK                                  0x20
#define _IOCFP_IOCFP6_POSN                                  0x6
#define _IOCFP_IOCFP6_POSITION                              0x6
#define _IOCFP_IOCFP6_SIZE                                  0x1
#define _IOCFP_IOCFP6_LENGTH                                0x1
#define _IOCFP_IOCFP6_MASK                                  0x40
#define _IOCFP_IOCFP7_POSN                                  0x7
#define _IOCFP_IOCFP7_POSITION                              0x7
#define _IOCFP_IOCFP7_SIZE                                  0x1
#define _IOCFP_IOCFP7_LENGTH                                0x1
#define _IOCFP_IOCFP7_MASK                                  0x80

// Register: IOCFN
#define IOCFN IOCFN
extern volatile unsigned char           IOCFN               __at(0x42E);
#ifndef _LIB_BUILD
asm("IOCFN equ 042Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCFN0                 :1;
        unsigned IOCFN1                 :1;
        unsigned IOCFN2                 :1;
        unsigned IOCFN3                 :1;
        unsigned IOCFN4                 :1;
        unsigned IOCFN5                 :1;
        unsigned IOCFN6                 :1;
        unsigned IOCFN7                 :1;
    };
} IOCFNbits_t;
extern volatile IOCFNbits_t IOCFNbits __at(0x42E);
// bitfield macros
#define _IOCFN_IOCFN0_POSN                                  0x0
#define _IOCFN_IOCFN0_POSITION                              0x0
#define _IOCFN_IOCFN0_SIZE                                  0x1
#define _IOCFN_IOCFN0_LENGTH                                0x1
#define _IOCFN_IOCFN0_MASK                                  0x1
#define _IOCFN_IOCFN1_POSN                                  0x1
#define _IOCFN_IOCFN1_POSITION                              0x1
#define _IOCFN_IOCFN1_SIZE                                  0x1
#define _IOCFN_IOCFN1_LENGTH                                0x1
#define _IOCFN_IOCFN1_MASK                                  0x2
#define _IOCFN_IOCFN2_POSN                                  0x2
#define _IOCFN_IOCFN2_POSITION                              0x2
#define _IOCFN_IOCFN2_SIZE                                  0x1
#define _IOCFN_IOCFN2_LENGTH                                0x1
#define _IOCFN_IOCFN2_MASK                                  0x4
#define _IOCFN_IOCFN3_POSN                                  0x3
#define _IOCFN_IOCFN3_POSITION                              0x3
#define _IOCFN_IOCFN3_SIZE                                  0x1
#define _IOCFN_IOCFN3_LENGTH                                0x1
#define _IOCFN_IOCFN3_MASK                                  0x8
#define _IOCFN_IOCFN4_POSN                                  0x4
#define _IOCFN_IOCFN4_POSITION                              0x4
#define _IOCFN_IOCFN4_SIZE                                  0x1
#define _IOCFN_IOCFN4_LENGTH                                0x1
#define _IOCFN_IOCFN4_MASK                                  0x10
#define _IOCFN_IOCFN5_POSN                                  0x5
#define _IOCFN_IOCFN5_POSITION                              0x5
#define _IOCFN_IOCFN5_SIZE                                  0x1
#define _IOCFN_IOCFN5_LENGTH                                0x1
#define _IOCFN_IOCFN5_MASK                                  0x20
#define _IOCFN_IOCFN6_POSN                                  0x6
#define _IOCFN_IOCFN6_POSITION                              0x6
#define _IOCFN_IOCFN6_SIZE                                  0x1
#define _IOCFN_IOCFN6_LENGTH                                0x1
#define _IOCFN_IOCFN6_MASK                                  0x40
#define _IOCFN_IOCFN7_POSN                                  0x7
#define _IOCFN_IOCFN7_POSITION                              0x7
#define _IOCFN_IOCFN7_SIZE                                  0x1
#define _IOCFN_IOCFN7_LENGTH                                0x1
#define _IOCFN_IOCFN7_MASK                                  0x80

// Register: IOCFF
#define IOCFF IOCFF
extern volatile unsigned char           IOCFF               __at(0x42F);
#ifndef _LIB_BUILD
asm("IOCFF equ 042Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCFF0                 :1;
        unsigned IOCFF1                 :1;
        unsigned IOCFF2                 :1;
        unsigned IOCFF3                 :1;
        unsigned IOCFF4                 :1;
        unsigned IOCFF5                 :1;
        unsigned IOCFF6                 :1;
        unsigned IOCFF7                 :1;
    };
} IOCFFbits_t;
extern volatile IOCFFbits_t IOCFFbits __at(0x42F);
// bitfield macros
#define _IOCFF_IOCFF0_POSN                                  0x0
#define _IOCFF_IOCFF0_POSITION                              0x0
#define _IOCFF_IOCFF0_SIZE                                  0x1
#define _IOCFF_IOCFF0_LENGTH                                0x1
#define _IOCFF_IOCFF0_MASK                                  0x1
#define _IOCFF_IOCFF1_POSN                                  0x1
#define _IOCFF_IOCFF1_POSITION                              0x1
#define _IOCFF_IOCFF1_SIZE                                  0x1
#define _IOCFF_IOCFF1_LENGTH                                0x1
#define _IOCFF_IOCFF1_MASK                                  0x2
#define _IOCFF_IOCFF2_POSN                                  0x2
#define _IOCFF_IOCFF2_POSITION                              0x2
#define _IOCFF_IOCFF2_SIZE                                  0x1
#define _IOCFF_IOCFF2_LENGTH                                0x1
#define _IOCFF_IOCFF2_MASK                                  0x4
#define _IOCFF_IOCFF3_POSN                                  0x3
#define _IOCFF_IOCFF3_POSITION                              0x3
#define _IOCFF_IOCFF3_SIZE                                  0x1
#define _IOCFF_IOCFF3_LENGTH                                0x1
#define _IOCFF_IOCFF3_MASK                                  0x8
#define _IOCFF_IOCFF4_POSN                                  0x4
#define _IOCFF_IOCFF4_POSITION                              0x4
#define _IOCFF_IOCFF4_SIZE                                  0x1
#define _IOCFF_IOCFF4_LENGTH                                0x1
#define _IOCFF_IOCFF4_MASK                                  0x10
#define _IOCFF_IOCFF5_POSN                                  0x5
#define _IOCFF_IOCFF5_POSITION                              0x5
#define _IOCFF_IOCFF5_SIZE                                  0x1
#define _IOCFF_IOCFF5_LENGTH                                0x1
#define _IOCFF_IOCFF5_MASK                                  0x20
#define _IOCFF_IOCFF6_POSN                                  0x6
#define _IOCFF_IOCFF6_POSITION                              0x6
#define _IOCFF_IOCFF6_SIZE                                  0x1
#define _IOCFF_IOCFF6_LENGTH                                0x1
#define _IOCFF_IOCFF6_MASK                                  0x40
#define _IOCFF_IOCFF7_POSN                                  0x7
#define _IOCFF_IOCFF7_POSITION                              0x7
#define _IOCFF_IOCFF7_SIZE                                  0x1
#define _IOCFF_IOCFF7_LENGTH                                0x1
#define _IOCFF_IOCFF7_MASK                                  0x80

// Register: IOCWP
#define IOCWP IOCWP
extern volatile unsigned char           IOCWP               __at(0x43D);
#ifndef _LIB_BUILD
asm("IOCWP equ 043Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCWP0                 :1;
        unsigned IOCWP1                 :1;
        unsigned IOCWP2                 :1;
        unsigned IOCWP3                 :1;
        unsigned IOCWP4                 :1;
        unsigned IOCWP5                 :1;
        unsigned IOCWP6                 :1;
        unsigned IOCWP7                 :1;
    };
} IOCWPbits_t;
