garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f55q24.h
extern volatile IPR10bits_t IPR10bits __at(0x4A8);
// bitfield macros
#define _IPR10_INT2IP_POSN                                  0x0
#define _IPR10_INT2IP_POSITION                              0x0
#define _IPR10_INT2IP_SIZE                                  0x1
#define _IPR10_INT2IP_LENGTH                                0x1
#define _IPR10_INT2IP_MASK                                  0x1
#define _IPR10_CLC8IP_POSN                                  0x1
#define _IPR10_CLC8IP_POSITION                              0x1
#define _IPR10_CLC8IP_SIZE                                  0x1
#define _IPR10_CLC8IP_LENGTH                                0x1
#define _IPR10_CLC8IP_MASK                                  0x2
#define _IPR10_TU16BIP_POSN                                 0x2
#define _IPR10_TU16BIP_POSITION                             0x2
#define _IPR10_TU16BIP_SIZE                                 0x1
#define _IPR10_TU16BIP_LENGTH                               0x1
#define _IPR10_TU16BIP_MASK                                 0x4
#define _IPR10_TMR4IP_POSN                                  0x3
#define _IPR10_TMR4IP_POSITION                              0x3
#define _IPR10_TMR4IP_SIZE                                  0x1
#define _IPR10_TMR4IP_LENGTH                                0x1
#define _IPR10_TMR4IP_MASK                                  0x8
#define _IPR10_DMA4SCNTIP_POSN                              0x4
#define _IPR10_DMA4SCNTIP_POSITION                          0x4
#define _IPR10_DMA4SCNTIP_SIZE                              0x1
#define _IPR10_DMA4SCNTIP_LENGTH                            0x1
#define _IPR10_DMA4SCNTIP_MASK                              0x10
#define _IPR10_DMA4DCNTIP_POSN                              0x5
#define _IPR10_DMA4DCNTIP_POSITION                          0x5
#define _IPR10_DMA4DCNTIP_SIZE                              0x1
#define _IPR10_DMA4DCNTIP_LENGTH                            0x1
#define _IPR10_DMA4DCNTIP_MASK                              0x20
#define _IPR10_DMA4ORIP_POSN                                0x6
#define _IPR10_DMA4ORIP_POSITION                            0x6
#define _IPR10_DMA4ORIP_SIZE                                0x1
#define _IPR10_DMA4ORIP_LENGTH                              0x1
#define _IPR10_DMA4ORIP_MASK                                0x40
#define _IPR10_DMA4AIP_POSN                                 0x7
#define _IPR10_DMA4AIP_POSITION                             0x7
#define _IPR10_DMA4AIP_SIZE                                 0x1
#define _IPR10_DMA4AIP_LENGTH                               0x1
#define _IPR10_DMA4AIP_MASK                                 0x80

// Register: IPR11
#define IPR11 IPR11
extern volatile unsigned char           IPR11               __at(0x4A9);
#ifndef _LIB_BUILD
asm("IPR11 equ 04A9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI2RXIP               :1;
        unsigned SPI2TXIP               :1;
        unsigned SPI2IP                 :1;
        unsigned VDDIO2LVDIP            :1;
        unsigned VDDIO2nRDYIP           :1;
    };
} IPR11bits_t;
extern volatile IPR11bits_t IPR11bits __at(0x4A9);
// bitfield macros
#define _IPR11_SPI2RXIP_POSN                                0x0
#define _IPR11_SPI2RXIP_POSITION                            0x0
#define _IPR11_SPI2RXIP_SIZE                                0x1
#define _IPR11_SPI2RXIP_LENGTH                              0x1
#define _IPR11_SPI2RXIP_MASK                                0x1
#define _IPR11_SPI2TXIP_POSN                                0x1
#define _IPR11_SPI2TXIP_POSITION                            0x1
#define _IPR11_SPI2TXIP_SIZE                                0x1
#define _IPR11_SPI2TXIP_LENGTH                              0x1
#define _IPR11_SPI2TXIP_MASK                                0x2
#define _IPR11_SPI2IP_POSN                                  0x2
#define _IPR11_SPI2IP_POSITION                              0x2
#define _IPR11_SPI2IP_SIZE                                  0x1
#define _IPR11_SPI2IP_LENGTH                                0x1
#define _IPR11_SPI2IP_MASK                                  0x4
#define _IPR11_VDDIO2LVDIP_POSN                             0x3
#define _IPR11_VDDIO2LVDIP_POSITION                         0x3
#define _IPR11_VDDIO2LVDIP_SIZE                             0x1
#define _IPR11_VDDIO2LVDIP_LENGTH                           0x1
#define _IPR11_VDDIO2LVDIP_MASK                             0x8
#define _IPR11_VDDIO2nRDYIP_POSN                            0x4
#define _IPR11_VDDIO2nRDYIP_POSITION                        0x4
#define _IPR11_VDDIO2nRDYIP_SIZE                            0x1
#define _IPR11_VDDIO2nRDYIP_LENGTH                          0x1
#define _IPR11_VDDIO2nRDYIP_MASK                            0x10

// Register: PIE0
#define PIE0 PIE0
extern volatile unsigned char           PIE0                __at(0x4AA);
#ifndef _LIB_BUILD
asm("PIE0 equ 04AAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWIE                   :1;
        unsigned HLVDIE                 :1;
        unsigned OSFIE                  :1;
        unsigned CSWIE                  :1;
        unsigned NVMIE                  :1;
        unsigned CLC1IE                 :1;
        unsigned CRCIE                  :1;
        unsigned IOCIE                  :1;
    };
} PIE0bits_t;
extern volatile PIE0bits_t PIE0bits __at(0x4AA);
// bitfield macros
#define _PIE0_SWIE_POSN                                     0x0
#define _PIE0_SWIE_POSITION                                 0x0
#define _PIE0_SWIE_SIZE                                     0x1
#define _PIE0_SWIE_LENGTH                                   0x1
#define _PIE0_SWIE_MASK                                     0x1
#define _PIE0_HLVDIE_POSN                                   0x1
#define _PIE0_HLVDIE_POSITION                               0x1
#define _PIE0_HLVDIE_SIZE                                   0x1
#define _PIE0_HLVDIE_LENGTH                                 0x1
#define _PIE0_HLVDIE_MASK                                   0x2
#define _PIE0_OSFIE_POSN                                    0x2
#define _PIE0_OSFIE_POSITION                                0x2
#define _PIE0_OSFIE_SIZE                                    0x1
#define _PIE0_OSFIE_LENGTH                                  0x1
#define _PIE0_OSFIE_MASK                                    0x4
#define _PIE0_CSWIE_POSN                                    0x3
#define _PIE0_CSWIE_POSITION                                0x3
#define _PIE0_CSWIE_SIZE                                    0x1
#define _PIE0_CSWIE_LENGTH                                  0x1
#define _PIE0_CSWIE_MASK                                    0x8
#define _PIE0_NVMIE_POSN                                    0x4
#define _PIE0_NVMIE_POSITION                                0x4
#define _PIE0_NVMIE_SIZE                                    0x1
#define _PIE0_NVMIE_LENGTH                                  0x1
#define _PIE0_NVMIE_MASK                                    0x10
#define _PIE0_CLC1IE_POSN                                   0x5
#define _PIE0_CLC1IE_POSITION                               0x5
#define _PIE0_CLC1IE_SIZE                                   0x1
#define _PIE0_CLC1IE_LENGTH                                 0x1
#define _PIE0_CLC1IE_MASK                                   0x20
#define _PIE0_CRCIE_POSN                                    0x6
#define _PIE0_CRCIE_POSITION                                0x6
#define _PIE0_CRCIE_SIZE                                    0x1
#define _PIE0_CRCIE_LENGTH                                  0x1
#define _PIE0_CRCIE_MASK                                    0x40
#define _PIE0_IOCIE_POSN                                    0x7
#define _PIE0_IOCIE_POSITION                                0x7
#define _PIE0_IOCIE_SIZE                                    0x1
#define _PIE0_IOCIE_LENGTH                                  0x1
#define _PIE0_IOCIE_MASK                                    0x80

// Register: PIE1
#define PIE1 PIE1
extern volatile unsigned char           PIE1                __at(0x4AB);
#ifndef _LIB_BUILD
asm("PIE1 equ 04ABh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IE                 :1;
        unsigned ADTIE                  :1;
        unsigned ADIE                   :1;
        unsigned ACTIE                  :1;
        unsigned I2C2RXIE               :1;
        unsigned I2C2TXIE               :1;
        unsigned I2C2IE                 :1;
        unsigned I2C2EIE                :1;
    };
} PIE1bits_t;
extern volatile PIE1bits_t PIE1bits __at(0x4AB);
// bitfield macros
#define _PIE1_INT0IE_POSN                                   0x0
#define _PIE1_INT0IE_POSITION                               0x0
#define _PIE1_INT0IE_SIZE                                   0x1
#define _PIE1_INT0IE_LENGTH                                 0x1
#define _PIE1_INT0IE_MASK                                   0x1
#define _PIE1_ADTIE_POSN                                    0x1
#define _PIE1_ADTIE_POSITION                                0x1
#define _PIE1_ADTIE_SIZE                                    0x1
#define _PIE1_ADTIE_LENGTH                                  0x1
#define _PIE1_ADTIE_MASK                                    0x2
#define _PIE1_ADIE_POSN                                     0x2
#define _PIE1_ADIE_POSITION                                 0x2
#define _PIE1_ADIE_SIZE                                     0x1
#define _PIE1_ADIE_LENGTH                                   0x1
#define _PIE1_ADIE_MASK                                     0x4
#define _PIE1_ACTIE_POSN                                    0x3
#define _PIE1_ACTIE_POSITION                                0x3
#define _PIE1_ACTIE_SIZE                                    0x1
#define _PIE1_ACTIE_LENGTH                                  0x1
#define _PIE1_ACTIE_MASK                                    0x8
#define _PIE1_I2C2RXIE_POSN                                 0x4
#define _PIE1_I2C2RXIE_POSITION                             0x4
#define _PIE1_I2C2RXIE_SIZE                                 0x1
#define _PIE1_I2C2RXIE_LENGTH                               0x1
#define _PIE1_I2C2RXIE_MASK                                 0x10
#define _PIE1_I2C2TXIE_POSN                                 0x5
#define _PIE1_I2C2TXIE_POSITION                             0x5
#define _PIE1_I2C2TXIE_SIZE                                 0x1
#define _PIE1_I2C2TXIE_LENGTH                               0x1
#define _PIE1_I2C2TXIE_MASK                                 0x20
#define _PIE1_I2C2IE_POSN                                   0x6
#define _PIE1_I2C2IE_POSITION                               0x6
#define _PIE1_I2C2IE_SIZE                                   0x1
#define _PIE1_I2C2IE_LENGTH                                 0x1
#define _PIE1_I2C2IE_MASK                                   0x40
#define _PIE1_I2C2EIE_POSN                                  0x7
#define _PIE1_I2C2EIE_POSITION                              0x7
#define _PIE1_I2C2EIE_SIZE                                  0x1
#define _PIE1_I2C2EIE_LENGTH                                0x1
#define _PIE1_I2C2EIE_MASK                                  0x80

// Register: PIE2
#define PIE2 PIE2
extern volatile unsigned char           PIE2                __at(0x4AC);
#ifndef _LIB_BUILD
asm("PIE2 equ 04ACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ZCD2IE                 :1;
        unsigned CLC5IE                 :1;
        unsigned IOCSRIE                :1;
        unsigned ZCD1IE                 :1;
        unsigned DMA1SCNTIE             :1;
        unsigned DMA1DCNTIE             :1;
        unsigned DMA1ORIE               :1;
        unsigned DMA1AIE                :1;
    };
} PIE2bits_t;
extern volatile PIE2bits_t PIE2bits __at(0x4AC);
// bitfield macros
#define _PIE2_ZCD2IE_POSN                                   0x0
#define _PIE2_ZCD2IE_POSITION                               0x0
#define _PIE2_ZCD2IE_SIZE                                   0x1
#define _PIE2_ZCD2IE_LENGTH                                 0x1
#define _PIE2_ZCD2IE_MASK                                   0x1
#define _PIE2_CLC5IE_POSN                                   0x1
#define _PIE2_CLC5IE_POSITION                               0x1
#define _PIE2_CLC5IE_SIZE                                   0x1
#define _PIE2_CLC5IE_LENGTH                                 0x1
#define _PIE2_CLC5IE_MASK                                   0x2
#define _PIE2_IOCSRIE_POSN                                  0x2
#define _PIE2_IOCSRIE_POSITION                              0x2
#define _PIE2_IOCSRIE_SIZE                                  0x1
#define _PIE2_IOCSRIE_LENGTH                                0x1
#define _PIE2_IOCSRIE_MASK                                  0x4
#define _PIE2_ZCD1IE_POSN                                   0x3
#define _PIE2_ZCD1IE_POSITION                               0x3
#define _PIE2_ZCD1IE_SIZE                                   0x1
#define _PIE2_ZCD1IE_LENGTH                                 0x1
#define _PIE2_ZCD1IE_MASK                                   0x8
#define _PIE2_DMA1SCNTIE_POSN                               0x4
#define _PIE2_DMA1SCNTIE_POSITION                           0x4
#define _PIE2_DMA1SCNTIE_SIZE                               0x1
#define _PIE2_DMA1SCNTIE_LENGTH                             0x1
#define _PIE2_DMA1SCNTIE_MASK                               0x10
#define _PIE2_DMA1DCNTIE_POSN                               0x5
#define _PIE2_DMA1DCNTIE_POSITION                           0x5
#define _PIE2_DMA1DCNTIE_SIZE                               0x1
#define _PIE2_DMA1DCNTIE_LENGTH                             0x1
#define _PIE2_DMA1DCNTIE_MASK                               0x20
#define _PIE2_DMA1ORIE_POSN                                 0x6
#define _PIE2_DMA1ORIE_POSITION                             0x6
#define _PIE2_DMA1ORIE_SIZE                                 0x1
#define _PIE2_DMA1ORIE_LENGTH                               0x1
#define _PIE2_DMA1ORIE_MASK                                 0x40
#define _PIE2_DMA1AIE_POSN                                  0x7
#define _PIE2_DMA1AIE_POSITION                              0x7
#define _PIE2_DMA1AIE_SIZE                                  0x1
#define _PIE2_DMA1AIE_LENGTH                                0x1
#define _PIE2_DMA1AIE_MASK                                  0x80

// Register: PIE3
#define PIE3 PIE3
extern volatile unsigned char           PIE3                __at(0x4AD);
#ifndef _LIB_BUILD
asm("PIE3 equ 04ADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1RXIE               :1;
        unsigned SPI1TXIE               :1;
        unsigned SPI1IE                 :1;
        unsigned TMR2IE                 :1;
        unsigned TMR1IE                 :1;
        unsigned TMR1GIE                :1;
        unsigned CCP1IE                 :1;
        unsigned TMR0IE                 :1;
    };
} PIE3bits_t;
extern volatile PIE3bits_t PIE3bits __at(0x4AD);
// bitfield macros
#define _PIE3_SPI1RXIE_POSN                                 0x0
#define _PIE3_SPI1RXIE_POSITION                             0x0
#define _PIE3_SPI1RXIE_SIZE                                 0x1
#define _PIE3_SPI1RXIE_LENGTH                               0x1
#define _PIE3_SPI1RXIE_MASK                                 0x1
#define _PIE3_SPI1TXIE_POSN                                 0x1
#define _PIE3_SPI1TXIE_POSITION                             0x1
#define _PIE3_SPI1TXIE_SIZE                                 0x1
#define _PIE3_SPI1TXIE_LENGTH                               0x1
#define _PIE3_SPI1TXIE_MASK                                 0x2
#define _PIE3_SPI1IE_POSN                                   0x2
#define _PIE3_SPI1IE_POSITION                               0x2
#define _PIE3_SPI1IE_SIZE                                   0x1
#define _PIE3_SPI1IE_LENGTH                                 0x1
#define _PIE3_SPI1IE_MASK                                   0x4
#define _PIE3_TMR2IE_POSN                                   0x3
#define _PIE3_TMR2IE_POSITION                               0x3
#define _PIE3_TMR2IE_SIZE                                   0x1
#define _PIE3_TMR2IE_LENGTH                                 0x1
#define _PIE3_TMR2IE_MASK                                   0x8
#define _PIE3_TMR1IE_POSN                                   0x4
#define _PIE3_TMR1IE_POSITION                               0x4
#define _PIE3_TMR1IE_SIZE                                   0x1
#define _PIE3_TMR1IE_LENGTH                                 0x1
#define _PIE3_TMR1IE_MASK                                   0x10
#define _PIE3_TMR1GIE_POSN                                  0x5
#define _PIE3_TMR1GIE_POSITION                              0x5
#define _PIE3_TMR1GIE_SIZE                                  0x1
#define _PIE3_TMR1GIE_LENGTH                                0x1
#define _PIE3_TMR1GIE_MASK                                  0x20
#define _PIE3_CCP1IE_POSN                                   0x6
#define _PIE3_CCP1IE_POSITION                               0x6
#define _PIE3_CCP1IE_SIZE                                   0x1
#define _PIE3_CCP1IE_LENGTH                                 0x1
#define _PIE3_CCP1IE_MASK                                   0x40
#define _PIE3_TMR0IE_POSN                                   0x7
#define _PIE3_TMR0IE_POSITION                               0x7
#define _PIE3_TMR0IE_SIZE                                   0x1
#define _PIE3_TMR0IE_LENGTH                                 0x1
#define _PIE3_TMR0IE_MASK                                   0x80

