garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f55q24.h
// Register: PIE11
#define PIE11 PIE11
extern volatile unsigned char           PIE11               __at(0x4B5);
#ifndef _LIB_BUILD
asm("PIE11 equ 04B5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI2RXIE               :1;
        unsigned SPI2TXIE               :1;
        unsigned SPI2IE                 :1;
        unsigned VDDIO2LVDIE            :1;
        unsigned VDDIO2nRDYIE           :1;
    };
} PIE11bits_t;
extern volatile PIE11bits_t PIE11bits __at(0x4B5);
// bitfield macros
#define _PIE11_SPI2RXIE_POSN                                0x0
#define _PIE11_SPI2RXIE_POSITION                            0x0
#define _PIE11_SPI2RXIE_SIZE                                0x1
#define _PIE11_SPI2RXIE_LENGTH                              0x1
#define _PIE11_SPI2RXIE_MASK                                0x1
#define _PIE11_SPI2TXIE_POSN                                0x1
#define _PIE11_SPI2TXIE_POSITION                            0x1
#define _PIE11_SPI2TXIE_SIZE                                0x1
#define _PIE11_SPI2TXIE_LENGTH                              0x1
#define _PIE11_SPI2TXIE_MASK                                0x2
#define _PIE11_SPI2IE_POSN                                  0x2
#define _PIE11_SPI2IE_POSITION                              0x2
#define _PIE11_SPI2IE_SIZE                                  0x1
#define _PIE11_SPI2IE_LENGTH                                0x1
#define _PIE11_SPI2IE_MASK                                  0x4
#define _PIE11_VDDIO2LVDIE_POSN                             0x3
#define _PIE11_VDDIO2LVDIE_POSITION                         0x3
#define _PIE11_VDDIO2LVDIE_SIZE                             0x1
#define _PIE11_VDDIO2LVDIE_LENGTH                           0x1
#define _PIE11_VDDIO2LVDIE_MASK                             0x8
#define _PIE11_VDDIO2nRDYIE_POSN                            0x4
#define _PIE11_VDDIO2nRDYIE_POSITION                        0x4
#define _PIE11_VDDIO2nRDYIE_SIZE                            0x1
#define _PIE11_VDDIO2nRDYIE_LENGTH                          0x1
#define _PIE11_VDDIO2nRDYIE_MASK                            0x10

// Register: PIR0
#define PIR0 PIR0
extern volatile unsigned char           PIR0                __at(0x4B6);
#ifndef _LIB_BUILD
asm("PIR0 equ 04B6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWIF                   :1;
        unsigned HLVDIF                 :1;
        unsigned OSFIF                  :1;
        unsigned CSWIF                  :1;
        unsigned NVMIF                  :1;
        unsigned CLC1IF                 :1;
        unsigned CRCIF                  :1;
        unsigned IOCIF                  :1;
    };
} PIR0bits_t;
extern volatile PIR0bits_t PIR0bits __at(0x4B6);
// bitfield macros
#define _PIR0_SWIF_POSN                                     0x0
#define _PIR0_SWIF_POSITION                                 0x0
#define _PIR0_SWIF_SIZE                                     0x1
#define _PIR0_SWIF_LENGTH                                   0x1
#define _PIR0_SWIF_MASK                                     0x1
#define _PIR0_HLVDIF_POSN                                   0x1
#define _PIR0_HLVDIF_POSITION                               0x1
#define _PIR0_HLVDIF_SIZE                                   0x1
#define _PIR0_HLVDIF_LENGTH                                 0x1
#define _PIR0_HLVDIF_MASK                                   0x2
#define _PIR0_OSFIF_POSN                                    0x2
#define _PIR0_OSFIF_POSITION                                0x2
#define _PIR0_OSFIF_SIZE                                    0x1
#define _PIR0_OSFIF_LENGTH                                  0x1
#define _PIR0_OSFIF_MASK                                    0x4
#define _PIR0_CSWIF_POSN                                    0x3
#define _PIR0_CSWIF_POSITION                                0x3
#define _PIR0_CSWIF_SIZE                                    0x1
#define _PIR0_CSWIF_LENGTH                                  0x1
#define _PIR0_CSWIF_MASK                                    0x8
#define _PIR0_NVMIF_POSN                                    0x4
#define _PIR0_NVMIF_POSITION                                0x4
#define _PIR0_NVMIF_SIZE                                    0x1
#define _PIR0_NVMIF_LENGTH                                  0x1
#define _PIR0_NVMIF_MASK                                    0x10
#define _PIR0_CLC1IF_POSN                                   0x5
#define _PIR0_CLC1IF_POSITION                               0x5
#define _PIR0_CLC1IF_SIZE                                   0x1
#define _PIR0_CLC1IF_LENGTH                                 0x1
#define _PIR0_CLC1IF_MASK                                   0x20
#define _PIR0_CRCIF_POSN                                    0x6
#define _PIR0_CRCIF_POSITION                                0x6
#define _PIR0_CRCIF_SIZE                                    0x1
#define _PIR0_CRCIF_LENGTH                                  0x1
#define _PIR0_CRCIF_MASK                                    0x40
#define _PIR0_IOCIF_POSN                                    0x7
#define _PIR0_IOCIF_POSITION                                0x7
#define _PIR0_IOCIF_SIZE                                    0x1
#define _PIR0_IOCIF_LENGTH                                  0x1
#define _PIR0_IOCIF_MASK                                    0x80

// Register: PIR1
#define PIR1 PIR1
extern volatile unsigned char           PIR1                __at(0x4B7);
#ifndef _LIB_BUILD
asm("PIR1 equ 04B7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IF                 :1;
        unsigned ADTIF                  :1;
        unsigned ADIF                   :1;
        unsigned ACTIF                  :1;
        unsigned I2C2RXIF               :1;
        unsigned I2C2TXIF               :1;
        unsigned I2C2IF                 :1;
        unsigned I2C2EIF                :1;
    };
} PIR1bits_t;
extern volatile PIR1bits_t PIR1bits __at(0x4B7);
// bitfield macros
#define _PIR1_INT0IF_POSN                                   0x0
#define _PIR1_INT0IF_POSITION                               0x0
#define _PIR1_INT0IF_SIZE                                   0x1
#define _PIR1_INT0IF_LENGTH                                 0x1
#define _PIR1_INT0IF_MASK                                   0x1
#define _PIR1_ADTIF_POSN                                    0x1
#define _PIR1_ADTIF_POSITION                                0x1
#define _PIR1_ADTIF_SIZE                                    0x1
#define _PIR1_ADTIF_LENGTH                                  0x1
#define _PIR1_ADTIF_MASK                                    0x2
#define _PIR1_ADIF_POSN                                     0x2
#define _PIR1_ADIF_POSITION                                 0x2
#define _PIR1_ADIF_SIZE                                     0x1
#define _PIR1_ADIF_LENGTH                                   0x1
#define _PIR1_ADIF_MASK                                     0x4
#define _PIR1_ACTIF_POSN                                    0x3
#define _PIR1_ACTIF_POSITION                                0x3
#define _PIR1_ACTIF_SIZE                                    0x1
#define _PIR1_ACTIF_LENGTH                                  0x1
#define _PIR1_ACTIF_MASK                                    0x8
#define _PIR1_I2C2RXIF_POSN                                 0x4
#define _PIR1_I2C2RXIF_POSITION                             0x4
#define _PIR1_I2C2RXIF_SIZE                                 0x1
#define _PIR1_I2C2RXIF_LENGTH                               0x1
#define _PIR1_I2C2RXIF_MASK                                 0x10
#define _PIR1_I2C2TXIF_POSN                                 0x5
#define _PIR1_I2C2TXIF_POSITION                             0x5
#define _PIR1_I2C2TXIF_SIZE                                 0x1
#define _PIR1_I2C2TXIF_LENGTH                               0x1
#define _PIR1_I2C2TXIF_MASK                                 0x20
#define _PIR1_I2C2IF_POSN                                   0x6
#define _PIR1_I2C2IF_POSITION                               0x6
#define _PIR1_I2C2IF_SIZE                                   0x1
#define _PIR1_I2C2IF_LENGTH                                 0x1
#define _PIR1_I2C2IF_MASK                                   0x40
#define _PIR1_I2C2EIF_POSN                                  0x7
#define _PIR1_I2C2EIF_POSITION                              0x7
#define _PIR1_I2C2EIF_SIZE                                  0x1
#define _PIR1_I2C2EIF_LENGTH                                0x1
#define _PIR1_I2C2EIF_MASK                                  0x80

// Register: PIR2
#define PIR2 PIR2
extern volatile unsigned char           PIR2                __at(0x4B8);
#ifndef _LIB_BUILD
asm("PIR2 equ 04B8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ZCD2IF                 :1;
        unsigned CLC5IF                 :1;
        unsigned IOCSRIF                :1;
        unsigned ZCD1IF                 :1;
        unsigned DMA1SCNTIF             :1;
        unsigned DMA1DCNTIF             :1;
        unsigned DMA1ORIF               :1;
        unsigned DMA1AIF                :1;
    };
} PIR2bits_t;
extern volatile PIR2bits_t PIR2bits __at(0x4B8);
// bitfield macros
#define _PIR2_ZCD2IF_POSN                                   0x0
#define _PIR2_ZCD2IF_POSITION                               0x0
#define _PIR2_ZCD2IF_SIZE                                   0x1
#define _PIR2_ZCD2IF_LENGTH                                 0x1
#define _PIR2_ZCD2IF_MASK                                   0x1
#define _PIR2_CLC5IF_POSN                                   0x1
#define _PIR2_CLC5IF_POSITION                               0x1
#define _PIR2_CLC5IF_SIZE                                   0x1
#define _PIR2_CLC5IF_LENGTH                                 0x1
#define _PIR2_CLC5IF_MASK                                   0x2
#define _PIR2_IOCSRIF_POSN                                  0x2
#define _PIR2_IOCSRIF_POSITION                              0x2
#define _PIR2_IOCSRIF_SIZE                                  0x1
#define _PIR2_IOCSRIF_LENGTH                                0x1
#define _PIR2_IOCSRIF_MASK                                  0x4
#define _PIR2_ZCD1IF_POSN                                   0x3
#define _PIR2_ZCD1IF_POSITION                               0x3
#define _PIR2_ZCD1IF_SIZE                                   0x1
#define _PIR2_ZCD1IF_LENGTH                                 0x1
#define _PIR2_ZCD1IF_MASK                                   0x8
#define _PIR2_DMA1SCNTIF_POSN                               0x4
#define _PIR2_DMA1SCNTIF_POSITION                           0x4
#define _PIR2_DMA1SCNTIF_SIZE                               0x1
#define _PIR2_DMA1SCNTIF_LENGTH                             0x1
#define _PIR2_DMA1SCNTIF_MASK                               0x10
#define _PIR2_DMA1DCNTIF_POSN                               0x5
#define _PIR2_DMA1DCNTIF_POSITION                           0x5
#define _PIR2_DMA1DCNTIF_SIZE                               0x1
#define _PIR2_DMA1DCNTIF_LENGTH                             0x1
#define _PIR2_DMA1DCNTIF_MASK                               0x20
#define _PIR2_DMA1ORIF_POSN                                 0x6
#define _PIR2_DMA1ORIF_POSITION                             0x6
#define _PIR2_DMA1ORIF_SIZE                                 0x1
#define _PIR2_DMA1ORIF_LENGTH                               0x1
#define _PIR2_DMA1ORIF_MASK                                 0x40
#define _PIR2_DMA1AIF_POSN                                  0x7
#define _PIR2_DMA1AIF_POSITION                              0x7
#define _PIR2_DMA1AIF_SIZE                                  0x1
#define _PIR2_DMA1AIF_LENGTH                                0x1
#define _PIR2_DMA1AIF_MASK                                  0x80

// Register: PIR3
#define PIR3 PIR3
extern volatile unsigned char           PIR3                __at(0x4B9);
#ifndef _LIB_BUILD
asm("PIR3 equ 04B9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1RXIF               :1;
        unsigned SPI1TXIF               :1;
        unsigned SPI1IF                 :1;
        unsigned TMR2IF                 :1;
        unsigned TMR1IF                 :1;
        unsigned TMR1GIF                :1;
        unsigned CCP1IF                 :1;
        unsigned TMR0IF                 :1;
    };
} PIR3bits_t;
extern volatile PIR3bits_t PIR3bits __at(0x4B9);
// bitfield macros
#define _PIR3_SPI1RXIF_POSN                                 0x0
#define _PIR3_SPI1RXIF_POSITION                             0x0
#define _PIR3_SPI1RXIF_SIZE                                 0x1
#define _PIR3_SPI1RXIF_LENGTH                               0x1
#define _PIR3_SPI1RXIF_MASK                                 0x1
#define _PIR3_SPI1TXIF_POSN                                 0x1
#define _PIR3_SPI1TXIF_POSITION                             0x1
#define _PIR3_SPI1TXIF_SIZE                                 0x1
#define _PIR3_SPI1TXIF_LENGTH                               0x1
#define _PIR3_SPI1TXIF_MASK                                 0x2
#define _PIR3_SPI1IF_POSN                                   0x2
#define _PIR3_SPI1IF_POSITION                               0x2
#define _PIR3_SPI1IF_SIZE                                   0x1
#define _PIR3_SPI1IF_LENGTH                                 0x1
#define _PIR3_SPI1IF_MASK                                   0x4
#define _PIR3_TMR2IF_POSN                                   0x3
#define _PIR3_TMR2IF_POSITION                               0x3
#define _PIR3_TMR2IF_SIZE                                   0x1
#define _PIR3_TMR2IF_LENGTH                                 0x1
#define _PIR3_TMR2IF_MASK                                   0x8
#define _PIR3_TMR1IF_POSN                                   0x4
#define _PIR3_TMR1IF_POSITION                               0x4
#define _PIR3_TMR1IF_SIZE                                   0x1
#define _PIR3_TMR1IF_LENGTH                                 0x1
#define _PIR3_TMR1IF_MASK                                   0x10
#define _PIR3_TMR1GIF_POSN                                  0x5
#define _PIR3_TMR1GIF_POSITION                              0x5
#define _PIR3_TMR1GIF_SIZE                                  0x1
#define _PIR3_TMR1GIF_LENGTH                                0x1
#define _PIR3_TMR1GIF_MASK                                  0x20
#define _PIR3_CCP1IF_POSN                                   0x6
#define _PIR3_CCP1IF_POSITION                               0x6
#define _PIR3_CCP1IF_SIZE                                   0x1
#define _PIR3_CCP1IF_LENGTH                                 0x1
#define _PIR3_CCP1IF_MASK                                   0x40
#define _PIR3_TMR0IF_POSN                                   0x7
#define _PIR3_TMR0IF_POSITION                               0x7
#define _PIR3_TMR0IF_SIZE                                   0x1
#define _PIR3_TMR0IF_LENGTH                                 0x1
#define _PIR3_TMR0IF_MASK                                   0x80

// Register: PIR4
#define PIR4 PIR4
extern volatile unsigned char           PIR4                __at(0x4BA);
#ifndef _LIB_BUILD
asm("PIR4 equ 04BAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U1RXIF                 :1;
        unsigned U1TXIF                 :1;
        unsigned U1EIF                  :1;
        unsigned U1IF                   :1;
        unsigned TMR3IF                 :1;
        unsigned TMR3GIF                :1;
        unsigned PWM1PIF                :1;
        unsigned PWM1IF                 :1;
    };
} PIR4bits_t;
