garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f55q24.h
#define                                 ADPRE7_bit          _BIT_ACCESS(ADPREL,7)
// ADPREH<ADPRE8>
extern volatile __bit                   ADPRE8              __at(0x1F90);	// @ (0x3F2 * 8 + 0)
#define                                 ADPRE8_bit          _BIT_ACCESS(ADPREH,0)
// ADPREH<ADPRE9>
extern volatile __bit                   ADPRE9              __at(0x1F91);	// @ (0x3F2 * 8 + 1)
#define                                 ADPRE9_bit          _BIT_ACCESS(ADPREH,1)
// ADREF<ADPREF0>
extern volatile __bit                   ADPREF0             __at(0x1FC0);	// @ (0x3F8 * 8 + 0)
#define                                 ADPREF0_bit         _BIT_ACCESS(ADREF,0)
// ADREF<ADPREF1>
extern volatile __bit                   ADPREF1             __at(0x1FC1);	// @ (0x3F8 * 8 + 1)
#define                                 ADPREF1_bit         _BIT_ACCESS(ADREF,1)
// ADPREVL<ADPREV0>
extern volatile __bit                   ADPREV0             __at(0x1F40);	// @ (0x3E8 * 8 + 0)
#define                                 ADPREV0_bit         _BIT_ACCESS(ADPREVL,0)
// ADPREVL<ADPREV1>
extern volatile __bit                   ADPREV1             __at(0x1F41);	// @ (0x3E8 * 8 + 1)
#define                                 ADPREV1_bit         _BIT_ACCESS(ADPREVL,1)
// ADPREVH<ADPREV10>
extern volatile __bit                   ADPREV10            __at(0x1F4A);	// @ (0x3E9 * 8 + 2)
#define                                 ADPREV10_bit        _BIT_ACCESS(ADPREVH,2)
// ADPREVH<ADPREV11>
extern volatile __bit                   ADPREV11            __at(0x1F4B);	// @ (0x3E9 * 8 + 3)
#define                                 ADPREV11_bit        _BIT_ACCESS(ADPREVH,3)
// ADPREVH<ADPREV12>
extern volatile __bit                   ADPREV12            __at(0x1F4C);	// @ (0x3E9 * 8 + 4)
#define                                 ADPREV12_bit        _BIT_ACCESS(ADPREVH,4)
// ADPREVH<ADPREV13>
extern volatile __bit                   ADPREV13            __at(0x1F4D);	// @ (0x3E9 * 8 + 5)
#define                                 ADPREV13_bit        _BIT_ACCESS(ADPREVH,5)
// ADPREVH<ADPREV14>
extern volatile __bit                   ADPREV14            __at(0x1F4E);	// @ (0x3E9 * 8 + 6)
#define                                 ADPREV14_bit        _BIT_ACCESS(ADPREVH,6)
// ADPREVH<ADPREV15>
extern volatile __bit                   ADPREV15            __at(0x1F4F);	// @ (0x3E9 * 8 + 7)
#define                                 ADPREV15_bit        _BIT_ACCESS(ADPREVH,7)
// ADPREVL<ADPREV2>
extern volatile __bit                   ADPREV2             __at(0x1F42);	// @ (0x3E8 * 8 + 2)
#define                                 ADPREV2_bit         _BIT_ACCESS(ADPREVL,2)
// ADPREVL<ADPREV3>
extern volatile __bit                   ADPREV3             __at(0x1F43);	// @ (0x3E8 * 8 + 3)
#define                                 ADPREV3_bit         _BIT_ACCESS(ADPREVL,3)
// ADPREVL<ADPREV4>
extern volatile __bit                   ADPREV4             __at(0x1F44);	// @ (0x3E8 * 8 + 4)
#define                                 ADPREV4_bit         _BIT_ACCESS(ADPREVL,4)
// ADPREVL<ADPREV5>
extern volatile __bit                   ADPREV5             __at(0x1F45);	// @ (0x3E8 * 8 + 5)
#define                                 ADPREV5_bit         _BIT_ACCESS(ADPREVL,5)
// ADPREVL<ADPREV6>
extern volatile __bit                   ADPREV6             __at(0x1F46);	// @ (0x3E8 * 8 + 6)
#define                                 ADPREV6_bit         _BIT_ACCESS(ADPREVL,6)
// ADPREVL<ADPREV7>
extern volatile __bit                   ADPREV7             __at(0x1F47);	// @ (0x3E8 * 8 + 7)
#define                                 ADPREV7_bit         _BIT_ACCESS(ADPREVL,7)
// ADPREVH<ADPREV8>
extern volatile __bit                   ADPREV8             __at(0x1F48);	// @ (0x3E9 * 8 + 0)
#define                                 ADPREV8_bit         _BIT_ACCESS(ADPREVH,0)
// ADPREVH<ADPREV9>
extern volatile __bit                   ADPREV9             __at(0x1F49);	// @ (0x3E9 * 8 + 1)
#define                                 ADPREV9_bit         _BIT_ACCESS(ADPREVH,1)
// ADCON2<ADPSIS>
extern volatile __bit                   ADPSIS              __at(0x1FAF);	// @ (0x3F5 * 8 + 7)
#define                                 ADPSIS_bit          _BIT_ACCESS(ADCON2,7)
// I2C1PIE<ADR1IE>
extern volatile __bit                   ADR1IE              __at(0x14D3);	// @ (0x29A * 8 + 3)
#define                                 ADR1IE_bit          _BIT_ACCESS(I2C1PIE,3)
// I2C1PIR<ADR1IF>
extern volatile __bit                   ADR1IF              __at(0x14CB);	// @ (0x299 * 8 + 3)
#define                                 ADR1IF_bit          _BIT_ACCESS(I2C1PIR,3)
// I2C2PIE<ADR2IE>
extern volatile __bit                   ADR2IE              __at(0x158B);	// @ (0x2B1 * 8 + 3)
#define                                 ADR2IE_bit          _BIT_ACCESS(I2C2PIE,3)
// I2C2PIR<ADR2IF>
extern volatile __bit                   ADR2IF              __at(0x1583);	// @ (0x2B0 * 8 + 3)
#define                                 ADR2IF_bit          _BIT_ACCESS(I2C2PIR,3)
// ADRESL<ADRES0>
extern volatile __bit                   ADRES0              __at(0x1F50);	// @ (0x3EA * 8 + 0)
#define                                 ADRES0_bit          _BIT_ACCESS(ADRESL,0)
// ADRESL<ADRES1>
extern volatile __bit                   ADRES1              __at(0x1F51);	// @ (0x3EA * 8 + 1)
#define                                 ADRES1_bit          _BIT_ACCESS(ADRESL,1)
// ADRESH<ADRES10>
extern volatile __bit                   ADRES10             __at(0x1F5A);	// @ (0x3EB * 8 + 2)
#define                                 ADRES10_bit         _BIT_ACCESS(ADRESH,2)
// ADRESH<ADRES11>
extern volatile __bit                   ADRES11             __at(0x1F5B);	// @ (0x3EB * 8 + 3)
#define                                 ADRES11_bit         _BIT_ACCESS(ADRESH,3)
// ADRESH<ADRES12>
extern volatile __bit                   ADRES12             __at(0x1F5C);	// @ (0x3EB * 8 + 4)
#define                                 ADRES12_bit         _BIT_ACCESS(ADRESH,4)
// ADRESH<ADRES13>
extern volatile __bit                   ADRES13             __at(0x1F5D);	// @ (0x3EB * 8 + 5)
#define                                 ADRES13_bit         _BIT_ACCESS(ADRESH,5)
// ADRESH<ADRES14>
extern volatile __bit                   ADRES14             __at(0x1F5E);	// @ (0x3EB * 8 + 6)
#define                                 ADRES14_bit         _BIT_ACCESS(ADRESH,6)
// ADRESH<ADRES15>
extern volatile __bit                   ADRES15             __at(0x1F5F);	// @ (0x3EB * 8 + 7)
#define                                 ADRES15_bit         _BIT_ACCESS(ADRESH,7)
// ADRESL<ADRES2>
extern volatile __bit                   ADRES2              __at(0x1F52);	// @ (0x3EA * 8 + 2)
#define                                 ADRES2_bit          _BIT_ACCESS(ADRESL,2)
// ADRESL<ADRES3>
extern volatile __bit                   ADRES3              __at(0x1F53);	// @ (0x3EA * 8 + 3)
#define                                 ADRES3_bit          _BIT_ACCESS(ADRESL,3)
// ADRESL<ADRES4>
extern volatile __bit                   ADRES4              __at(0x1F54);	// @ (0x3EA * 8 + 4)
#define                                 ADRES4_bit          _BIT_ACCESS(ADRESL,4)
// ADRESL<ADRES5>
extern volatile __bit                   ADRES5              __at(0x1F55);	// @ (0x3EA * 8 + 5)
#define                                 ADRES5_bit          _BIT_ACCESS(ADRESL,5)
// ADRESL<ADRES6>
extern volatile __bit                   ADRES6              __at(0x1F56);	// @ (0x3EA * 8 + 6)
#define                                 ADRES6_bit          _BIT_ACCESS(ADRESL,6)
// ADRESL<ADRES7>
extern volatile __bit                   ADRES7              __at(0x1F57);	// @ (0x3EA * 8 + 7)
#define                                 ADRES7_bit          _BIT_ACCESS(ADRESL,7)
// ADRESH<ADRES8>
extern volatile __bit                   ADRES8              __at(0x1F58);	// @ (0x3EB * 8 + 0)
#define                                 ADRES8_bit          _BIT_ACCESS(ADRESH,0)
// ADRESH<ADRES9>
extern volatile __bit                   ADRES9              __at(0x1F59);	// @ (0x3EB * 8 + 1)
#define                                 ADRES9_bit          _BIT_ACCESS(ADRESH,1)
// ADRPT<ADRPT0>
extern volatile __bit                   ADRPT0              __at(0x1F38);	// @ (0x3E7 * 8 + 0)
#define                                 ADRPT0_bit          _BIT_ACCESS(ADRPT,0)
// ADRPT<ADRPT1>
extern volatile __bit                   ADRPT1              __at(0x1F39);	// @ (0x3E7 * 8 + 1)
#define                                 ADRPT1_bit          _BIT_ACCESS(ADRPT,1)
// ADRPT<ADRPT2>
extern volatile __bit                   ADRPT2              __at(0x1F3A);	// @ (0x3E7 * 8 + 2)
#define                                 ADRPT2_bit          _BIT_ACCESS(ADRPT,2)
// ADRPT<ADRPT3>
extern volatile __bit                   ADRPT3              __at(0x1F3B);	// @ (0x3E7 * 8 + 3)
#define                                 ADRPT3_bit          _BIT_ACCESS(ADRPT,3)
// ADRPT<ADRPT4>
extern volatile __bit                   ADRPT4              __at(0x1F3C);	// @ (0x3E7 * 8 + 4)
#define                                 ADRPT4_bit          _BIT_ACCESS(ADRPT,4)
// ADRPT<ADRPT5>
extern volatile __bit                   ADRPT5              __at(0x1F3D);	// @ (0x3E7 * 8 + 5)
#define                                 ADRPT5_bit          _BIT_ACCESS(ADRPT,5)
// ADRPT<ADRPT6>
extern volatile __bit                   ADRPT6              __at(0x1F3E);	// @ (0x3E7 * 8 + 6)
#define                                 ADRPT6_bit          _BIT_ACCESS(ADRPT,6)
// ADRPT<ADRPT7>
extern volatile __bit                   ADRPT7              __at(0x1F3F);	// @ (0x3E7 * 8 + 7)
#define                                 ADRPT7_bit          _BIT_ACCESS(ADRPT,7)
// ADCON3<ADSOI>
extern volatile __bit                   ADSOI               __at(0x1FB3);	// @ (0x3F6 * 8 + 3)
#define                                 ADSOI_bit           _BIT_ACCESS(ADCON3,3)
// ADSTAT<ADSTAT0>
extern volatile __bit                   ADSTAT0             __at(0x1FB8);	// @ (0x3F7 * 8 + 0)
#define                                 ADSTAT0_bit         _BIT_ACCESS(ADSTAT,0)
// ADSTAT<ADSTAT1>
extern volatile __bit                   ADSTAT1             __at(0x1FB9);	// @ (0x3F7 * 8 + 1)
#define                                 ADSTAT1_bit         _BIT_ACCESS(ADSTAT,1)
// ADSTAT<ADSTAT2>
extern volatile __bit                   ADSTAT2             __at(0x1FBA);	// @ (0x3F7 * 8 + 2)
#define                                 ADSTAT2_bit         _BIT_ACCESS(ADSTAT,2)
// ADSTPTL<ADSTPT0>
extern volatile __bit                   ADSTPT0             __at(0x1EF8);	// @ (0x3DF * 8 + 0)
#define                                 ADSTPT0_bit         _BIT_ACCESS(ADSTPTL,0)
// ADSTPTL<ADSTPT1>
extern volatile __bit                   ADSTPT1             __at(0x1EF9);	// @ (0x3DF * 8 + 1)
#define                                 ADSTPT1_bit         _BIT_ACCESS(ADSTPTL,1)
// ADSTPTH<ADSTPT10>
extern volatile __bit                   ADSTPT10            __at(0x1F02);	// @ (0x3E0 * 8 + 2)
#define                                 ADSTPT10_bit        _BIT_ACCESS(ADSTPTH,2)
// ADSTPTH<ADSTPT11>
extern volatile __bit                   ADSTPT11            __at(0x1F03);	// @ (0x3E0 * 8 + 3)
#define                                 ADSTPT11_bit        _BIT_ACCESS(ADSTPTH,3)
// ADSTPTH<ADSTPT12>
extern volatile __bit                   ADSTPT12            __at(0x1F04);	// @ (0x3E0 * 8 + 4)
#define                                 ADSTPT12_bit        _BIT_ACCESS(ADSTPTH,4)
// ADSTPTH<ADSTPT13>
extern volatile __bit                   ADSTPT13            __at(0x1F05);	// @ (0x3E0 * 8 + 5)
#define                                 ADSTPT13_bit        _BIT_ACCESS(ADSTPTH,5)
// ADSTPTH<ADSTPT14>
extern volatile __bit                   ADSTPT14            __at(0x1F06);	// @ (0x3E0 * 8 + 6)
#define                                 ADSTPT14_bit        _BIT_ACCESS(ADSTPTH,6)
// ADSTPTH<ADSTPT15>
extern volatile __bit                   ADSTPT15            __at(0x1F07);	// @ (0x3E0 * 8 + 7)
#define                                 ADSTPT15_bit        _BIT_ACCESS(ADSTPTH,7)
// ADSTPTL<ADSTPT2>
extern volatile __bit                   ADSTPT2             __at(0x1EFA);	// @ (0x3DF * 8 + 2)
#define                                 ADSTPT2_bit         _BIT_ACCESS(ADSTPTL,2)
// ADSTPTL<ADSTPT3>
extern volatile __bit                   ADSTPT3             __at(0x1EFB);	// @ (0x3DF * 8 + 3)
#define                                 ADSTPT3_bit         _BIT_ACCESS(ADSTPTL,3)
// ADSTPTL<ADSTPT4>
extern volatile __bit                   ADSTPT4             __at(0x1EFC);	// @ (0x3DF * 8 + 4)
#define                                 ADSTPT4_bit         _BIT_ACCESS(ADSTPTL,4)
// ADSTPTL<ADSTPT5>
extern volatile __bit                   ADSTPT5             __at(0x1EFD);	// @ (0x3DF * 8 + 5)
#define                                 ADSTPT5_bit         _BIT_ACCESS(ADSTPTL,5)
// ADSTPTL<ADSTPT6>
extern volatile __bit                   ADSTPT6             __at(0x1EFE);	// @ (0x3DF * 8 + 6)
#define                                 ADSTPT6_bit         _BIT_ACCESS(ADSTPTL,6)
// ADSTPTL<ADSTPT7>
extern volatile __bit                   ADSTPT7             __at(0x1EFF);	// @ (0x3DF * 8 + 7)
#define                                 ADSTPT7_bit         _BIT_ACCESS(ADSTPTL,7)
// ADSTPTH<ADSTPT8>
extern volatile __bit                   ADSTPT8             __at(0x1F00);	// @ (0x3E0 * 8 + 0)
#define                                 ADSTPT8_bit         _BIT_ACCESS(ADSTPTH,0)
// ADSTPTH<ADSTPT9>
extern volatile __bit                   ADSTPT9             __at(0x1F01);	// @ (0x3E0 * 8 + 1)
#define                                 ADSTPT9_bit         _BIT_ACCESS(ADSTPTH,1)
// PIE1<ADTIE>
extern volatile __bit                   ADTIE               __at(0x2559);	// @ (0x4AB * 8 + 1)
#define                                 ADTIE_bit           _BIT_ACCESS(PIE1,1)
// PIR1<ADTIF>
extern volatile __bit                   ADTIF               __at(0x25B9);	// @ (0x4B7 * 8 + 1)
#define                                 ADTIF_bit           _BIT_ACCESS(PIR1,1)
// IPR1<ADTIP>
extern volatile __bit                   ADTIP               __at(0x24F9);	// @ (0x49F * 8 + 1)
#define                                 ADTIP_bit           _BIT_ACCESS(IPR1,1)
// ADCON3<ADTMD0>
extern volatile __bit                   ADTMD0              __at(0x1FB0);	// @ (0x3F6 * 8 + 0)
#define                                 ADTMD0_bit          _BIT_ACCESS(ADCON3,0)
// ADCON3<ADTMD1>
extern volatile __bit                   ADTMD1              __at(0x1FB1);	// @ (0x3F6 * 8 + 1)
#define                                 ADTMD1_bit          _BIT_ACCESS(ADCON3,1)
// ADCON3<ADTMD2>
extern volatile __bit                   ADTMD2              __at(0x1FB2);	// @ (0x3F6 * 8 + 2)
#define                                 ADTMD2_bit          _BIT_ACCESS(ADCON3,2)
// ADUTHL<ADUTH0>
extern volatile __bit                   ADUTH0              __at(0x1ED8);	// @ (0x3DB * 8 + 0)
#define                                 ADUTH0_bit          _BIT_ACCESS(ADUTHL,0)
// ADUTHL<ADUTH1>
extern volatile __bit                   ADUTH1              __at(0x1ED9);	// @ (0x3DB * 8 + 1)
#define                                 ADUTH1_bit          _BIT_ACCESS(ADUTHL,1)
// ADUTHH<ADUTH10>
extern volatile __bit                   ADUTH10             __at(0x1EE2);	// @ (0x3DC * 8 + 2)
#define                                 ADUTH10_bit         _BIT_ACCESS(ADUTHH,2)
// ADUTHH<ADUTH11>
extern volatile __bit                   ADUTH11             __at(0x1EE3);	// @ (0x3DC * 8 + 3)
#define                                 ADUTH11_bit         _BIT_ACCESS(ADUTHH,3)
// ADUTHH<ADUTH12>
extern volatile __bit                   ADUTH12             __at(0x1EE4);	// @ (0x3DC * 8 + 4)
#define                                 ADUTH12_bit         _BIT_ACCESS(ADUTHH,4)
// ADUTHH<ADUTH13>
extern volatile __bit                   ADUTH13             __at(0x1EE5);	// @ (0x3DC * 8 + 5)
#define                                 ADUTH13_bit         _BIT_ACCESS(ADUTHH,5)
// ADUTHH<ADUTH14>
extern volatile __bit                   ADUTH14             __at(0x1EE6);	// @ (0x3DC * 8 + 6)
#define                                 ADUTH14_bit         _BIT_ACCESS(ADUTHH,6)
// ADUTHH<ADUTH15>
extern volatile __bit                   ADUTH15             __at(0x1EE7);	// @ (0x3DC * 8 + 7)
#define                                 ADUTH15_bit         _BIT_ACCESS(ADUTHH,7)
// ADUTHL<ADUTH2>
extern volatile __bit                   ADUTH2              __at(0x1EDA);	// @ (0x3DB * 8 + 2)
#define                                 ADUTH2_bit          _BIT_ACCESS(ADUTHL,2)
// ADUTHL<ADUTH3>
extern volatile __bit                   ADUTH3              __at(0x1EDB);	// @ (0x3DB * 8 + 3)
#define                                 ADUTH3_bit          _BIT_ACCESS(ADUTHL,3)
// ADUTHL<ADUTH4>
extern volatile __bit                   ADUTH4              __at(0x1EDC);	// @ (0x3DB * 8 + 4)
#define                                 ADUTH4_bit          _BIT_ACCESS(ADUTHL,4)
// ADUTHL<ADUTH5>
extern volatile __bit                   ADUTH5              __at(0x1EDD);	// @ (0x3DB * 8 + 5)
#define                                 ADUTH5_bit          _BIT_ACCESS(ADUTHL,5)
// ADUTHL<ADUTH6>
extern volatile __bit                   ADUTH6              __at(0x1EDE);	// @ (0x3DB * 8 + 6)
#define                                 ADUTH6_bit          _BIT_ACCESS(ADUTHL,6)
// ADUTHL<ADUTH7>
extern volatile __bit                   ADUTH7              __at(0x1EDF);	// @ (0x3DB * 8 + 7)
#define                                 ADUTH7_bit          _BIT_ACCESS(ADUTHL,7)
// ADUTHH<ADUTH8>
extern volatile __bit                   ADUTH8              __at(0x1EE0);	// @ (0x3DC * 8 + 0)
#define                                 ADUTH8_bit          _BIT_ACCESS(ADUTHH,0)
// ADUTHH<ADUTH9>
extern volatile __bit                   ADUTH9              __at(0x1EE1);	// @ (0x3DC * 8 + 1)
#define                                 ADUTH9_bit          _BIT_ACCESS(ADUTHH,1)
// ADSTAT<ADUTHR>
extern volatile __bit                   ADUTHR              __at(0x1FBE);	// @ (0x3F7 * 8 + 6)
#define                                 ADUTHR_bit          _BIT_ACCESS(ADSTAT,6)
// DMAnAIRQ<AIRQ0>
extern volatile __bit                   AIRQ0               __at(0x7E8);	// @ (0xFD * 8 + 0)
#define                                 AIRQ0_bit           _BIT_ACCESS(DMAnAIRQ,0)
// DMAnAIRQ<AIRQ1>
extern volatile __bit                   AIRQ1               __at(0x7E9);	// @ (0xFD * 8 + 1)
#define                                 AIRQ1_bit           _BIT_ACCESS(DMAnAIRQ,1)
// DMAnAIRQ<AIRQ2>
extern volatile __bit                   AIRQ2               __at(0x7EA);	// @ (0xFD * 8 + 2)
#define                                 AIRQ2_bit           _BIT_ACCESS(DMAnAIRQ,2)
// DMAnAIRQ<AIRQ3>
extern volatile __bit                   AIRQ3               __at(0x7EB);	// @ (0xFD * 8 + 3)
#define                                 AIRQ3_bit           _BIT_ACCESS(DMAnAIRQ,3)
// DMAnAIRQ<AIRQ4>
extern volatile __bit                   AIRQ4               __at(0x7EC);	// @ (0xFD * 8 + 4)
#define                                 AIRQ4_bit           _BIT_ACCESS(DMAnAIRQ,4)
// DMAnAIRQ<AIRQ5>
extern volatile __bit                   AIRQ5               __at(0x7ED);	// @ (0xFD * 8 + 5)
#define                                 AIRQ5_bit           _BIT_ACCESS(DMAnAIRQ,5)
// DMAnAIRQ<AIRQ6>
extern volatile __bit                   AIRQ6               __at(0x7EE);	// @ (0xFD * 8 + 6)
#define                                 AIRQ6_bit           _BIT_ACCESS(DMAnAIRQ,6)
// DMAnAIRQ<AIRQ7>
extern volatile __bit                   AIRQ7               __at(0x7EF);	// @ (0xFD * 8 + 7)
#define                                 AIRQ7_bit           _BIT_ACCESS(DMAnAIRQ,7)
// DMAnCON0<AIRQEN>
extern volatile __bit                   AIRQEN              __at(0x7DA);	// @ (0xFB * 8 + 2)
#define                                 AIRQEN_bit          _BIT_ACCESS(DMAnCON0,2)
// ANSELA<ANSELA0>
extern volatile __bit                   ANSELA0             __at(0x2000);	// @ (0x400 * 8 + 0)
#define                                 ANSELA0_bit         _BIT_ACCESS(ANSELA,0)
// ANSELA<ANSELA1>
extern volatile __bit                   ANSELA1             __at(0x2001);	// @ (0x400 * 8 + 1)
#define                                 ANSELA1_bit         _BIT_ACCESS(ANSELA,1)
// ANSELA<ANSELA2>
extern volatile __bit                   ANSELA2             __at(0x2002);	// @ (0x400 * 8 + 2)
#define                                 ANSELA2_bit         _BIT_ACCESS(ANSELA,2)
// ANSELA<ANSELA3>
extern volatile __bit                   ANSELA3             __at(0x2003);	// @ (0x400 * 8 + 3)
#define                                 ANSELA3_bit         _BIT_ACCESS(ANSELA,3)
// ANSELA<ANSELA4>
extern volatile __bit                   ANSELA4             __at(0x2004);	// @ (0x400 * 8 + 4)
#define                                 ANSELA4_bit         _BIT_ACCESS(ANSELA,4)
// ANSELA<ANSELA5>
extern volatile __bit                   ANSELA5             __at(0x2005);	// @ (0x400 * 8 + 5)
#define                                 ANSELA5_bit         _BIT_ACCESS(ANSELA,5)
// ANSELA<ANSELA6>
extern volatile __bit                   ANSELA6             __at(0x2006);	// @ (0x400 * 8 + 6)
#define                                 ANSELA6_bit         _BIT_ACCESS(ANSELA,6)
// ANSELA<ANSELA7>
extern volatile __bit                   ANSELA7             __at(0x2007);	// @ (0x400 * 8 + 7)
#define                                 ANSELA7_bit         _BIT_ACCESS(ANSELA,7)
// ANSELB<ANSELB0>
extern volatile __bit                   ANSELB0             __at(0x2040);	// @ (0x408 * 8 + 0)
#define                                 ANSELB0_bit         _BIT_ACCESS(ANSELB,0)
// ANSELB<ANSELB1>
extern volatile __bit                   ANSELB1             __at(0x2041);	// @ (0x408 * 8 + 1)
#define                                 ANSELB1_bit         _BIT_ACCESS(ANSELB,1)
// ANSELB<ANSELB2>
extern volatile __bit                   ANSELB2             __at(0x2042);	// @ (0x408 * 8 + 2)
#define                                 ANSELB2_bit         _BIT_ACCESS(ANSELB,2)
// ANSELB<ANSELB3>
extern volatile __bit                   ANSELB3             __at(0x2043);	// @ (0x408 * 8 + 3)
#define                                 ANSELB3_bit         _BIT_ACCESS(ANSELB,3)
// ANSELB<ANSELB4>
extern volatile __bit                   ANSELB4             __at(0x2044);	// @ (0x408 * 8 + 4)
#define                                 ANSELB4_bit         _BIT_ACCESS(ANSELB,4)
// ANSELB<ANSELB5>
extern volatile __bit                   ANSELB5             __at(0x2045);	// @ (0x408 * 8 + 5)
#define                                 ANSELB5_bit         _BIT_ACCESS(ANSELB,5)
// ANSELB<ANSELB6>
extern volatile __bit                   ANSELB6             __at(0x2046);	// @ (0x408 * 8 + 6)
#define                                 ANSELB6_bit         _BIT_ACCESS(ANSELB,6)
// ANSELB<ANSELB7>
extern volatile __bit                   ANSELB7             __at(0x2047);	// @ (0x408 * 8 + 7)
#define                                 ANSELB7_bit         _BIT_ACCESS(ANSELB,7)
// ANSELC<ANSELC0>
extern volatile __bit                   ANSELC0             __at(0x2080);	// @ (0x410 * 8 + 0)
#define                                 ANSELC0_bit         _BIT_ACCESS(ANSELC,0)
// ANSELC<ANSELC1>
extern volatile __bit                   ANSELC1             __at(0x2081);	// @ (0x410 * 8 + 1)
#define                                 ANSELC1_bit         _BIT_ACCESS(ANSELC,1)
// ANSELC<ANSELC2>
extern volatile __bit                   ANSELC2             __at(0x2082);	// @ (0x410 * 8 + 2)
#define                                 ANSELC2_bit         _BIT_ACCESS(ANSELC,2)
// ANSELE<ANSELE0>
extern volatile __bit                   ANSELE0             __at(0x2100);	// @ (0x420 * 8 + 0)
#define                                 ANSELE0_bit         _BIT_ACCESS(ANSELE,0)
// ANSELE<ANSELE1>
extern volatile __bit                   ANSELE1             __at(0x2101);	// @ (0x420 * 8 + 1)
#define                                 ANSELE1_bit         _BIT_ACCESS(ANSELE,1)
