garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f55q24.h
#define                                 IOCCP3_bit          _BIT_ACCESS(IOCCP,3)
// IOCCP<IOCCP4>
extern volatile __bit                   IOCCP4              __at(0x20AC);	// @ (0x415 * 8 + 4)
#define                                 IOCCP4_bit          _BIT_ACCESS(IOCCP,4)
// IOCCP<IOCCP5>
extern volatile __bit                   IOCCP5              __at(0x20AD);	// @ (0x415 * 8 + 5)
#define                                 IOCCP5_bit          _BIT_ACCESS(IOCCP,5)
// IOCCP<IOCCP6>
extern volatile __bit                   IOCCP6              __at(0x20AE);	// @ (0x415 * 8 + 6)
#define                                 IOCCP6_bit          _BIT_ACCESS(IOCCP,6)
// IOCDF<IOCDF0>
extern volatile __bit                   IOCDF0              __at(0x20F8);	// @ (0x41F * 8 + 0)
#define                                 IOCDF0_bit          _BIT_ACCESS(IOCDF,0)
// IOCDF<IOCDF1>
extern volatile __bit                   IOCDF1              __at(0x20F9);	// @ (0x41F * 8 + 1)
#define                                 IOCDF1_bit          _BIT_ACCESS(IOCDF,1)
// IOCDF<IOCDF2>
extern volatile __bit                   IOCDF2              __at(0x20FA);	// @ (0x41F * 8 + 2)
#define                                 IOCDF2_bit          _BIT_ACCESS(IOCDF,2)
// IOCDF<IOCDF3>
extern volatile __bit                   IOCDF3              __at(0x20FB);	// @ (0x41F * 8 + 3)
#define                                 IOCDF3_bit          _BIT_ACCESS(IOCDF,3)
// IOCDF<IOCDF4>
extern volatile __bit                   IOCDF4              __at(0x20FC);	// @ (0x41F * 8 + 4)
#define                                 IOCDF4_bit          _BIT_ACCESS(IOCDF,4)
// IOCDF<IOCDF5>
extern volatile __bit                   IOCDF5              __at(0x20FD);	// @ (0x41F * 8 + 5)
#define                                 IOCDF5_bit          _BIT_ACCESS(IOCDF,5)
// IOCDF<IOCDF6>
extern volatile __bit                   IOCDF6              __at(0x20FE);	// @ (0x41F * 8 + 6)
#define                                 IOCDF6_bit          _BIT_ACCESS(IOCDF,6)
// IOCDF<IOCDF7>
extern volatile __bit                   IOCDF7              __at(0x20FF);	// @ (0x41F * 8 + 7)
#define                                 IOCDF7_bit          _BIT_ACCESS(IOCDF,7)
// IOCDN<IOCDN0>
extern volatile __bit                   IOCDN0              __at(0x20F0);	// @ (0x41E * 8 + 0)
#define                                 IOCDN0_bit          _BIT_ACCESS(IOCDN,0)
// IOCDN<IOCDN1>
extern volatile __bit                   IOCDN1              __at(0x20F1);	// @ (0x41E * 8 + 1)
#define                                 IOCDN1_bit          _BIT_ACCESS(IOCDN,1)
// IOCDN<IOCDN2>
extern volatile __bit                   IOCDN2              __at(0x20F2);	// @ (0x41E * 8 + 2)
#define                                 IOCDN2_bit          _BIT_ACCESS(IOCDN,2)
// IOCDN<IOCDN3>
extern volatile __bit                   IOCDN3              __at(0x20F3);	// @ (0x41E * 8 + 3)
#define                                 IOCDN3_bit          _BIT_ACCESS(IOCDN,3)
// IOCDN<IOCDN4>
extern volatile __bit                   IOCDN4              __at(0x20F4);	// @ (0x41E * 8 + 4)
#define                                 IOCDN4_bit          _BIT_ACCESS(IOCDN,4)
// IOCDN<IOCDN5>
extern volatile __bit                   IOCDN5              __at(0x20F5);	// @ (0x41E * 8 + 5)
#define                                 IOCDN5_bit          _BIT_ACCESS(IOCDN,5)
// IOCDN<IOCDN6>
extern volatile __bit                   IOCDN6              __at(0x20F6);	// @ (0x41E * 8 + 6)
#define                                 IOCDN6_bit          _BIT_ACCESS(IOCDN,6)
// IOCDN<IOCDN7>
extern volatile __bit                   IOCDN7              __at(0x20F7);	// @ (0x41E * 8 + 7)
#define                                 IOCDN7_bit          _BIT_ACCESS(IOCDN,7)
// IOCDP<IOCDP0>
extern volatile __bit                   IOCDP0              __at(0x20E8);	// @ (0x41D * 8 + 0)
#define                                 IOCDP0_bit          _BIT_ACCESS(IOCDP,0)
// IOCDP<IOCDP1>
extern volatile __bit                   IOCDP1              __at(0x20E9);	// @ (0x41D * 8 + 1)
#define                                 IOCDP1_bit          _BIT_ACCESS(IOCDP,1)
// IOCDP<IOCDP2>
extern volatile __bit                   IOCDP2              __at(0x20EA);	// @ (0x41D * 8 + 2)
#define                                 IOCDP2_bit          _BIT_ACCESS(IOCDP,2)
// IOCDP<IOCDP3>
extern volatile __bit                   IOCDP3              __at(0x20EB);	// @ (0x41D * 8 + 3)
#define                                 IOCDP3_bit          _BIT_ACCESS(IOCDP,3)
// IOCDP<IOCDP4>
extern volatile __bit                   IOCDP4              __at(0x20EC);	// @ (0x41D * 8 + 4)
#define                                 IOCDP4_bit          _BIT_ACCESS(IOCDP,4)
// IOCDP<IOCDP5>
extern volatile __bit                   IOCDP5              __at(0x20ED);	// @ (0x41D * 8 + 5)
#define                                 IOCDP5_bit          _BIT_ACCESS(IOCDP,5)
// IOCDP<IOCDP6>
extern volatile __bit                   IOCDP6              __at(0x20EE);	// @ (0x41D * 8 + 6)
#define                                 IOCDP6_bit          _BIT_ACCESS(IOCDP,6)
// IOCDP<IOCDP7>
extern volatile __bit                   IOCDP7              __at(0x20EF);	// @ (0x41D * 8 + 7)
#define                                 IOCDP7_bit          _BIT_ACCESS(IOCDP,7)
// IOCEF<IOCEF3>
extern volatile __bit                   IOCEF3              __at(0x213B);	// @ (0x427 * 8 + 3)
#define                                 IOCEF3_bit          _BIT_ACCESS(IOCEF,3)
// IOCEN<IOCEN3>
extern volatile __bit                   IOCEN3              __at(0x2133);	// @ (0x426 * 8 + 3)
#define                                 IOCEN3_bit          _BIT_ACCESS(IOCEN,3)
// IOCEP<IOCEP3>
extern volatile __bit                   IOCEP3              __at(0x212B);	// @ (0x425 * 8 + 3)
#define                                 IOCEP3_bit          _BIT_ACCESS(IOCEP,3)
// IOCFF<IOCFF0>
extern volatile __bit                   IOCFF0              __at(0x2178);	// @ (0x42F * 8 + 0)
#define                                 IOCFF0_bit          _BIT_ACCESS(IOCFF,0)
// IOCFF<IOCFF1>
extern volatile __bit                   IOCFF1              __at(0x2179);	// @ (0x42F * 8 + 1)
#define                                 IOCFF1_bit          _BIT_ACCESS(IOCFF,1)
// IOCFF<IOCFF2>
extern volatile __bit                   IOCFF2              __at(0x217A);	// @ (0x42F * 8 + 2)
#define                                 IOCFF2_bit          _BIT_ACCESS(IOCFF,2)
// IOCFF<IOCFF3>
extern volatile __bit                   IOCFF3              __at(0x217B);	// @ (0x42F * 8 + 3)
#define                                 IOCFF3_bit          _BIT_ACCESS(IOCFF,3)
// IOCFF<IOCFF4>
extern volatile __bit                   IOCFF4              __at(0x217C);	// @ (0x42F * 8 + 4)
#define                                 IOCFF4_bit          _BIT_ACCESS(IOCFF,4)
// IOCFF<IOCFF5>
extern volatile __bit                   IOCFF5              __at(0x217D);	// @ (0x42F * 8 + 5)
#define                                 IOCFF5_bit          _BIT_ACCESS(IOCFF,5)
// IOCFF<IOCFF6>
extern volatile __bit                   IOCFF6              __at(0x217E);	// @ (0x42F * 8 + 6)
#define                                 IOCFF6_bit          _BIT_ACCESS(IOCFF,6)
// IOCFF<IOCFF7>
extern volatile __bit                   IOCFF7              __at(0x217F);	// @ (0x42F * 8 + 7)
#define                                 IOCFF7_bit          _BIT_ACCESS(IOCFF,7)
// IOCFN<IOCFN0>
extern volatile __bit                   IOCFN0              __at(0x2170);	// @ (0x42E * 8 + 0)
#define                                 IOCFN0_bit          _BIT_ACCESS(IOCFN,0)
// IOCFN<IOCFN1>
extern volatile __bit                   IOCFN1              __at(0x2171);	// @ (0x42E * 8 + 1)
#define                                 IOCFN1_bit          _BIT_ACCESS(IOCFN,1)
// IOCFN<IOCFN2>
extern volatile __bit                   IOCFN2              __at(0x2172);	// @ (0x42E * 8 + 2)
#define                                 IOCFN2_bit          _BIT_ACCESS(IOCFN,2)
// IOCFN<IOCFN3>
extern volatile __bit                   IOCFN3              __at(0x2173);	// @ (0x42E * 8 + 3)
#define                                 IOCFN3_bit          _BIT_ACCESS(IOCFN,3)
// IOCFN<IOCFN4>
extern volatile __bit                   IOCFN4              __at(0x2174);	// @ (0x42E * 8 + 4)
#define                                 IOCFN4_bit          _BIT_ACCESS(IOCFN,4)
// IOCFN<IOCFN5>
extern volatile __bit                   IOCFN5              __at(0x2175);	// @ (0x42E * 8 + 5)
#define                                 IOCFN5_bit          _BIT_ACCESS(IOCFN,5)
// IOCFN<IOCFN6>
extern volatile __bit                   IOCFN6              __at(0x2176);	// @ (0x42E * 8 + 6)
#define                                 IOCFN6_bit          _BIT_ACCESS(IOCFN,6)
// IOCFN<IOCFN7>
extern volatile __bit                   IOCFN7              __at(0x2177);	// @ (0x42E * 8 + 7)
#define                                 IOCFN7_bit          _BIT_ACCESS(IOCFN,7)
// IOCFP<IOCFP0>
extern volatile __bit                   IOCFP0              __at(0x2168);	// @ (0x42D * 8 + 0)
#define                                 IOCFP0_bit          _BIT_ACCESS(IOCFP,0)
// IOCFP<IOCFP1>
extern volatile __bit                   IOCFP1              __at(0x2169);	// @ (0x42D * 8 + 1)
#define                                 IOCFP1_bit          _BIT_ACCESS(IOCFP,1)
// IOCFP<IOCFP2>
extern volatile __bit                   IOCFP2              __at(0x216A);	// @ (0x42D * 8 + 2)
#define                                 IOCFP2_bit          _BIT_ACCESS(IOCFP,2)
// IOCFP<IOCFP3>
extern volatile __bit                   IOCFP3              __at(0x216B);	// @ (0x42D * 8 + 3)
#define                                 IOCFP3_bit          _BIT_ACCESS(IOCFP,3)
// IOCFP<IOCFP4>
extern volatile __bit                   IOCFP4              __at(0x216C);	// @ (0x42D * 8 + 4)
#define                                 IOCFP4_bit          _BIT_ACCESS(IOCFP,4)
// IOCFP<IOCFP5>
extern volatile __bit                   IOCFP5              __at(0x216D);	// @ (0x42D * 8 + 5)
#define                                 IOCFP5_bit          _BIT_ACCESS(IOCFP,5)
// IOCFP<IOCFP6>
extern volatile __bit                   IOCFP6              __at(0x216E);	// @ (0x42D * 8 + 6)
#define                                 IOCFP6_bit          _BIT_ACCESS(IOCFP,6)
// IOCFP<IOCFP7>
extern volatile __bit                   IOCFP7              __at(0x216F);	// @ (0x42D * 8 + 7)
#define                                 IOCFP7_bit          _BIT_ACCESS(IOCFP,7)
// PIE0<IOCIE>
extern volatile __bit                   IOCIE               __at(0x2557);	// @ (0x4AA * 8 + 7)
#define                                 IOCIE_bit           _BIT_ACCESS(PIE0,7)
// PIR0<IOCIF>
extern volatile __bit                   IOCIF               __at(0x25B7);	// @ (0x4B6 * 8 + 7)
#define                                 IOCIF_bit           _BIT_ACCESS(PIR0,7)
// IPR0<IOCIP>
extern volatile __bit                   IOCIP               __at(0x24F7);	// @ (0x49E * 8 + 7)
#define                                 IOCIP_bit           _BIT_ACCESS(IPR0,7)
// PMD0<IOCMD>
extern volatile __bit                   IOCMD               __at(0x310);	// @ (0x62 * 8 + 0)
#define                                 IOCMD_bit           _BIT_ACCESS(PMD0,0)
// PIE2<IOCSRIE>
extern volatile __bit                   IOCSRIE             __at(0x2562);	// @ (0x4AC * 8 + 2)
#define                                 IOCSRIE_bit         _BIT_ACCESS(PIE2,2)
// PIR2<IOCSRIF>
extern volatile __bit                   IOCSRIF             __at(0x25C2);	// @ (0x4B8 * 8 + 2)
#define                                 IOCSRIF_bit         _BIT_ACCESS(PIR2,2)
// IPR2<IOCSRIP>
extern volatile __bit                   IOCSRIP             __at(0x2502);	// @ (0x4A0 * 8 + 2)
#define                                 IOCSRIP_bit         _BIT_ACCESS(IPR2,2)
// IOCWF<IOCWF0>
extern volatile __bit                   IOCWF0              __at(0x21F8);	// @ (0x43F * 8 + 0)
#define                                 IOCWF0_bit          _BIT_ACCESS(IOCWF,0)
// IOCWF<IOCWF1>
extern volatile __bit                   IOCWF1              __at(0x21F9);	// @ (0x43F * 8 + 1)
#define                                 IOCWF1_bit          _BIT_ACCESS(IOCWF,1)
// IOCWF<IOCWF2>
extern volatile __bit                   IOCWF2              __at(0x21FA);	// @ (0x43F * 8 + 2)
#define                                 IOCWF2_bit          _BIT_ACCESS(IOCWF,2)
// IOCWF<IOCWF3>
extern volatile __bit                   IOCWF3              __at(0x21FB);	// @ (0x43F * 8 + 3)
#define                                 IOCWF3_bit          _BIT_ACCESS(IOCWF,3)
// IOCWF<IOCWF4>
extern volatile __bit                   IOCWF4              __at(0x21FC);	// @ (0x43F * 8 + 4)
#define                                 IOCWF4_bit          _BIT_ACCESS(IOCWF,4)
// IOCWF<IOCWF5>
extern volatile __bit                   IOCWF5              __at(0x21FD);	// @ (0x43F * 8 + 5)
#define                                 IOCWF5_bit          _BIT_ACCESS(IOCWF,5)
// IOCWF<IOCWF6>
extern volatile __bit                   IOCWF6              __at(0x21FE);	// @ (0x43F * 8 + 6)
#define                                 IOCWF6_bit          _BIT_ACCESS(IOCWF,6)
// IOCWF<IOCWF7>
extern volatile __bit                   IOCWF7              __at(0x21FF);	// @ (0x43F * 8 + 7)
#define                                 IOCWF7_bit          _BIT_ACCESS(IOCWF,7)
// IOCWN<IOCWN0>
extern volatile __bit                   IOCWN0              __at(0x21F0);	// @ (0x43E * 8 + 0)
#define                                 IOCWN0_bit          _BIT_ACCESS(IOCWN,0)
// IOCWN<IOCWN1>
extern volatile __bit                   IOCWN1              __at(0x21F1);	// @ (0x43E * 8 + 1)
#define                                 IOCWN1_bit          _BIT_ACCESS(IOCWN,1)
// IOCWN<IOCWN2>
extern volatile __bit                   IOCWN2              __at(0x21F2);	// @ (0x43E * 8 + 2)
#define                                 IOCWN2_bit          _BIT_ACCESS(IOCWN,2)
// IOCWN<IOCWN3>
extern volatile __bit                   IOCWN3              __at(0x21F3);	// @ (0x43E * 8 + 3)
#define                                 IOCWN3_bit          _BIT_ACCESS(IOCWN,3)
// IOCWN<IOCWN4>
extern volatile __bit                   IOCWN4              __at(0x21F4);	// @ (0x43E * 8 + 4)
#define                                 IOCWN4_bit          _BIT_ACCESS(IOCWN,4)
// IOCWN<IOCWN5>
extern volatile __bit                   IOCWN5              __at(0x21F5);	// @ (0x43E * 8 + 5)
#define                                 IOCWN5_bit          _BIT_ACCESS(IOCWN,5)
// IOCWN<IOCWN6>
extern volatile __bit                   IOCWN6              __at(0x21F6);	// @ (0x43E * 8 + 6)
#define                                 IOCWN6_bit          _BIT_ACCESS(IOCWN,6)
// IOCWN<IOCWN7>
extern volatile __bit                   IOCWN7              __at(0x21F7);	// @ (0x43E * 8 + 7)
#define                                 IOCWN7_bit          _BIT_ACCESS(IOCWN,7)
// IOCWP<IOCWP0>
extern volatile __bit                   IOCWP0              __at(0x21E8);	// @ (0x43D * 8 + 0)
#define                                 IOCWP0_bit          _BIT_ACCESS(IOCWP,0)
// IOCWP<IOCWP1>
extern volatile __bit                   IOCWP1              __at(0x21E9);	// @ (0x43D * 8 + 1)
#define                                 IOCWP1_bit          _BIT_ACCESS(IOCWP,1)
// IOCWP<IOCWP2>
extern volatile __bit                   IOCWP2              __at(0x21EA);	// @ (0x43D * 8 + 2)
#define                                 IOCWP2_bit          _BIT_ACCESS(IOCWP,2)
// IOCWP<IOCWP3>
extern volatile __bit                   IOCWP3              __at(0x21EB);	// @ (0x43D * 8 + 3)
#define                                 IOCWP3_bit          _BIT_ACCESS(IOCWP,3)
// IOCWP<IOCWP4>
extern volatile __bit                   IOCWP4              __at(0x21EC);	// @ (0x43D * 8 + 4)
#define                                 IOCWP4_bit          _BIT_ACCESS(IOCWP,4)
// IOCWP<IOCWP5>
extern volatile __bit                   IOCWP5              __at(0x21ED);	// @ (0x43D * 8 + 5)
#define                                 IOCWP5_bit          _BIT_ACCESS(IOCWP,5)
// IOCWP<IOCWP6>
extern volatile __bit                   IOCWP6              __at(0x21EE);	// @ (0x43D * 8 + 6)
#define                                 IOCWP6_bit          _BIT_ACCESS(IOCWP,6)
// IOCWP<IOCWP7>
extern volatile __bit                   IOCWP7              __at(0x21EF);	// @ (0x43D * 8 + 7)
#define                                 IOCWP7_bit          _BIT_ACCESS(IOCWP,7)
// CWG1ISM<ISM0>
extern volatile __bit                   ISM0                __at(0x1DE8);	// @ (0x3BD * 8 + 0)
#define                                 ISM0_bit            _BIT_ACCESS(CWG1ISM,0)
// CWG1ISM<ISM1>
extern volatile __bit                   ISM1                __at(0x1DE9);	// @ (0x3BD * 8 + 1)
#define                                 ISM1_bit            _BIT_ACCESS(CWG1ISM,1)
// CWG1ISM<ISM2>
extern volatile __bit                   ISM2                __at(0x1DEA);	// @ (0x3BD * 8 + 2)
#define                                 ISM2_bit            _BIT_ACCESS(CWG1ISM,2)
// CWG1ISM<ISM3>
extern volatile __bit                   ISM3                __at(0x1DEB);	// @ (0x3BD * 8 + 3)
#define                                 ISM3_bit            _BIT_ACCESS(CWG1ISM,3)
// CWG1ISM<ISM4>
extern volatile __bit                   ISM4                __at(0x1DEC);	// @ (0x3BD * 8 + 4)
#define                                 ISM4_bit            _BIT_ACCESS(CWG1ISM,4)
// ISRPR<ISRPR0>
extern volatile __bit                   ISRPR0              __at(0x5F8);	// @ (0xBF * 8 + 0)
#define                                 ISRPR0_bit          _BIT_ACCESS(ISRPR,0)
// ISRPR<ISRPR1>
extern volatile __bit                   ISRPR1              __at(0x5F9);	// @ (0xBF * 8 + 1)
#define                                 ISRPR1_bit          _BIT_ACCESS(ISRPR,1)
// ISRPR<ISRPR2>
extern volatile __bit                   ISRPR2              __at(0x5FA);	// @ (0xBF * 8 + 2)
#define                                 ISRPR2_bit          _BIT_ACCESS(ISRPR,2)
// IVTLOCK<IVTLOCKED>
extern volatile __bit                   IVTLOCKED           __at(0x22C8);	// @ (0x459 * 8 + 0)
#define                                 IVTLOCKED_bit       _BIT_ACCESS(IVTLOCK,0)
// SCANLADRL<LADR0>
extern volatile __bit                   LADR0               __at(0x1AD0);	// @ (0x35A * 8 + 0)
#define                                 LADR0_bit           _BIT_ACCESS(SCANLADRL,0)
// SCANLADRL<LADR1>
extern volatile __bit                   LADR1               __at(0x1AD1);	// @ (0x35A * 8 + 1)
#define                                 LADR1_bit           _BIT_ACCESS(SCANLADRL,1)
// SCANLADRH<LADR10>
extern volatile __bit                   LADR10              __at(0x1ADA);	// @ (0x35B * 8 + 2)
#define                                 LADR10_bit          _BIT_ACCESS(SCANLADRH,2)
// SCANLADRH<LADR11>
extern volatile __bit                   LADR11              __at(0x1ADB);	// @ (0x35B * 8 + 3)
#define                                 LADR11_bit          _BIT_ACCESS(SCANLADRH,3)
// SCANLADRH<LADR12>
extern volatile __bit                   LADR12              __at(0x1ADC);	// @ (0x35B * 8 + 4)
#define                                 LADR12_bit          _BIT_ACCESS(SCANLADRH,4)
// SCANLADRH<LADR13>
extern volatile __bit                   LADR13              __at(0x1ADD);	// @ (0x35B * 8 + 5)
#define                                 LADR13_bit          _BIT_ACCESS(SCANLADRH,5)
// SCANLADRH<LADR14>
extern volatile __bit                   LADR14              __at(0x1ADE);	// @ (0x35B * 8 + 6)
#define                                 LADR14_bit          _BIT_ACCESS(SCANLADRH,6)
// SCANLADRH<LADR15>
extern volatile __bit                   LADR15              __at(0x1ADF);	// @ (0x35B * 8 + 7)
#define                                 LADR15_bit          _BIT_ACCESS(SCANLADRH,7)
// SCANLADRU<LADR16>
extern volatile __bit                   LADR16              __at(0x1AE0);	// @ (0x35C * 8 + 0)
#define                                 LADR16_bit          _BIT_ACCESS(SCANLADRU,0)
// SCANLADRU<LADR17>
extern volatile __bit                   LADR17              __at(0x1AE1);	// @ (0x35C * 8 + 1)
#define                                 LADR17_bit          _BIT_ACCESS(SCANLADRU,1)
// SCANLADRU<LADR18>
extern volatile __bit                   LADR18              __at(0x1AE2);	// @ (0x35C * 8 + 2)
#define                                 LADR18_bit          _BIT_ACCESS(SCANLADRU,2)
// SCANLADRU<LADR19>
extern volatile __bit                   LADR19              __at(0x1AE3);	// @ (0x35C * 8 + 3)
#define                                 LADR19_bit          _BIT_ACCESS(SCANLADRU,3)
// SCANLADRL<LADR2>
extern volatile __bit                   LADR2               __at(0x1AD2);	// @ (0x35A * 8 + 2)
#define                                 LADR2_bit           _BIT_ACCESS(SCANLADRL,2)
// SCANLADRU<LADR20>
extern volatile __bit                   LADR20              __at(0x1AE4);	// @ (0x35C * 8 + 4)
#define                                 LADR20_bit          _BIT_ACCESS(SCANLADRU,4)
// SCANLADRU<LADR21>
extern volatile __bit                   LADR21              __at(0x1AE5);	// @ (0x35C * 8 + 5)
#define                                 LADR21_bit          _BIT_ACCESS(SCANLADRU,5)
// SCANLADRL<LADR3>
extern volatile __bit                   LADR3               __at(0x1AD3);	// @ (0x35A * 8 + 3)
#define                                 LADR3_bit           _BIT_ACCESS(SCANLADRL,3)
// SCANLADRL<LADR4>
extern volatile __bit                   LADR4               __at(0x1AD4);	// @ (0x35A * 8 + 4)
#define                                 LADR4_bit           _BIT_ACCESS(SCANLADRL,4)
// SCANLADRL<LADR5>
extern volatile __bit                   LADR5               __at(0x1AD5);	// @ (0x35A * 8 + 5)
#define                                 LADR5_bit           _BIT_ACCESS(SCANLADRL,5)
// SCANLADRL<LADR6>
extern volatile __bit                   LADR6               __at(0x1AD6);	// @ (0x35A * 8 + 6)
#define                                 LADR6_bit           _BIT_ACCESS(SCANLADRL,6)
// SCANLADRL<LADR7>
extern volatile __bit                   LADR7               __at(0x1AD7);	// @ (0x35A * 8 + 7)
#define                                 LADR7_bit           _BIT_ACCESS(SCANLADRL,7)
// SCANLADRH<LADR8>
extern volatile __bit                   LADR8               __at(0x1AD8);	// @ (0x35B * 8 + 0)
#define                                 LADR8_bit           _BIT_ACCESS(SCANLADRH,0)
// SCANLADRH<LADR9>
extern volatile __bit                   LADR9               __at(0x1AD9);	// @ (0x35B * 8 + 1)
#define                                 LADR9_bit           _BIT_ACCESS(SCANLADRH,1)
// LATA<LATA0>
extern volatile __bit                   LATA0               __at(0xA00);	// @ (0x140 * 8 + 0)
#define                                 LATA0_bit           _BIT_ACCESS(LATA,0)
// LATA<LATA1>
extern volatile __bit                   LATA1               __at(0xA01);	// @ (0x140 * 8 + 1)
#define                                 LATA1_bit           _BIT_ACCESS(LATA,1)
// LATA<LATA2>
extern volatile __bit                   LATA2               __at(0xA02);	// @ (0x140 * 8 + 2)
#define                                 LATA2_bit           _BIT_ACCESS(LATA,2)
// LATA<LATA3>
extern volatile __bit                   LATA3               __at(0xA03);	// @ (0x140 * 8 + 3)
#define                                 LATA3_bit           _BIT_ACCESS(LATA,3)
// LATA<LATA4>
extern volatile __bit                   LATA4               __at(0xA04);	// @ (0x140 * 8 + 4)
#define                                 LATA4_bit           _BIT_ACCESS(LATA,4)
// LATA<LATA5>
extern volatile __bit                   LATA5               __at(0xA05);	// @ (0x140 * 8 + 5)
#define                                 LATA5_bit           _BIT_ACCESS(LATA,5)
// LATA<LATA6>
extern volatile __bit                   LATA6               __at(0xA06);	// @ (0x140 * 8 + 6)
#define                                 LATA6_bit           _BIT_ACCESS(LATA,6)
// LATA<LATA7>
