garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f55q24.h
extern volatile __bit                   TMR31               __at(0x1919);	// @ (0x323 * 8 + 1)
#define                                 TMR31_bit           _BIT_ACCESS(TMR3L,1)
// TMR3H<TMR310>
extern volatile __bit                   TMR310              __at(0x1922);	// @ (0x324 * 8 + 2)
#define                                 TMR310_bit          _BIT_ACCESS(TMR3H,2)
// TMR3H<TMR311>
extern volatile __bit                   TMR311              __at(0x1923);	// @ (0x324 * 8 + 3)
#define                                 TMR311_bit          _BIT_ACCESS(TMR3H,3)
// TMR3H<TMR312>
extern volatile __bit                   TMR312              __at(0x1924);	// @ (0x324 * 8 + 4)
#define                                 TMR312_bit          _BIT_ACCESS(TMR3H,4)
// TMR3H<TMR313>
extern volatile __bit                   TMR313              __at(0x1925);	// @ (0x324 * 8 + 5)
#define                                 TMR313_bit          _BIT_ACCESS(TMR3H,5)
// TMR3H<TMR314>
extern volatile __bit                   TMR314              __at(0x1926);	// @ (0x324 * 8 + 6)
#define                                 TMR314_bit          _BIT_ACCESS(TMR3H,6)
// TMR3H<TMR315>
extern volatile __bit                   TMR315              __at(0x1927);	// @ (0x324 * 8 + 7)
#define                                 TMR315_bit          _BIT_ACCESS(TMR3H,7)
// TMR3L<TMR32>
extern volatile __bit                   TMR32               __at(0x191A);	// @ (0x323 * 8 + 2)
#define                                 TMR32_bit           _BIT_ACCESS(TMR3L,2)
// TMR3L<TMR33>
extern volatile __bit                   TMR33               __at(0x191B);	// @ (0x323 * 8 + 3)
#define                                 TMR33_bit           _BIT_ACCESS(TMR3L,3)
// TMR3L<TMR34>
extern volatile __bit                   TMR34               __at(0x191C);	// @ (0x323 * 8 + 4)
#define                                 TMR34_bit           _BIT_ACCESS(TMR3L,4)
// TMR3L<TMR35>
extern volatile __bit                   TMR35               __at(0x191D);	// @ (0x323 * 8 + 5)
#define                                 TMR35_bit           _BIT_ACCESS(TMR3L,5)
// TMR3L<TMR36>
extern volatile __bit                   TMR36               __at(0x191E);	// @ (0x323 * 8 + 6)
#define                                 TMR36_bit           _BIT_ACCESS(TMR3L,6)
// TMR3L<TMR37>
extern volatile __bit                   TMR37               __at(0x191F);	// @ (0x323 * 8 + 7)
#define                                 TMR37_bit           _BIT_ACCESS(TMR3L,7)
// TMR3H<TMR38>
extern volatile __bit                   TMR38               __at(0x1920);	// @ (0x324 * 8 + 0)
#define                                 TMR38_bit           _BIT_ACCESS(TMR3H,0)
// TMR3H<TMR39>
extern volatile __bit                   TMR39               __at(0x1921);	// @ (0x324 * 8 + 1)
#define                                 TMR39_bit           _BIT_ACCESS(TMR3H,1)
// PIE4<TMR3GIE>
extern volatile __bit                   TMR3GIE             __at(0x2575);	// @ (0x4AE * 8 + 5)
#define                                 TMR3GIE_bit         _BIT_ACCESS(PIE4,5)
// PIR4<TMR3GIF>
extern volatile __bit                   TMR3GIF             __at(0x25D5);	// @ (0x4BA * 8 + 5)
#define                                 TMR3GIF_bit         _BIT_ACCESS(PIR4,5)
// IPR4<TMR3GIP>
extern volatile __bit                   TMR3GIP             __at(0x2515);	// @ (0x4A2 * 8 + 5)
#define                                 TMR3GIP_bit         _BIT_ACCESS(IPR4,5)
// TMR3H<TMR3H0>
extern volatile __bit                   TMR3H0              __at(0x1920);	// @ (0x324 * 8 + 0)
#define                                 TMR3H0_bit          _BIT_ACCESS(TMR3H,0)
// TMR3H<TMR3H1>
extern volatile __bit                   TMR3H1              __at(0x1921);	// @ (0x324 * 8 + 1)
#define                                 TMR3H1_bit          _BIT_ACCESS(TMR3H,1)
// TMR3H<TMR3H2>
extern volatile __bit                   TMR3H2              __at(0x1922);	// @ (0x324 * 8 + 2)
#define                                 TMR3H2_bit          _BIT_ACCESS(TMR3H,2)
// TMR3H<TMR3H3>
extern volatile __bit                   TMR3H3              __at(0x1923);	// @ (0x324 * 8 + 3)
#define                                 TMR3H3_bit          _BIT_ACCESS(TMR3H,3)
// TMR3H<TMR3H4>
extern volatile __bit                   TMR3H4              __at(0x1924);	// @ (0x324 * 8 + 4)
#define                                 TMR3H4_bit          _BIT_ACCESS(TMR3H,4)
// TMR3H<TMR3H5>
extern volatile __bit                   TMR3H5              __at(0x1925);	// @ (0x324 * 8 + 5)
#define                                 TMR3H5_bit          _BIT_ACCESS(TMR3H,5)
// TMR3H<TMR3H6>
extern volatile __bit                   TMR3H6              __at(0x1926);	// @ (0x324 * 8 + 6)
#define                                 TMR3H6_bit          _BIT_ACCESS(TMR3H,6)
// TMR3H<TMR3H7>
extern volatile __bit                   TMR3H7              __at(0x1927);	// @ (0x324 * 8 + 7)
#define                                 TMR3H7_bit          _BIT_ACCESS(TMR3H,7)
// PIE4<TMR3IE>
extern volatile __bit                   TMR3IE              __at(0x2574);	// @ (0x4AE * 8 + 4)
#define                                 TMR3IE_bit          _BIT_ACCESS(PIE4,4)
// PIR4<TMR3IF>
extern volatile __bit                   TMR3IF              __at(0x25D4);	// @ (0x4BA * 8 + 4)
#define                                 TMR3IF_bit          _BIT_ACCESS(PIR4,4)
// IPR4<TMR3IP>
extern volatile __bit                   TMR3IP              __at(0x2514);	// @ (0x4A2 * 8 + 4)
#define                                 TMR3IP_bit          _BIT_ACCESS(IPR4,4)
// TMR3L<TMR3L0>
extern volatile __bit                   TMR3L0              __at(0x1918);	// @ (0x323 * 8 + 0)
#define                                 TMR3L0_bit          _BIT_ACCESS(TMR3L,0)
// TMR3L<TMR3L1>
extern volatile __bit                   TMR3L1              __at(0x1919);	// @ (0x323 * 8 + 1)
#define                                 TMR3L1_bit          _BIT_ACCESS(TMR3L,1)
// TMR3L<TMR3L2>
extern volatile __bit                   TMR3L2              __at(0x191A);	// @ (0x323 * 8 + 2)
#define                                 TMR3L2_bit          _BIT_ACCESS(TMR3L,2)
// TMR3L<TMR3L3>
extern volatile __bit                   TMR3L3              __at(0x191B);	// @ (0x323 * 8 + 3)
#define                                 TMR3L3_bit          _BIT_ACCESS(TMR3L,3)
// TMR3L<TMR3L4>
extern volatile __bit                   TMR3L4              __at(0x191C);	// @ (0x323 * 8 + 4)
#define                                 TMR3L4_bit          _BIT_ACCESS(TMR3L,4)
// TMR3L<TMR3L5>
extern volatile __bit                   TMR3L5              __at(0x191D);	// @ (0x323 * 8 + 5)
#define                                 TMR3L5_bit          _BIT_ACCESS(TMR3L,5)
// TMR3L<TMR3L6>
extern volatile __bit                   TMR3L6              __at(0x191E);	// @ (0x323 * 8 + 6)
#define                                 TMR3L6_bit          _BIT_ACCESS(TMR3L,6)
// TMR3L<TMR3L7>
extern volatile __bit                   TMR3L7              __at(0x191F);	// @ (0x323 * 8 + 7)
#define                                 TMR3L7_bit          _BIT_ACCESS(TMR3L,7)
// PMD1<TMR3MD>
extern volatile __bit                   TMR3MD              __at(0x31B);	// @ (0x63 * 8 + 3)
#define                                 TMR3MD_bit          _BIT_ACCESS(PMD1,3)
// T3CON<TMR3ON>
extern volatile __bit                   TMR3ON              __at(0x1928);	// @ (0x325 * 8 + 0)
#define                                 TMR3ON_bit          _BIT_ACCESS(T3CON,0)
// PIE10<TMR4IE>
extern volatile __bit                   TMR4IE              __at(0x25A3);	// @ (0x4B4 * 8 + 3)
#define                                 TMR4IE_bit          _BIT_ACCESS(PIE10,3)
// PIR10<TMR4IF>
extern volatile __bit                   TMR4IF              __at(0x2603);	// @ (0x4C0 * 8 + 3)
#define                                 TMR4IF_bit          _BIT_ACCESS(PIR10,3)
// IPR10<TMR4IP>
extern volatile __bit                   TMR4IP              __at(0x2543);	// @ (0x4A8 * 8 + 3)
#define                                 TMR4IP_bit          _BIT_ACCESS(IPR10,3)
// PMD1<TMR4MD>
extern volatile __bit                   TMR4MD              __at(0x31C);	// @ (0x63 * 8 + 4)
#define                                 TMR4MD_bit          _BIT_ACCESS(PMD1,4)
// T4CON<TMR4ON>
extern volatile __bit                   TMR4ON              __at(0x1967);	// @ (0x32C * 8 + 7)
#define                                 TMR4ON_bit          _BIT_ACCESS(T4CON,7)
// PIE5<TMR6IE>
extern volatile __bit                   TMR6IE              __at(0x257B);	// @ (0x4AF * 8 + 3)
#define                                 TMR6IE_bit          _BIT_ACCESS(PIE5,3)
// PIR5<TMR6IF>
extern volatile __bit                   TMR6IF              __at(0x25DB);	// @ (0x4BB * 8 + 3)
#define                                 TMR6IF_bit          _BIT_ACCESS(PIR5,3)
// IPR5<TMR6IP>
extern volatile __bit                   TMR6IP              __at(0x251B);	// @ (0x4A3 * 8 + 3)
#define                                 TMR6IP_bit          _BIT_ACCESS(IPR5,3)
// PMD1<TMR6MD>
extern volatile __bit                   TMR6MD              __at(0x31D);	// @ (0x63 * 8 + 5)
#define                                 TMR6MD_bit          _BIT_ACCESS(PMD1,5)
// T6CON<TMR6ON>
extern volatile __bit                   TMR6ON              __at(0x199F);	// @ (0x333 * 8 + 7)
#define                                 TMR6ON_bit          _BIT_ACCESS(T6CON,7)
// TU16ACON1<TMRAOSEN>
extern volatile __bit                   TMRAOSEN            __at(0x1CF6);	// @ (0x39E * 8 + 6)
#define                                 TMRAOSEN_bit        _BIT_ACCESS(TU16ACON1,6)
// TU16BCON1<TMRBOSEN>
extern volatile __bit                   TMRBOSEN            __at(0x1D66);	// @ (0x3AC * 8 + 6)
#define                                 TMRBOSEN_bit        _BIT_ACCESS(TU16BCON1,6)
// SCANCON0<TRIGEN>
extern volatile __bit                   TRIGEN              __at(0x1B06);	// @ (0x360 * 8 + 6)
#define                                 TRIGEN_bit          _BIT_ACCESS(SCANCON0,6)
// TRISA<TRISA0>
extern volatile __bit                   TRISA0              __at(0xA40);	// @ (0x148 * 8 + 0)
#define                                 TRISA0_bit          _BIT_ACCESS(TRISA,0)
// TRISA<TRISA1>
extern volatile __bit                   TRISA1              __at(0xA41);	// @ (0x148 * 8 + 1)
#define                                 TRISA1_bit          _BIT_ACCESS(TRISA,1)
// TRISA<TRISA2>
extern volatile __bit                   TRISA2              __at(0xA42);	// @ (0x148 * 8 + 2)
#define                                 TRISA2_bit          _BIT_ACCESS(TRISA,2)
// TRISA<TRISA3>
extern volatile __bit                   TRISA3              __at(0xA43);	// @ (0x148 * 8 + 3)
#define                                 TRISA3_bit          _BIT_ACCESS(TRISA,3)
// TRISA<TRISA4>
extern volatile __bit                   TRISA4              __at(0xA44);	// @ (0x148 * 8 + 4)
#define                                 TRISA4_bit          _BIT_ACCESS(TRISA,4)
// TRISA<TRISA5>
extern volatile __bit                   TRISA5              __at(0xA45);	// @ (0x148 * 8 + 5)
#define                                 TRISA5_bit          _BIT_ACCESS(TRISA,5)
// TRISA<TRISA6>
extern volatile __bit                   TRISA6              __at(0xA46);	// @ (0x148 * 8 + 6)
#define                                 TRISA6_bit          _BIT_ACCESS(TRISA,6)
// TRISA<TRISA7>
extern volatile __bit                   TRISA7              __at(0xA47);	// @ (0x148 * 8 + 7)
#define                                 TRISA7_bit          _BIT_ACCESS(TRISA,7)
// TRISB<TRISB0>
extern volatile __bit                   TRISB0              __at(0xA48);	// @ (0x149 * 8 + 0)
#define                                 TRISB0_bit          _BIT_ACCESS(TRISB,0)
// TRISB<TRISB1>
extern volatile __bit                   TRISB1              __at(0xA49);	// @ (0x149 * 8 + 1)
#define                                 TRISB1_bit          _BIT_ACCESS(TRISB,1)
// TRISB<TRISB2>
extern volatile __bit                   TRISB2              __at(0xA4A);	// @ (0x149 * 8 + 2)
#define                                 TRISB2_bit          _BIT_ACCESS(TRISB,2)
// TRISB<TRISB3>
extern volatile __bit                   TRISB3              __at(0xA4B);	// @ (0x149 * 8 + 3)
#define                                 TRISB3_bit          _BIT_ACCESS(TRISB,3)
// TRISB<TRISB4>
extern volatile __bit                   TRISB4              __at(0xA4C);	// @ (0x149 * 8 + 4)
#define                                 TRISB4_bit          _BIT_ACCESS(TRISB,4)
// TRISB<TRISB5>
extern volatile __bit                   TRISB5              __at(0xA4D);	// @ (0x149 * 8 + 5)
#define                                 TRISB5_bit          _BIT_ACCESS(TRISB,5)
// TRISB<TRISB6>
extern volatile __bit                   TRISB6              __at(0xA4E);	// @ (0x149 * 8 + 6)
#define                                 TRISB6_bit          _BIT_ACCESS(TRISB,6)
// TRISB<TRISB7>
extern volatile __bit                   TRISB7              __at(0xA4F);	// @ (0x149 * 8 + 7)
#define                                 TRISB7_bit          _BIT_ACCESS(TRISB,7)
// TRISC<TRISC0>
extern volatile __bit                   TRISC0              __at(0xA50);	// @ (0x14A * 8 + 0)
#define                                 TRISC0_bit          _BIT_ACCESS(TRISC,0)
// TRISC<TRISC1>
extern volatile __bit                   TRISC1              __at(0xA51);	// @ (0x14A * 8 + 1)
#define                                 TRISC1_bit          _BIT_ACCESS(TRISC,1)
// TRISC<TRISC2>
extern volatile __bit                   TRISC2              __at(0xA52);	// @ (0x14A * 8 + 2)
#define                                 TRISC2_bit          _BIT_ACCESS(TRISC,2)
// TRISC<TRISC3>
extern volatile __bit                   TRISC3              __at(0xA53);	// @ (0x14A * 8 + 3)
#define                                 TRISC3_bit          _BIT_ACCESS(TRISC,3)
// TRISC<TRISC4>
extern volatile __bit                   TRISC4              __at(0xA54);	// @ (0x14A * 8 + 4)
#define                                 TRISC4_bit          _BIT_ACCESS(TRISC,4)
// TRISC<TRISC5>
extern volatile __bit                   TRISC5              __at(0xA55);	// @ (0x14A * 8 + 5)
#define                                 TRISC5_bit          _BIT_ACCESS(TRISC,5)
// TRISC<TRISC6>
extern volatile __bit                   TRISC6              __at(0xA56);	// @ (0x14A * 8 + 6)
#define                                 TRISC6_bit          _BIT_ACCESS(TRISC,6)
// TRISC<TRISC7>
extern volatile __bit                   TRISC7              __at(0xA57);	// @ (0x14A * 8 + 7)
#define                                 TRISC7_bit          _BIT_ACCESS(TRISC,7)
// TRISD<TRISD0>
extern volatile __bit                   TRISD0              __at(0xA58);	// @ (0x14B * 8 + 0)
#define                                 TRISD0_bit          _BIT_ACCESS(TRISD,0)
// TRISD<TRISD1>
extern volatile __bit                   TRISD1              __at(0xA59);	// @ (0x14B * 8 + 1)
#define                                 TRISD1_bit          _BIT_ACCESS(TRISD,1)
// TRISD<TRISD2>
extern volatile __bit                   TRISD2              __at(0xA5A);	// @ (0x14B * 8 + 2)
#define                                 TRISD2_bit          _BIT_ACCESS(TRISD,2)
// TRISD<TRISD3>
extern volatile __bit                   TRISD3              __at(0xA5B);	// @ (0x14B * 8 + 3)
#define                                 TRISD3_bit          _BIT_ACCESS(TRISD,3)
// TRISD<TRISD4>
extern volatile __bit                   TRISD4              __at(0xA5C);	// @ (0x14B * 8 + 4)
#define                                 TRISD4_bit          _BIT_ACCESS(TRISD,4)
// TRISD<TRISD5>
extern volatile __bit                   TRISD5              __at(0xA5D);	// @ (0x14B * 8 + 5)
#define                                 TRISD5_bit          _BIT_ACCESS(TRISD,5)
// TRISD<TRISD6>
extern volatile __bit                   TRISD6              __at(0xA5E);	// @ (0x14B * 8 + 6)
#define                                 TRISD6_bit          _BIT_ACCESS(TRISD,6)
// TRISD<TRISD7>
extern volatile __bit                   TRISD7              __at(0xA5F);	// @ (0x14B * 8 + 7)
#define                                 TRISD7_bit          _BIT_ACCESS(TRISD,7)
// TRISE<TRISE0>
extern volatile __bit                   TRISE0              __at(0xA60);	// @ (0x14C * 8 + 0)
#define                                 TRISE0_bit          _BIT_ACCESS(TRISE,0)
// TRISE<TRISE1>
extern volatile __bit                   TRISE1              __at(0xA61);	// @ (0x14C * 8 + 1)
#define                                 TRISE1_bit          _BIT_ACCESS(TRISE,1)
// TRISE<TRISE2>
extern volatile __bit                   TRISE2              __at(0xA62);	// @ (0x14C * 8 + 2)
#define                                 TRISE2_bit          _BIT_ACCESS(TRISE,2)
// TRISF<TRISF0>
extern volatile __bit                   TRISF0              __at(0xA68);	// @ (0x14D * 8 + 0)
#define                                 TRISF0_bit          _BIT_ACCESS(TRISF,0)
// TRISF<TRISF1>
extern volatile __bit                   TRISF1              __at(0xA69);	// @ (0x14D * 8 + 1)
#define                                 TRISF1_bit          _BIT_ACCESS(TRISF,1)
// TRISF<TRISF2>
extern volatile __bit                   TRISF2              __at(0xA6A);	// @ (0x14D * 8 + 2)
#define                                 TRISF2_bit          _BIT_ACCESS(TRISF,2)
// TRISF<TRISF3>
extern volatile __bit                   TRISF3              __at(0xA6B);	// @ (0x14D * 8 + 3)
#define                                 TRISF3_bit          _BIT_ACCESS(TRISF,3)
// TRISF<TRISF4>
extern volatile __bit                   TRISF4              __at(0xA6C);	// @ (0x14D * 8 + 4)
#define                                 TRISF4_bit          _BIT_ACCESS(TRISF,4)
// TRISF<TRISF5>
extern volatile __bit                   TRISF5              __at(0xA6D);	// @ (0x14D * 8 + 5)
#define                                 TRISF5_bit          _BIT_ACCESS(TRISF,5)
// TRISF<TRISF6>
extern volatile __bit                   TRISF6              __at(0xA6E);	// @ (0x14D * 8 + 6)
#define                                 TRISF6_bit          _BIT_ACCESS(TRISF,6)
// TRISF<TRISF7>
extern volatile __bit                   TRISF7              __at(0xA6F);	// @ (0x14D * 8 + 7)
#define                                 TRISF7_bit          _BIT_ACCESS(TRISF,7)
// SCANTRIG<TSEL0>
extern volatile __bit                   TSEL0               __at(0x1B08);	// @ (0x361 * 8 + 0)
#define                                 TSEL0_bit           _BIT_ACCESS(SCANTRIG,0)
// SCANTRIG<TSEL1>
extern volatile __bit                   TSEL1               __at(0x1B09);	// @ (0x361 * 8 + 1)
#define                                 TSEL1_bit           _BIT_ACCESS(SCANTRIG,1)
// SCANTRIG<TSEL2>
extern volatile __bit                   TSEL2               __at(0x1B0A);	// @ (0x361 * 8 + 2)
#define                                 TSEL2_bit           _BIT_ACCESS(SCANTRIG,2)
// SCANTRIG<TSEL3>
extern volatile __bit                   TSEL3               __at(0x1B0B);	// @ (0x361 * 8 + 3)
#define                                 TSEL3_bit           _BIT_ACCESS(SCANTRIG,3)
// SCANTRIG<TSEL4>
extern volatile __bit                   TSEL4               __at(0x1B0C);	// @ (0x361 * 8 + 4)
#define                                 TSEL4_bit           _BIT_ACCESS(SCANTRIG,4)
// FVRCON<TSEN>
extern volatile __bit                   TSEN                __at(0x1EBD);	// @ (0x3D7 * 8 + 5)
#define                                 TSEN_bit            _BIT_ACCESS(FVRCON,5)
// FVRCON<TSRNG>
extern volatile __bit                   TSRNG               __at(0x1EBC);	// @ (0x3D7 * 8 + 4)
#define                                 TSRNG_bit           _BIT_ACCESS(FVRCON,4)
// TU16ACON1<TU16ACAPT>
extern volatile __bit                   TU16ACAPT           __at(0x1CF3);	// @ (0x39E * 8 + 3)
#define                                 TU16ACAPT_bit       _BIT_ACCESS(TU16ACON1,3)
// TU16ACON0<TU16ACIE>
extern volatile __bit                   TU16ACIE            __at(0x1CE8);	// @ (0x39D * 8 + 0)
#define                                 TU16ACIE_bit        _BIT_ACCESS(TU16ACON0,0)
// TU16ACON1<TU16ACIF>
extern volatile __bit                   TU16ACIF            __at(0x1CF0);	// @ (0x39E * 8 + 0)
#define                                 TU16ACIF_bit        _BIT_ACCESS(TU16ACON1,0)
// TU16ACLK<TU16ACLK0>
extern volatile __bit                   TU16ACLK0           __at(0x1D48);	// @ (0x3A9 * 8 + 0)
#define                                 TU16ACLK0_bit       _BIT_ACCESS(TU16ACLK,0)
// TU16ACLK<TU16ACLK1>
extern volatile __bit                   TU16ACLK1           __at(0x1D49);	// @ (0x3A9 * 8 + 1)
#define                                 TU16ACLK1_bit       _BIT_ACCESS(TU16ACLK,1)
// TU16ACLK<TU16ACLK2>
extern volatile __bit                   TU16ACLK2           __at(0x1D4A);	// @ (0x3A9 * 8 + 2)
#define                                 TU16ACLK2_bit       _BIT_ACCESS(TU16ACLK,2)
// TU16ACLK<TU16ACLK3>
extern volatile __bit                   TU16ACLK3           __at(0x1D4B);	// @ (0x3A9 * 8 + 3)
#define                                 TU16ACLK3_bit       _BIT_ACCESS(TU16ACLK,3)
// TU16ACLK<TU16ACLK4>
extern volatile __bit                   TU16ACLK4           __at(0x1D4C);	// @ (0x3A9 * 8 + 4)
#define                                 TU16ACLK4_bit       _BIT_ACCESS(TU16ACLK,4)
// TU16ACON1<TU16ACLR>
extern volatile __bit                   TU16ACLR            __at(0x1CF5);	// @ (0x39E * 8 + 5)
#define                                 TU16ACLR_bit        _BIT_ACCESS(TU16ACON1,5)
// TU16ACON0<TU16ACPOL>
extern volatile __bit                   TU16ACPOL           __at(0x1CEE);	// @ (0x39D * 8 + 6)
#define                                 TU16ACPOL_bit       _BIT_ACCESS(TU16ACON0,6)
// TU16ACRL<TU16ACR0>
extern volatile __bit                   TU16ACR0            __at(0x1D08);	// @ (0x3A1 * 8 + 0)
#define                                 TU16ACR0_bit        _BIT_ACCESS(TU16ACRL,0)
// TU16ACRL<TU16ACR1>
extern volatile __bit                   TU16ACR1            __at(0x1D09);	// @ (0x3A1 * 8 + 1)
#define                                 TU16ACR1_bit        _BIT_ACCESS(TU16ACRL,1)
// TU16ACRH<TU16ACR10>
extern volatile __bit                   TU16ACR10           __at(0x1D12);	// @ (0x3A2 * 8 + 2)
#define                                 TU16ACR10_bit       _BIT_ACCESS(TU16ACRH,2)
// TU16ACRH<TU16ACR11>
extern volatile __bit                   TU16ACR11           __at(0x1D13);	// @ (0x3A2 * 8 + 3)
#define                                 TU16ACR11_bit       _BIT_ACCESS(TU16ACRH,3)
// TU16ACRH<TU16ACR12>
extern volatile __bit                   TU16ACR12           __at(0x1D14);	// @ (0x3A2 * 8 + 4)
#define                                 TU16ACR12_bit       _BIT_ACCESS(TU16ACRH,4)
// TU16ACRH<TU16ACR13>
extern volatile __bit                   TU16ACR13           __at(0x1D15);	// @ (0x3A2 * 8 + 5)
#define                                 TU16ACR13_bit       _BIT_ACCESS(TU16ACRH,5)
// TU16ACRH<TU16ACR14>
extern volatile __bit                   TU16ACR14           __at(0x1D16);	// @ (0x3A2 * 8 + 6)
#define                                 TU16ACR14_bit       _BIT_ACCESS(TU16ACRH,6)
// TU16ACRH<TU16ACR15>
extern volatile __bit                   TU16ACR15           __at(0x1D17);	// @ (0x3A2 * 8 + 7)
#define                                 TU16ACR15_bit       _BIT_ACCESS(TU16ACRH,7)
// TU16ACRL<TU16ACR2>
extern volatile __bit                   TU16ACR2            __at(0x1D0A);	// @ (0x3A1 * 8 + 2)
#define                                 TU16ACR2_bit        _BIT_ACCESS(TU16ACRL,2)
// TU16ACRT<TU16ACR24>
extern volatile __bit                   TU16ACR24           __at(0x1D20);	// @ (0x3A4 * 8 + 0)
#define                                 TU16ACR24_bit       _BIT_ACCESS(TU16ACRT,0)
// TU16ACRT<TU16ACR25>
extern volatile __bit                   TU16ACR25           __at(0x1D21);	// @ (0x3A4 * 8 + 1)
#define                                 TU16ACR25_bit       _BIT_ACCESS(TU16ACRT,1)
// TU16ACRT<TU16ACR26>
